{"comment_id": "kjhfmvg", "comment_author": "AutoModerator", "comment_body": "Hi there! This is an automated message to inform you and/or remind you of several things: \n\n- We have [a wiki](https://www.reddit.com/r/USCIS/wiki/index). It doesn't cover everything but may answer some questions. Pay special attention to the \"[REALLY common questions](https://www.reddit.com/r/USCIS/wiki/index/vfaq)\" at the top of the FAQ section. Please read it, and if it contains the answer to your question, please delete your post. If your post has to do with something covered in the FAQ, we may remove it.\n- If your post is about biometrics, green cards, naturalization or timelines in general, and whether you're asking or sharing, please include your field office/location in your post. If you already did that, great, thank you! If you haven't done that, your post may be removed without notice.\n- This subreddit is not affiliated with USCIS or the US government in any way. Some posters may claim to work for USCIS, which may or may not be true, and we don't try to verify this one way or another. Be wary that it may be a scam if anyone is asking you for personal info, or sending you a direct message, or asking that you send them a direct message.\n- Some people here claim to be lawyers, but they are not YOUR lawyer. No advice found here should be construed as legal advice. Reddit is not a substitute for a real lawyer. If you need help finding legal services, visit [this link](https://www.uscis.gov/avoid-scams/find-legal-services) for more information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/USCIS) if you have any questions or concerns.*", "comment_date": "2024-01-25 10:08:51 UTC"}
{"comment_id": "kjhcfng", "comment_author": "AutoModerator", "comment_body": "Welcome to our community [r/paydayloan_online/](https://www.reddit.com/r/paydayloan_online/) and Thank you for your submission!  If you are looking for a payday loan, make sure you read this post [Unlock Your financial Freedom with payday loan](https://www.reddit.com/r/paydayloan_online/comments/19eecly/unlock_your_financial_freedom_with_payday_loans/) right now.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/paydayloan_online) if you have any questions or concerns.*", "comment_date": "2024-01-25 09:29:00 UTC"}
{"comment_id": "kjh7y82", "comment_author": "AutoModerator", "comment_body": "Hi all,\n\nA reminder that comments do need to be on-topic and engage with the article past the headline. Please make sure to read the article before commenting.  Very short comments will automatically be removed by automod. Please avoid making comments that do not focus on the economic content or whose primary thesis rests on personal anecdotes. \n\nAs always our comment rules can be found [here](https://reddit.com/r/Economics/comments/fx9crj/rules_roundtable_redux_rule_vi_and_offtopic/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Economics) if you have any questions or concerns.*", "comment_date": "2024-01-25 08:32:41 UTC"}
{"comment_id": "kjh8rnu", "comment_author": "AdAlarmed69", "comment_body": "***Full article***\n\nCurbs on funds that allow retail investors to bet on foreign securities come amid sell-off in Chinese equities\n\n&#x200B;\n\nChinese authorities are tightening limits on capital outflows by restricting access to funds that invest in offshore securities as the country battles a brutal market rout.About a third of Chinese funds that invest in foreign securities under a scheme that bypasses strict capital controls have announced in stock exchange notices they have suspended or capped sales to retail investors “to maintain stable operations and protect investors’ interests”.\n\n&#x200B;\n\nThe Beijing-based manager of one fund that focuses on US stocks said they had received informal instructions from the Shanghai Stock Exchange to reduce sales of such products targeting overseas markets after demand went “through the roof”.\n\nChinese authorities have repeatedly tried to halt a protracted sell-off in domestic equities over the past year, but the efforts have failed to improve battered sentiment, prompting many investors to look for higher yields elsewhere.\n\n&#x200B;\n\nThe soaring popularity among retail investors of foreign-targeted funds has raised regulator concerns about capital outflows. The Financial Times reported last August that China’s biggest fund houses were nearing government quota limits on offshore investment.The government’s Qualified Domestic Institutional Investor scheme allows banks, brokerages and asset managers to bypass China’s strict capital controls. Buying into funds offered through the QDII scheme is the only legal way for Chinese retail investors to invest in foreign stocks and bonds.\n\n&#x200B;\n\nAn increase in investor demand has caused some funds to hit their quota, while other funds have received directions from Chinese regulators to slow or in some cases stop sales of the funds.Public filings show 79 Chinese QDII funds have suspended sales to retail investors and 53 have capped them. Together, these account for about 30 per cent of all QDII funds that target non-Hong Kong overseas markets. The funds include some operated by JPMorgan Asset Management and Manulife Investment Management.\n\n&#x200B;\n\nJPMorgan did not respond to a request for comment, while Manulife declined to comment.Separately, multiple Chinese brokerages that sell funds to retail investors through the QDII scheme said on Tuesday in public filings that regulators led by the Shanghai Stock Exchange were cracking down on “abnormal trading” in exchange traded funds that invest in foreign equities.\n\n&#x200B;\n\nThe brokerages said regulators had in particular requested the suspension of transactions involving ETFs that sought to match the performance of the MSCI USA 50, Nasdaq 100 and Japan’s Nikkei 225 indices.\n\n&#x200B;\n\nThe tightly controlled QDII quotas have intensified competition for outbound investments, with such ETFs trading well above their net asset value. Beijing had a total quota of $166bn across 186 institutions for QDII investments as of the end of 2023, up only slightly since 2021.“Rocketing demand on one hand and quota restrictions on the other, the two factors both contributed to the particularly hot situation in QDII funds we are seeing right now,” said Ding Wenjie, global capital investment strategist at China Asset Management.\n\n&#x200B;\n\nDing said the appetite for funds linked to Japan’s Nikkei index had become “irrational” this month, with one trading at up to a 20 per cent premium to its asset value. Funds targeting the US and India were also popular, Ding said.\n\n&#x200B;\n\nThe China Securities Regulatory Commission and Shanghai Stock Exchange did not respond to requests for comment.Since October, market regulators have been providing private instructions — known as “window guidance” — to some investors, preventing them from being net sellers of equities on certain days.China’s benchmark CSI 300 index has fallen nearly 5 per cent since the start of 2024, continuing a rout fuelled by disappointment with government policies and lingering concerns about a slow economic rebound.", "comment_date": "2024-01-25 08:42:45 UTC"}
{"comment_id": "kjh8ase", "comment_author": "dingo_deano", "comment_body": "It is magic.  But seriously you have more or less answered your own question. ‘Without pulling WHOLE ceiling down’", "comment_date": "2024-01-25 08:36:57 UTC"}
{"comment_id": "kjh8w6t", "comment_author": "CunningStunt_1", "comment_body": "With difficulty. \n\nFor wiring between joist with no access; I cut a 100mm hole in the ceiling, drill the joist and then patch the hole with the same cut out. \n\nMillion different ways to do it. I'm sure someone here will have a potentially better method.", "comment_date": "2024-01-25 08:44:19 UTC"}
{"comment_id": "kjha5te", "comment_author": "curious_trashbat", "comment_body": "If there's a lot of joists to span I generally cut a strip of ceiling down running across joists, wide enough to get a drill into to drill joists.", "comment_date": "2024-01-25 09:00:15 UTC"}
{"comment_id": "kjhbg8h", "comment_author": "geekypenguin91", "comment_body": "Fish what you can and then make a series of \"inspection\" holes where you need to go through joists etc which are then easy to patch afterwards.\n\nIf you're lucky you can get away without having to make many more than you're already making for the spotlights.\n\nSods law however and every spotlight will be right on a joist and they will all go the wrong way for fishing, resulting in needing loads of holes.", "comment_date": "2024-01-25 09:16:37 UTC"}
{"comment_id": "kjhdxs6", "comment_author": "soundslikethunder", "comment_body": "I’ve done downlights where there’s been a void above the joists, easy peash, next to no damage to ceiling/making good. I recently did one that SO MUCH TIMBER that there were more cut outs than downlights with tons of making good (keep the cutouts, put a timber baton behind the hole, screw it in and screw the cut out to the timber, filler) \nAs long as you can prepare the customer for worst case, you won’t know til you get stuck in always, and agree on how far into making good you’ll go. \nIf you can’t navigate a joist, cut a hole either side, drill through and thread your cable through. For cut outs I use a hole saw so making good is easier as above. \nGetting all the positions even and where you want them is another adventure. It’s worth spending the time here to make sure you’ll get them all evenly spaced without hitting joists, and get customer to agree the positions before you start cutting if this isn’t the case. Retro fitting downlights is a different game to wiring for new ceilings so they have to have a bit of understanding in this instance but worth it if you can get them all even and looking the bomb", "comment_date": "2024-01-25 09:47:49 UTC"}
{"comment_id": "kjhbqy1", "comment_author": "DepartureWhole4595", "comment_body": "You not scared about potentially hitting pipework that way?", "comment_date": "2024-01-25 09:20:23 UTC"}
{"comment_id": "kjhbvpk", "comment_author": "DepartureWhole4595", "comment_body": "Does the same method work in stud walls?", "comment_date": "2024-01-25 09:22:02 UTC"}
{"comment_id": "kjhe93n", "comment_author": "DepartureWhole4595", "comment_body": "Informative thanks mate", "comment_date": "2024-01-25 09:51:44 UTC"}
{"comment_id": "kjhdf47", "comment_author": "WilsonSpark", "comment_body": "Pipe work is usually cut through the top of the joist, so you’ll miss them", "comment_date": "2024-01-25 09:41:19 UTC"}
{"comment_id": "kjhc9fl", "comment_author": "geekypenguin91", "comment_body": "Pretty much", "comment_date": "2024-01-25 09:26:50 UTC"}
{"comment_id": "kjh6pya", "comment_author": "_LLOSERR", "comment_body": "have you been thru TSA recently? the scanner sees fucking everything. everything. if the risk of years in prison seems worth putting coke in your ass go for it.", "comment_date": "2024-01-25 08:17:37 UTC"}
{"comment_id": "kjh6to2", "comment_author": "Ohigetjokes", "comment_body": "Anyone who says anything is “fool proof” is an idiot.\n\nFull-body X-rays in most US airports are going to put an end to that idea real quick. Doesn’t matter if it’s a domestic flight or not - your odds of being walked through one of those is 50/50.", "comment_date": "2024-01-25 08:18:51 UTC"}
{"comment_id": "kjh8spe", "comment_author": "bobbyvs", "comment_body": "I dunno man... the price of a ball seems like peanuts compared to getting caught smuggling it. Rip a few and toss it.", "comment_date": "2024-01-25 08:43:07 UTC"}
{"comment_id": "kjh7986", "comment_author": "Amylynn860", "comment_body": "I snuck stuff through tsa in a compact makeup case right under the poofy thing to apply the makeup...they never found it.", "comment_date": "2024-01-25 08:24:04 UTC"}
{"comment_id": "kjh7zre", "comment_author": "billionaireastronaut", "comment_body": "Has nobody here smuggled drugs before? It's just for personal use simple....Cocaine does not evaporate... Water does... So pour it in a water bottle. Then when you get to wherever just pour the water into a glass and let it evaporate and only the powder cocaine will remain. Tada. And if you're that paranoid you could do it prison house style and put the Coke in water then get a brush and paint the coke water on a piece of paper then when you get to wherever you're going just smoke or eat the paper. Here's a hint for you....The Bible. Nobody's going to question your Bible. They'll be worried about a lawsuit. Or go all out, wear a priest collar and mark the water as holy water, and carry the Bible, then you got all kinds of options.", "comment_date": "2024-01-25 08:33:14 UTC"}
{"comment_id": "kjhcgvx", "comment_author": "InvestmentNo3437", "comment_body": "It's gonna be embarrassing for you when they see it in the body scanner then start retrieving drugs from your asshole.", "comment_date": "2024-01-25 09:29:26 UTC"}
{"comment_id": "kjh6l85", "comment_author": "las8", "comment_body": "Put it in your carry on. Tsa is looking for bombs and guns not personal amount of drugs.", "comment_date": "2024-01-25 08:16:02 UTC"}
{"comment_id": "kjh7h7f", "comment_author": "Constant-Apricot-715", "comment_body": "I'd put it in Bic pens. Generic white big hollow tube. Fill a couple full so they look the same, carry them in shirt pocket...want them on you not in luggage.", "comment_date": "2024-01-25 08:26:47 UTC"}
{"comment_id": "kjhb818", "comment_author": "JazzlikePractice4470", "comment_body": "You'll be fine", "comment_date": "2024-01-25 09:13:42 UTC"}
{"comment_id": "kjhc8e6", "comment_author": "UnemployedMatt", "comment_body": "I’ve traveled more than 10 times by breaking up whatever I had into fine powder and buying a bottle of vitamins from the pharmacy and replacing the powder. \n\nDo it all the time.", "comment_date": "2024-01-25 09:26:27 UTC"}
{"comment_id": "kjh9yap", "comment_author": "Hanayama99", "comment_body": "Mail it", "comment_date": "2024-01-25 08:57:35 UTC"}
{"comment_id": "kjhd1kn", "comment_author": "izucantc", "comment_body": "The punishment if you are caught is not worth the risk. Don't try it, just buy from someone local when you get to your destination. Don't get out on the no fly list lol", "comment_date": "2024-01-25 09:36:37 UTC"}
{"comment_id": "kjhdabf", "comment_author": "throwitfarawayfromm3", "comment_body": "I'm an idiot whose never done this before. But what about a balloon In your mouth? Then take it out after. The scanners aren't xrays.", "comment_date": "2024-01-25 09:39:39 UTC"}
{"comment_id": "kjhfbmg", "comment_author": "Thrills4Shills", "comment_body": "Just mail it to yourself  , or sell it to someone before the flight and buy more when off the flight , or next day shipping for fast service. ", "comment_date": "2024-01-25 10:05:03 UTC"}
{"comment_id": "kjh8n7s", "comment_author": "Ok-Walrus-5650", "comment_body": "I have not. Good to know", "comment_date": "2024-01-25 08:41:14 UTC"}
{"comment_id": "kjhbos9", "comment_author": "justausernamehereman", "comment_body": "I’m pretty sure you have the legal right to “opt out” of having to use that full body scanner. And then at that point they do an aggressive full body pat down and walk you through a metal detector. The pat down isn’t as aggressive as you’d think though and they’re only allowed to use the backs of their hands.\n\nAt least that’s the case the last several times I’ve flown. I didn’t have anything illegal. I just fucking hate TSA and anything to exercise what little freedom I have is worth it.", "comment_date": "2024-01-25 09:19:39 UTC"}
{"comment_id": "kjhc86s", "comment_author": "Conwsk", "comment_body": "He actually said full proof so he's clearly not an idiot!", "comment_date": "2024-01-25 09:26:23 UTC"}
{"comment_id": "kjh8v12", "comment_author": "Ok-Walrus-5650", "comment_body": "Probably the smart thing to do haha just gotta get myself to do it", "comment_date": "2024-01-25 08:43:55 UTC"}
{"comment_id": "kjh9qxl", "comment_author": "iamamoa", "comment_body": "That coke in water tip is truly a useful illegalifepro tip. Probably the most useful one I've read here and I don't even do coke.", "comment_date": "2024-01-25 08:55:00 UTC"}
{"comment_id": "kjhav4c", "comment_author": "bobalover209", "comment_body": "You can't take liquids with you on a plane, and what about sniffer dogs?", "comment_date": "2024-01-25 09:09:11 UTC"}
{"comment_id": "kjhalz0", "comment_author": "DTXbullrealtor_", "comment_body": "Wtffff this is $", "comment_date": "2024-01-25 09:06:00 UTC"}
{"comment_id": "kjhc4xt", "comment_author": "justausernamehereman", "comment_body": "There’s a story of a famous smuggler who did something just like this for their first few runs.\n\nThey’d dissolve the coke into a bottle of water and then they soaked some poncho / sweater that they were wearing in the water, let it evaporate, and then when they got back over, they just got the poncho / sweater wet again, and let it dry out.\n\nHe said this is how he first moved several “matchboxes” worth of it at first before graduating to some more aggressive and creative methods.", "comment_date": "2024-01-25 09:25:15 UTC"}
{"comment_id": "kjhd3n2", "comment_author": "Ok-Walrus-5650", "comment_body": "Exactly the answer I needed😂😂 I’m being fr too lol", "comment_date": "2024-01-25 09:37:20 UTC"}
{"comment_id": "kjh935t", "comment_author": "chuckyb3", "comment_body": "Depends on the airport, I went thru Dallas recently and they had dogs sniffing all the luggage+passengers (might be bomb sniffing dogs not sure)", "comment_date": "2024-01-25 08:46:45 UTC"}
{"comment_id": "kjhcouu", "comment_author": "Ok-Walrus-5650", "comment_body": "If the capsules get warm in your bag the ❄️ doesn’t clump up? Worried that a x ray would see that it’s not powder. That’s probably dumbass question lol", "comment_date": "2024-01-25 09:32:13 UTC"}
{"comment_id": "kjhaz65", "comment_author": "Ok-Walrus-5650", "comment_body": "There’s no precautions to catch drugs being mailed? I’m genuinely curious because I have no clue. I might do that instead, just mail it out the day of my flight", "comment_date": "2024-01-25 09:10:34 UTC"}
{"comment_id": "kjhd6z0", "comment_author": "Ok-Walrus-5650", "comment_body": "I don’t trust anyone where I’m going to not give me some laced shit. I know everything’s “laced” but laced as in shit that will kill me", "comment_date": "2024-01-25 09:38:30 UTC"}
{"comment_id": "kjh9rox", "comment_author": "cupkake88", "comment_body": "Get a small eye shadow pallet . Pop the white out and clean it from the foil tray . Press the other white stuff in to the tray. Put other make up items with it keep in your hold luggage", "comment_date": "2024-01-25 08:55:16 UTC"}
{"comment_id": "kjheyar", "comment_author": "Webster_882", "comment_body": "Go get some nasal spray(you want one that actually sprays), empty it and pour some saline or similar in it and then mix your blow in. This will work, and it will be easier to use.", "comment_date": "2024-01-25 10:00:25 UTC"}
{"comment_id": "kjhcw09", "comment_author": "ertzrentacar", "comment_body": "I agree! I hate airport security, it’s an infringement of my freedom! \n\nI always make sure to waste everybody’s time around me just because I hate airport security so much!!!\n\nGet a grip retard", "comment_date": "2024-01-25 09:34:45 UTC"}
{"comment_id": "kjhf75c", "comment_author": "Webster_882", "comment_body": "My roommate has this metal card (think CC size) and on it is the bill of rights. The rights that are violated are highlighted in red, so when they search him for it he can show them which of his rights they are violating haha", "comment_date": "2024-01-25 10:03:30 UTC"}
{"comment_id": "kjhcjsw", "comment_author": "Ok-Walrus-5650", "comment_body": "No he’s right I’m a dumbass hence why I’m asking for the best way to get ❄️ on a plane😂", "comment_date": "2024-01-25 09:30:27 UTC"}
{"comment_id": "kjhd8ap", "comment_author": "ImJettski", "comment_body": "Dissolve it into water bro, let the water evaporate and then scrape up your ❄️", "comment_date": "2024-01-25 09:38:58 UTC"}
{"comment_id": "kjhbati", "comment_author": "JazzlikePractice4470", "comment_body": "Yes you can", "comment_date": "2024-01-25 09:14:41 UTC"}
{"comment_id": "kjhehhb", "comment_author": "InvestmentNo3437", "comment_body": "Me too. I used to walk thru with thousands of oxys and thousands of dollars in my pockets in 09-10. Try that today. You get scanned. And you actually do have the right to refuse a scan. However, they will then place a dog by your groin and asshole. And it will start barking.", "comment_date": "2024-01-25 09:54:37 UTC"}
{"comment_id": "kjhb47l", "comment_author": "las8", "comment_body": "Re read what I said and then you'll know what kind of dogs they were.", "comment_date": "2024-01-25 09:12:20 UTC"}
{"comment_id": "kjhe4x8", "comment_author": "Odd-Way-1168", "comment_body": "Dogs recently have been dynamically trained to smell not only bombs, but drugs and guns as well.", "comment_date": "2024-01-25 09:50:18 UTC"}
{"comment_id": "kjhczjn", "comment_author": "UnemployedMatt", "comment_body": "Make it powder. \n\nBreak down the blow. \n\nPut a dollar bill over top of all the small pieces and used a lighter to go back and forth like a rolling pin to turn the blow into a super fine powder. \n\nThey won’t clump up. \n\nAlso, if you think every TSA worker is zooming into the pills of every passenger you’re crazy. lol", "comment_date": "2024-01-25 09:35:56 UTC"}
{"comment_id": "kjhbh33", "comment_author": "Hanayama99", "comment_body": "Ship USPS. They need a warrant to search", "comment_date": "2024-01-25 09:16:55 UTC"}
{"comment_id": "kjhebgp", "comment_author": "Ok_Consideration584", "comment_body": "In Australia we have x-ray machines that process international and interstate mail", "comment_date": "2024-01-25 09:52:33 UTC"}
{"comment_id": "kjhflkd", "comment_author": "Thrills4Shills", "comment_body": "Not laced stuff can kill you too , if you ain't heard", "comment_date": "2024-01-25 10:08:23 UTC"}
{"comment_id": "kjhf310", "comment_author": "Ok-Walrus-5650", "comment_body": "Does it give you that same high and drip?", "comment_date": "2024-01-25 10:02:04 UTC"}
{"comment_id": "kjhe1in", "comment_author": "Ok-Walrus-5650", "comment_body": "You won’t loose any ❄️ in the process? Will it affect how the blow hits after being dissolved and dried up?", "comment_date": "2024-01-25 09:49:08 UTC"}
{"comment_id": "kjhbuak", "comment_author": "bobalover209", "comment_body": "Not an entire water bottle, only a certain number of travel sized containers.", "comment_date": "2024-01-25 09:21:33 UTC"}
{"comment_id": "kjheiem", "comment_author": "Ok-Walrus-5650", "comment_body": "Thanks man. Never brought shit on a plane I keep schetchin myself out 😂", "comment_date": "2024-01-25 09:54:57 UTC"}
{"comment_id": "kjhff3f", "comment_author": "Webster_882", "comment_body": "Yes to both, also I would put the coke in before saline in case you want to dilute it more or not.\nThis is how I exclusively do coke nowadays, it’s more controlled and feels SO good on the nose. You NEVER wake up to clogged sinuses either.\n\nEdit: it also absorbs faster", "comment_date": "2024-01-25 10:06:11 UTC"}
{"comment_id": "kjhej9q", "comment_author": "ImJettski", "comment_body": "If you lose any it would be a negligible amount. The quality should stay the same once you evaporate the water and scrape it back up. You could also just drink the water if you didn’t want to go through the process of evaporating and scraping.", "comment_date": "2024-01-25 09:55:14 UTC"}
{"comment_id": "kjhbz3b", "comment_author": "JazzlikePractice4470", "comment_body": "That's all he would really need. Honestly I'd just put it in my carry on... I've traveled with dope on an airplane around 3-5 times. Last time was back in like 2010 though.", "comment_date": "2024-01-25 09:23:10 UTC"}
{"comment_id": "kjhcjko", "comment_author": "bobalover209", "comment_body": "Again, what about the sniffer dogs? I've never done it nor ever used, just see this as a hole in his plan", "comment_date": "2024-01-25 09:30:22 UTC"}
{"comment_id": "kjhcx9n", "comment_author": "JazzlikePractice4470", "comment_body": "AFAIK the dogs are there for bombs.", "comment_date": "2024-01-25 09:35:10 UTC"}
{"comment_id": "kjhd01h", "comment_author": "bobalover209", "comment_body": "Ah that would make sense", "comment_date": "2024-01-25 09:36:06 UTC"}
{"comment_id": "kjgvaho", "comment_author": "zffch", "comment_body": "Exactly. The law excludes the cost of employer provided insurance for yourself, your spouse, and your children from being treated as income. But it doesn't say anything about domestic partners, so the value of it is considered part of your wages and taxed accordingly. ", "comment_date": "2024-01-25 06:13:24 UTC"}
{"comment_id": "kjgyq58", "comment_author": "FairBarber4", "comment_body": "Thank you", "comment_date": "2024-01-25 06:48:06 UTC"}
{"comment_id": "kjgzagq", "comment_author": "hoyeay", "comment_body": "Just change it to spouse 😂", "comment_date": "2024-01-25 06:53:57 UTC"}
{"comment_id": "kjh4831", "comment_author": "FairBarber4", "comment_body": "😬", "comment_date": "2024-01-25 07:48:30 UTC"}
{"comment_id": "kjguldi", "comment_author": "JustBoatTrash", "comment_body": "https://www.investopedia.com/articles/investing/042315/fundamentals-how-canada-makes-its-money.asp\n\nCanada's economy is highly developed and one of the largest in the world. In 2022, the country's annual gross domestic product (GDP) was $2.14 trillion in current USD, according to the latest available World Bank data. That made Canada the world's ninth-largest economy", "comment_date": "2024-01-25 06:06:36 UTC"}
{"comment_id": "kjgrjfa", "comment_author": "UnnervingS", "comment_body": "Many jobs will only hire citizens or PRs. The advantage is insane.", "comment_date": "2024-01-25 05:38:22 UTC"}
{"comment_id": "kjgqsaz", "comment_author": "OzAnonn", "comment_body": "As long as someone doesn't struggle to communicate, being a native speaker isn't considered much of an advantage. Of course there's some variation across companies. Years ago I worked in a company where virtually every developer was Caucasian. It's hard to imagine this was a coincidence as it's actually hard to find Caucasians to hire if you tried. \n\nThere's an advantage from a visa point of view though. Especially in this market, a lot of companies might prefer citizens and PRs.", "comment_date": "2024-01-25 05:31:48 UTC"}
{"comment_id": "kjh38ld", "comment_author": "ArtilleryProducer31", "comment_body": "Like the other comments, advantage is insane. I am an international student in Australia, with previous work experience. I just got rejected from a part-time software developer role, because of my visa.", "comment_date": "2024-01-25 07:37:15 UTC"}
{"comment_id": "kjhe3tm", "comment_author": "Darlew", "comment_body": "I feel like it mostly depends on the hiring manager/recruiter/interviewer. An international hiring manager will naturally relate more to an international candidate and the inverse is true for natives. As much as people will try to tell you that proficiency and expertise is the most important factor, personality and connection with the interviewer is way up there too.", "comment_date": "2024-01-25 09:49:54 UTC"}
{"comment_id": "kjh8ddn", "comment_author": "hypermeowmeow", "comment_body": "Damn pal, I don't know if you are kidding or not. As an international student here, I must say it's almost like an impossible game. \n\nIf you try going on Prosple AU and filter visa rights, I think the job listings would just halve :(", "comment_date": "2024-01-25 08:37:50 UTC"}
{"comment_id": "kjgw52r", "comment_author": "theleveragedsellout", "comment_body": "Yeah was going to say, there’s basically no pathway for firms to hire international graduates with the exception of a few very limited circumstances.", "comment_date": "2024-01-25 06:21:43 UTC"}
{"comment_id": "kjh657u", "comment_author": "andrew1677", "comment_body": "I got few hundred rejection before landing a retail job.  Not saying a cs job.", "comment_date": "2024-01-25 08:10:44 UTC"}
{"comment_id": "kjgwoa8", "comment_author": "bilby2020", "comment_body": "Not exactly true. There are exemptions like for Indian students.\n\nhttps://www.afr.com/politics/federal/indian-students-given-exemption-to-work-in-australia-20231214-p5erej", "comment_date": "2024-01-25 06:27:04 UTC"}
{"comment_id": "kjgt9zv", "comment_author": "dr-swordfish", "comment_body": "1. tsa screening is the same for domestic and international. \n2. upon returning to the US you'll go through customs screening. \n3. You are giving consent to a pat down if you enter a checkpoint. The pat downs you may receive are not as invasive as many people make it seem. Any sensitive areas are done with the back of the hands (less nerve endings) by same gender only. Usually are targeted to a small portion of the body. And only take a few seconds to complete. \n4. Keep in mind we're not doing it to find drugs, we're doing it so the plane you get on actually makes it to the destination.", "comment_date": "2024-01-25 05:54:06 UTC"}
{"comment_id": "kjgwsx2", "comment_author": "RSTA30", "comment_body": "Crate training is bullshit. It's no better than how scumbags will put a dog on a short chain and leave it alone in their yard, so I am completely on your boyfriends side on that one. \n\nThe dog is acting up because it is starved for attention from being left alone so often. The last thing that will help is isolating it even more by locking it in a box. They are pack animals and don't do well alone. That's the entire reason we were able to domesticate them.\n\n\nFind a trainer who isn't a proponent of abusing animals. And stop pushing for him to abuse his dog just because some idiot told you to. I will bet your fights over this will magically come to an end.", "comment_date": "2024-01-25 06:28:23 UTC"}
{"comment_id": "kjgl0ky", "comment_author": "AutoModerator", "comment_body": "Thank you for sharing your kitty with us! If you haven't already done so, please take a minute to watch the video and explore the links below. If other Redditors identify your cat as a dilute tortie, standard issue cat, calico, tuxedo, or something else, your post may be removed in order to help keep this sub focused on Nebbies. Please note that Nebelungs must be solid gray. (An allowance is made for a small white patch/locket on the chest.)\n\nAnimal Planet: Cats 101 - Nebelung: \n\nhttps://www.youtube.com/watch?v=2aDwFMEJ0W8\n\nInformation from The International Cat Association (TICA), the world's largest genetic registry of pedigreed and domestic cats.\n\n[About the Nebelung Breed](https://www.tica.org/breeds/browse-all-breeds?view=article&id=1663:the-nebelung-breed&catid=48)\n\n[Nebelung Breed Standards](https://www.tica.org/phocadownload/nb.pdf)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nebelung) if you have any questions or concerns.*", "comment_date": "2024-01-25 04:43:52 UTC"}
{"comment_id": "kjgo55w", "comment_author": "Keeyawn", "comment_body": "Oh wow I just read that the first ones' mom was a black domestic!", "comment_date": "2024-01-25 05:09:14 UTC"}
{"comment_id": "kjgmw6o", "comment_author": "Wolfe_Hunter_VII", "comment_body": "Which state?", "comment_date": "2024-01-25 04:58:55 UTC"}
{"comment_id": "kjgngf2", "comment_author": "New-Connection7198", "comment_body": "Got two vials of test e took about 4 days im from the gold coast\n\nand it was the real deal", "comment_date": "2024-01-25 05:03:33 UTC"}
{"comment_id": "kjgov34", "comment_author": "Zerkxerd", "comment_body": "these guys are good I fucking couldn’t find anyone didn’t take to long", "comment_date": "2024-01-25 05:15:19 UTC"}
{"comment_id": "kjgn1ui", "comment_author": "DomesticGearAUS", "comment_body": "Warehouse In Perth, where you from I can estimate shipping.", "comment_date": "2024-01-25 05:00:13 UTC"}
{"comment_id": "kjgqwy4", "comment_author": "Wolfe_Hunter_VII", "comment_body": "Melbourne, but it’s always a risk crossing state lines - had my shit confiscated before", "comment_date": "2024-01-25 05:32:57 UTC"}
{"comment_id": "kjgw3xt", "comment_author": "DomesticGearAUS", "comment_body": "Probably shitty packaging. Just msg me,", "comment_date": "2024-01-25 06:21:24 UTC"}
{"comment_id": "kjgldyw", "comment_author": "jettTopg", "comment_body": "Yeah good supplier took about 6 days didn’t even get express pretty pricey but you get what you pay for tbh", "comment_date": "2024-01-25 04:46:50 UTC"}
{"comment_id": "kjgy0ij", "comment_author": "selectedsteroidvip1", "comment_body": "The raw materials are produced in China, and most of the world's steroids are exported from China.", "comment_date": "2024-01-25 06:40:40 UTC"}
{"comment_id": "kjh7cqa", "comment_author": "DomesticGearAUS", "comment_body": "Yeah your right but all our stock is at our warehouse in Australia.", "comment_date": "2024-01-25 08:25:16 UTC"}
{"comment_id": "kjgliek", "comment_author": "None", "comment_body": "Domestic is listed first as the quoted currency; foreign is listed second as the base.", "comment_date": "2024-01-25 04:47:49 UTC"}
{"comment_id": "kjgr4ch", "comment_author": "Difficult-Chard-7452", "comment_body": "But conventionally wouldn't domestic currency be your base currency? Thats what level 1 materials said anyway. Is it because we are finding real rates?", "comment_date": "2024-01-25 05:34:46 UTC"}
{"comment_id": "kjgog8q", "comment_author": "visitor987", "comment_body": "You just move out of state you mother cannot stop you.\n\nHere are some job ideas the last one sometimes has housing. This pays well the US Post Office is hiring note it sometimes takes feds three months to hire someone. https://about.usps.com/careers/welcome.htm Take the test and apply for jobs anywhere in USA.\r  \n\r  \nAmtrak is hiring https://careers.amtrak.com/  Jobs exist in most states.\r  \n\r  \nUS Forest service is hiring https://www.fs.usda.gov/working-with-us/jobs \r  \n\r  \nThese also pay well you may not qualify for all of them https://www.fool.com/slideshow/not-many-people-want-these-jobs-and-s-why-they-pay-well/\r  \n50 jobs over $50,000 without college https://www.mrmoneymustache.com/2013/07/25/50-jobs-over-50000-without-a-degree-part-1/ \r  \n\r  \nFederal civil service jobs https://www.usajobs.gov/Search?p=1 \r  \n\r  \nLook into Concessioners for the National Park service. The jobs include fields of Lodging; Campgrounds; Food Service Operations; Guide Services and Outfitters. The jobs SOMETIMES include HOUSING in more remote areas like Montana, New Mexico, Wyoming, Grand Canyon, etc. Some jobs are summer or winter only, others are all year long in one location or you may be able transfer between locations to work year-round. Use this link & enter the name of the park you wish to be employed at https://www.nps.gov/subjects/concessions/authorized-concessioners.htm Contact each concessioner directly by Googling the company name to apply. This link will let you look up parks by state https://www.nps.gov/index.htm not every park has a concessioner.", "comment_date": "2024-01-25 05:11:50 UTC"}
{"comment_id": "kjgjeby", "comment_author": "AutoModerator", "comment_body": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "comment_date": "2024-01-25 04:31:22 UTC"}
{"comment_id": "kjgx729", "comment_author": "InternationalClick78", "comment_body": "Probably not. Domestication requires specific traits that not all animals have. Zebras are a great example of this due to their social structures", "comment_date": "2024-01-25 06:32:22 UTC"}
{"comment_id": "kjgi4zu", "comment_author": "lewisiarediviva", "comment_body": "Probably, maybe. If you selectively breed long enough you’ll get differences. Whether they’re adequate to be considered ‘domesticated’ will be up for debate. Depends on the fundamental limits of social behavior for the species.", "comment_date": "2024-01-25 04:21:52 UTC"}
{"comment_id": "kjgkl7w", "comment_author": "hilmiira", "comment_body": "I mean yeah, domestication is just animals adapting to humans and house life.\n\nAll creatures can be domesticated, some better some worse.", "comment_date": "2024-01-25 04:40:33 UTC"}
{"comment_id": "kjgmv2y", "comment_author": "quiveringcoconut", "comment_body": "Another off the wall thought -- would you be able to somehow determine if a wild animal was at some point domesticated and, for whatever reason, went back to being wild? How could we tell", "comment_date": "2024-01-25 04:58:40 UTC"}
{"comment_id": "kjgxos9", "comment_author": "RainCoatDuckling", "comment_body": "While we have more options thanks to current technology than when we first domesticated animals, some animals would be easier to domestic than others. And it still will take lots of time, money, and resources to change animals enough to be considered domesticated.\n\nCpg grey on yt has a good video on it.\n\nhttps://youtu.be/wOmjnioNulo?si=SKRn0KFwmsjElt4i", "comment_date": "2024-01-25 06:37:21 UTC"}
{"comment_id": "kjgirnn", "comment_author": "quiveringcoconut", "comment_body": "Why hasn't anyone tried to fund research like this? It'd give a better understanding as to the origins and tactics used in humanities first endeavors into the realm of wildlife domestication.", "comment_date": "2024-01-25 04:26:34 UTC"}
{"comment_id": "kjh2qbu", "comment_author": "RainCoatDuckling", "comment_body": "So, I'm not sure what your level of knowledge is. Please forgive me if I explain something you already know.\n\nTo answer your question, we can tell if an animal is domesticated, feral, wild, or tamed.\n\nBeing domesticated means that an animal's ancestors have gone through genetic change to become a different animal, thanks to the efforts of humans. This takes literally hundreds of generations.\n\n A wild animal cannot be domesticated. It can be tamed and can trust, or at least not fear humans. Elephants and deer are tamed often. But they have not been genetically altered through breeding to be useful to us.\n\nA domesticated animal can become feral, like wild mustangs or street dogs. They might fear or mistrust humans, but their ancestors were still genetically altered by human controlled breeding.\n\nThink about it this way. If you're a caveman, and your caveman family finds two wolf pups. You keep them because theyre cute and you would naturally give treats and attention to the wolf pup that was friendlier to you. This creates artificial pressure on the wolf pups genes. Wolves that have calmer personalities are more likely to be rewarded by their adopted human family. They get more food, making them healthier, making them more likely to successfully have more wolf pups. With these new wolf pups, the cycle starts again. Maybe one pup is protective of your family. Maybe he fights a bear off or is the best hunter. You'll definitely want to give him lots of treats for being a good boy. So now this wolf, with his calmer and more loyal genes, benefits from being calmer and loyal thanks to human intervention. And the cycle continues until you have friendly and loyal dogs. The dogs are well fed and can eat cooked scraps, which are easier to digest.\n\nSince we're changing the way evolution pressures domesticated animals, they are able to survive without following the 'dress code'. An albino deer is very rare in the wild because its white coat is bad for camouflage. It will also have bad eyesight and probably will not act as wary around predators as other deer, since it can't see them. But we can find lots of albino animals in captivity, even ones that aren't domesticated, but tamed. Because in captivity, predators will not eat it and mother animals will not abandon odd looking offspring. ( They need to save energy to grow offspring that will actually survive). So we are removing the penalties for not following 'the rules' . \n\nThink about how a dog is different from a wolf. They might have floppy ears, long coats, short or tall, squashed face or long snouts. These traits do not help the dog survive in the wild, but since humans control their 'ecosystem' now. They don't have to follow the 'dresscode'. A dashund can have stubby legs that are useless for hunting elk. It doesn't matter. humans will use them to down rabbit dens, guaranteeing the dog a meal. A wolf who can only hunt rabbit will starve if there is a die off of the rabbits population. A mastiff doesn't have to worry about finding enough food for it's huge body when there's a famine. A husky doesn't have to worry about overheating when it's coat is too fluffy. Chihuahuas don't have to worry about getting eaten by a hawk.\n\nSince domesticated animals usually don't follow the 'dresscode', we can tell if an animal is feral/wild/tamed depending on it's looks and behaviors. Even wolf/dog hybrids have signs, and they're very close genetically. You can look at the slope of their foreheads and if they have dewclaws, etc.\n\nHumans using our giant brains are basically able to cheat the system. We can build ropes and fences to control animal movements. We know what the animal eats and what's bad for it, ensuring our animals are healthy and have healthier babies. We live a long time, so we can, over time, choose which animals we like best and select for that trait. The things we don't like, we can cull out. Either through eating or removing it from our selected gene pool.\n\nSorry for ramble. Hope you find this interesting. Try looking up a vid on the russian silver fox breeding experiment. They were trying to select for calmer foxes to see what would happen. They also did the opposite and bred a bunch of mean ones by selecting the jerk foxes lol.", "comment_date": "2024-01-25 07:31:33 UTC"}
{"comment_id": "kjgixmk", "comment_author": "lewisiarediviva", "comment_body": "They have, and are. Quite famous ongoing experiment in Russia that resulted in the ‘domesticated silver fox’.", "comment_date": "2024-01-25 04:27:49 UTC"}
{"comment_id": "kjh303k", "comment_author": "Aside_Electrical", "comment_body": "You may not be legally permitted to use a domestic machine because it may not have the required certifications.", "comment_date": "2024-01-25 07:34:39 UTC"}
{"comment_id": "kjgbomj", "comment_author": "ananthropolothology", "comment_body": "For a while it was really the cheapest domestic, and you could get it in tallboys at the bar. Chicago has Hamm's and Old Style, Seattle has Olympia and Ranier, Baltimore has Natty Boh, etc (though some of those are brewed locally). Every city has their go-to cheap beer, PBR just somehow became the option for here.", "comment_date": "2024-01-25 03:36:22 UTC"}
{"comment_id": "kjg9mls", "comment_author": "AutoModerator", "comment_body": "In an attempt to reduce remind me spam, all top comments that include a remind me will be removed. If you would like to have a remind me, please reply to this comment. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/humansarespaceorcs) if you have any questions or concerns.*", "comment_date": "2024-01-25 03:22:34 UTC"}
{"comment_id": "kjgfeg2", "comment_author": "OSadorn", "comment_body": "\"This is their domestication instinct?\" I asked with an alert tone, pinned down by a being that I thought wouldn't be a household pet or similar.\n\nThe lithe, mouthless enigma of a sapient who watched the situation elaborated again as if I didn't hear.\n\nI then spoke at them with panic! \"If this isn't a 'mating display' then WHAT IS?!\"\n\nThe creature who had effectively dropped its weight at me was now trying to rub themselves onto me like a non-cringe-inducing scent application method.\n\nFor 'urban wildlife' these beings are a near-identical to some of the creative half-monsters we've imagined.\n\nAnd this guy thinks I'd make a good handler?\n\nI feel like the reverse is more likely. I decide to tease the creature's uncannily humane face with a slight kiss.\n\nThat drew them to pulling me up into a hug and leaning back, almost plexing me into an upright posture while I returned the favour.\n\nWe then danced in circles around eachother for a bit, never letting go.\n\nThe mouthless observer of a 'friend' nodded as the dancing slowed to a stop and we butted heads. He told me this - \"You are bonded... It's the first time I've seen her kind do this ritual with a human.\"\n\nHold on. Repeat that again. What?\n\nI think that but it seems I've spilled something. The observer curtly nods and then just leaves me and this... domesticated companion.\n\nIn my room.\n\nBy all that is holy-\n\n...More cuddling. My eyes are lidded, tired. She's ruffling my hair now and is actually whispering legible words, but I am-\n\nI flop onto the bed. She follows.\n\n\\- - - The next few days were a blur, redacted for dignity.\n\nThe 'friend' of mine has returned with a myriad of other beings. Apparently from the local animal shelter.\n\nHe claims my kind are a nebulous legal grey-zone where we cannot be classed as 'companions' or 'pets' because we can space and things but this one...\n\nHer kind have bamboozled the Orion-colonial Protoss. Why haven't they noticed?", "comment_date": "2024-01-25 04:01:58 UTC"}
{"comment_id": "kjgd50g", "comment_author": "A_normal_storyteller", "comment_body": "\"How come?\"\n\nNate looked back, while holding the red shirt in front of the slime-covered tadpole-like creature, while at the same time holding the small insectoid on his other hand, he seemed confused and rightfully so, since the amphibian kept making loud noises, oddly similar to a mix of both, chirping and crying.\n\n\"Yes, that thing is a female amphibiaganax, a young one on top of that, those creatures were the bane of our species long ago, they used to prey on our cattle after all, also, the slime is a Gluesterax, a symbiotic colonial organism, it acts a bit like that one character of retro terran movies\"\n\n\"What?, I may be a human but i'm not a movie nerd like you Lisa, I really don't know what are you talking about\"\n\n\"The thing, that creature from that horror movie Dad used to watch every october\"\n\n\"Lisa... bring me my flamm...\"\n\n\"NO, come on big brother, don't go full murderape on these two, I told you they are being tamed as we speak, didn't I?\"\n\n\"You told me I triggered their domestication instinct, and from what I remember that thing doesn't even exists!\"\n\n\"We are pretty much creating it, specially if you keep waving that blue shirt in front of them!\"\n\n\"Lisa, this shirt is red, also, how come this thing is causing them to... emmm, chirping-crying?, Cryping?, Chirying?\"\n\n\"For the last time brother, you were bitten by a colour scorpion, your eyes are tricking you into believe that some stuff has different colours, that is how the scorpion leads its prey back to its nest!\"\n\n\"Yeah, but I pummeled the motherfucker to the ground with my AK-47, so shut up and give me my flamm...!\"\n\n\"LISTEN UP YOU MURDER APE, THESE THINGS ACT LIKE DOGGOS ONCE THEY ARE DOMESTICATED!\"\n\nIn an split of a second, the small insectoid was sent flying as Nate fell to his knees focusing  on the gigantic tadpole, then, after a few seconds, the creature let out the single most horrible purr one could ever expect...\n\n\"Ohhhh, you are right Lisa, this big baby sounds just like Matilda!, I'm sure they will get along extremely well!\"\n\n\"Puaj, you had to throw me right into the feces?\" The insect flew up from a pile of mud and purple sphere shaped rocks \"And... you are right... the call of that thing really mirrors Matilda's...\"\n\n\"Oh, you are so smooth!, Who's a good girl?, Who's a good girl?\"\n\nNate pulled up the tadpole before sitting on the floor letting the creature rest on his lap, the horrible purring kept going, as if some sort of stray monster had found its way inside a cave, and yet, Nate couldn't be happier hearing it.\n\nThe slime began to coat Nate's arms, as it slowly but surely divided into two halves, one remaining with the tadpole, while the other began to solidify into a crystaline structure, resembling crystal claws, forming a protective coat all over the lenght of his arms.\n\n\"Uh,, neat, you just bonded with the slime, so, big brother, want me to call Matilda to get us to the ship?\"\n\n\"Yeah, I'm sure she will love these two fellas... hey, no biting!\" Nate groaned as he felt the tadpole bite his knee, surprisingly, the creature had three rows of teeth, each one looking more and more like broken glass rather than healthy teeth. \"Alright, Matilda should be here any second bro, also don't forget to take our new pet to the vet\"\n\n\"Thanks sis, What do you think that Mom made for dinner?\"\n\n\"Most likely she just boiled something barely organic, again, as she always do\"\n\nBoth giggled as a giant reptile, with four limbs, a pair of tails and four sets of wings began descending as fast as sound towards them, on its neck an small collar with the name \"Matilda, the big red dragoness\"...\n\n\n\n\n\n\n\n  \n(Disclaimer: written in less than five minutes, and felt way too lazy to edit it properly)", "comment_date": "2024-01-25 03:46:12 UTC"}
{"comment_id": "kjhfmvg", "comment_author": "AutoModerator", "comment_body": "Hi there! This is an automated message to inform you and/or remind you of several things: \n\n- We have [a wiki](https://www.reddit.com/r/USCIS/wiki/index). It doesn't cover everything but may answer some questions. Pay special attention to the \"[REALLY common questions](https://www.reddit.com/r/USCIS/wiki/index/vfaq)\" at the top of the FAQ section. Please read it, and if it contains the answer to your question, please delete your post. If your post has to do with something covered in the FAQ, we may remove it.\n- If your post is about biometrics, green cards, naturalization or timelines in general, and whether you're asking or sharing, please include your field office/location in your post. If you already did that, great, thank you! If you haven't done that, your post may be removed without notice.\n- This subreddit is not affiliated with USCIS or the US government in any way. Some posters may claim to work for USCIS, which may or may not be true, and we don't try to verify this one way or another. Be wary that it may be a scam if anyone is asking you for personal info, or sending you a direct message, or asking that you send them a direct message.\n- Some people here claim to be lawyers, but they are not YOUR lawyer. No advice found here should be construed as legal advice. Reddit is not a substitute for a real lawyer. If you need help finding legal services, visit [this link](https://www.uscis.gov/avoid-scams/find-legal-services) for more information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/USCIS) if you have any questions or concerns.*", "comment_date": "2024-01-25 10:08:51 UTC"}
{"comment_id": "kjhg3rz", "comment_author": "Felicia_Svilling", "comment_body": "Yes.", "comment_date": "2024-01-25 10:14:38 UTC"}
{"comment_id": "kjhg9cu", "comment_author": "pessimisticfan38", "comment_body": "Used to?", "comment_date": "2024-01-25 10:16:31 UTC"}
{"comment_id": "kjhcfng", "comment_author": "AutoModerator", "comment_body": "Welcome to our community [r/paydayloan_online/](https://www.reddit.com/r/paydayloan_online/) and Thank you for your submission!  If you are looking for a payday loan, make sure you read this post [Unlock Your financial Freedom with payday loan](https://www.reddit.com/r/paydayloan_online/comments/19eecly/unlock_your_financial_freedom_with_payday_loans/) right now.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/paydayloan_online) if you have any questions or concerns.*", "comment_date": "2024-01-25 09:29:00 UTC"}
{"comment_id": "kjh7y82", "comment_author": "AutoModerator", "comment_body": "Hi all,\n\nA reminder that comments do need to be on-topic and engage with the article past the headline. Please make sure to read the article before commenting.  Very short comments will automatically be removed by automod. Please avoid making comments that do not focus on the economic content or whose primary thesis rests on personal anecdotes. \n\nAs always our comment rules can be found [here](https://reddit.com/r/Economics/comments/fx9crj/rules_roundtable_redux_rule_vi_and_offtopic/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Economics) if you have any questions or concerns.*", "comment_date": "2024-01-25 08:32:41 UTC"}
{"comment_id": "kjh8rnu", "comment_author": "AdAlarmed69", "comment_body": "***Full article***\n\nCurbs on funds that allow retail investors to bet on foreign securities come amid sell-off in Chinese equities\n\n&#x200B;\n\nChinese authorities are tightening limits on capital outflows by restricting access to funds that invest in offshore securities as the country battles a brutal market rout.About a third of Chinese funds that invest in foreign securities under a scheme that bypasses strict capital controls have announced in stock exchange notices they have suspended or capped sales to retail investors “to maintain stable operations and protect investors’ interests”.\n\n&#x200B;\n\nThe Beijing-based manager of one fund that focuses on US stocks said they had received informal instructions from the Shanghai Stock Exchange to reduce sales of such products targeting overseas markets after demand went “through the roof”.\n\nChinese authorities have repeatedly tried to halt a protracted sell-off in domestic equities over the past year, but the efforts have failed to improve battered sentiment, prompting many investors to look for higher yields elsewhere.\n\n&#x200B;\n\nThe soaring popularity among retail investors of foreign-targeted funds has raised regulator concerns about capital outflows. The Financial Times reported last August that China’s biggest fund houses were nearing government quota limits on offshore investment.The government’s Qualified Domestic Institutional Investor scheme allows banks, brokerages and asset managers to bypass China’s strict capital controls. Buying into funds offered through the QDII scheme is the only legal way for Chinese retail investors to invest in foreign stocks and bonds.\n\n&#x200B;\n\nAn increase in investor demand has caused some funds to hit their quota, while other funds have received directions from Chinese regulators to slow or in some cases stop sales of the funds.Public filings show 79 Chinese QDII funds have suspended sales to retail investors and 53 have capped them. Together, these account for about 30 per cent of all QDII funds that target non-Hong Kong overseas markets. The funds include some operated by JPMorgan Asset Management and Manulife Investment Management.\n\n&#x200B;\n\nJPMorgan did not respond to a request for comment, while Manulife declined to comment.Separately, multiple Chinese brokerages that sell funds to retail investors through the QDII scheme said on Tuesday in public filings that regulators led by the Shanghai Stock Exchange were cracking down on “abnormal trading” in exchange traded funds that invest in foreign equities.\n\n&#x200B;\n\nThe brokerages said regulators had in particular requested the suspension of transactions involving ETFs that sought to match the performance of the MSCI USA 50, Nasdaq 100 and Japan’s Nikkei 225 indices.\n\n&#x200B;\n\nThe tightly controlled QDII quotas have intensified competition for outbound investments, with such ETFs trading well above their net asset value. Beijing had a total quota of $166bn across 186 institutions for QDII investments as of the end of 2023, up only slightly since 2021.“Rocketing demand on one hand and quota restrictions on the other, the two factors both contributed to the particularly hot situation in QDII funds we are seeing right now,” said Ding Wenjie, global capital investment strategist at China Asset Management.\n\n&#x200B;\n\nDing said the appetite for funds linked to Japan’s Nikkei index had become “irrational” this month, with one trading at up to a 20 per cent premium to its asset value. Funds targeting the US and India were also popular, Ding said.\n\n&#x200B;\n\nThe China Securities Regulatory Commission and Shanghai Stock Exchange did not respond to requests for comment.Since October, market regulators have been providing private instructions — known as “window guidance” — to some investors, preventing them from being net sellers of equities on certain days.China’s benchmark CSI 300 index has fallen nearly 5 per cent since the start of 2024, continuing a rout fuelled by disappointment with government policies and lingering concerns about a slow economic rebound.", "comment_date": "2024-01-25 08:42:45 UTC"}
{"comment_id": "kjh8ase", "comment_author": "dingo_deano", "comment_body": "It is magic.  But seriously you have more or less answered your own question. ‘Without pulling WHOLE ceiling down’", "comment_date": "2024-01-25 08:36:57 UTC"}
{"comment_id": "kjh8w6t", "comment_author": "CunningStunt_1", "comment_body": "With difficulty. \n\nFor wiring between joist with no access; I cut a 100mm hole in the ceiling, drill the joist and then patch the hole with the same cut out. \n\nMillion different ways to do it. I'm sure someone here will have a potentially better method.", "comment_date": "2024-01-25 08:44:19 UTC"}
{"comment_id": "kjha5te", "comment_author": "curious_trashbat", "comment_body": "If there's a lot of joists to span I generally cut a strip of ceiling down running across joists, wide enough to get a drill into to drill joists.", "comment_date": "2024-01-25 09:00:15 UTC"}
{"comment_id": "kjhbg8h", "comment_author": "geekypenguin91", "comment_body": "Fish what you can and then make a series of \"inspection\" holes where you need to go through joists etc which are then easy to patch afterwards.\n\nIf you're lucky you can get away without having to make many more than you're already making for the spotlights.\n\nSods law however and every spotlight will be right on a joist and they will all go the wrong way for fishing, resulting in needing loads of holes.", "comment_date": "2024-01-25 09:16:37 UTC"}
{"comment_id": "kjhdxs6", "comment_author": "soundslikethunder", "comment_body": "I’ve done downlights where there’s been a void above the joists, easy peash, next to no damage to ceiling/making good. I recently did one that SO MUCH TIMBER that there were more cut outs than downlights with tons of making good (keep the cutouts, put a timber baton behind the hole, screw it in and screw the cut out to the timber, filler) \nAs long as you can prepare the customer for worst case, you won’t know til you get stuck in always, and agree on how far into making good you’ll go. \nIf you can’t navigate a joist, cut a hole either side, drill through and thread your cable through. For cut outs I use a hole saw so making good is easier as above. \nGetting all the positions even and where you want them is another adventure. It’s worth spending the time here to make sure you’ll get them all evenly spaced without hitting joists, and get customer to agree the positions before you start cutting if this isn’t the case. Retro fitting downlights is a different game to wiring for new ceilings so they have to have a bit of understanding in this instance but worth it if you can get them all even and looking the bomb", "comment_date": "2024-01-25 09:47:49 UTC"}
{"comment_id": "kjhbqy1", "comment_author": "DepartureWhole4595", "comment_body": "You not scared about potentially hitting pipework that way?", "comment_date": "2024-01-25 09:20:23 UTC"}
{"comment_id": "kjhbvpk", "comment_author": "DepartureWhole4595", "comment_body": "Does the same method work in stud walls?", "comment_date": "2024-01-25 09:22:02 UTC"}
{"comment_id": "kjhe93n", "comment_author": "DepartureWhole4595", "comment_body": "Informative thanks mate", "comment_date": "2024-01-25 09:51:44 UTC"}
{"comment_id": "kjhdf47", "comment_author": "WilsonSpark", "comment_body": "Pipe work is usually cut through the top of the joist, so you’ll miss them", "comment_date": "2024-01-25 09:41:19 UTC"}
{"comment_id": "kjhc9fl", "comment_author": "geekypenguin91", "comment_body": "Pretty much", "comment_date": "2024-01-25 09:26:50 UTC"}
{"comment_id": "kjh6pya", "comment_author": "_LLOSERR", "comment_body": "have you been thru TSA recently? the scanner sees fucking everything. everything. if the risk of years in prison seems worth putting coke in your ass go for it.", "comment_date": "2024-01-25 08:17:37 UTC"}
{"comment_id": "kjh6to2", "comment_author": "Ohigetjokes", "comment_body": "Anyone who says anything is “fool proof” is an idiot.\n\nFull-body X-rays in most US airports are going to put an end to that idea real quick. Doesn’t matter if it’s a domestic flight or not - your odds of being walked through one of those is 50/50.", "comment_date": "2024-01-25 08:18:51 UTC"}
{"comment_id": "kjh8spe", "comment_author": "bobbyvs", "comment_body": "I dunno man... the price of a ball seems like peanuts compared to getting caught smuggling it. Rip a few and toss it.", "comment_date": "2024-01-25 08:43:07 UTC"}
{"comment_id": "kjh7986", "comment_author": "Amylynn860", "comment_body": "I snuck stuff through tsa in a compact makeup case right under the poofy thing to apply the makeup...they never found it.", "comment_date": "2024-01-25 08:24:04 UTC"}
{"comment_id": "kjh6l85", "comment_author": "las8", "comment_body": "Put it in your carry on. Tsa is looking for bombs and guns not personal amount of drugs.", "comment_date": "2024-01-25 08:16:02 UTC"}
{"comment_id": "kjh7zre", "comment_author": "billionaireastronaut", "comment_body": "Has nobody here smuggled drugs before? It's just for personal use simple....Cocaine does not evaporate... Water does... So pour it in a water bottle. Then when you get to wherever just pour the water into a glass and let it evaporate and only the powder cocaine will remain. Tada. And if you're that paranoid you could do it prison house style and put the Coke in water then get a brush and paint the coke water on a piece of paper then when you get to wherever you're going just smoke or eat the paper. Here's a hint for you....The Bible. Nobody's going to question your Bible. They'll be worried about a lawsuit. Or go all out, wear a priest collar and mark the water as holy water, and carry the Bible, then you got all kinds of options.", "comment_date": "2024-01-25 08:33:14 UTC"}
{"comment_id": "kjhcgvx", "comment_author": "InvestmentNo3437", "comment_body": "It's gonna be embarrassing for you when they see it in the body scanner then start retrieving drugs from your asshole.", "comment_date": "2024-01-25 09:29:26 UTC"}
{"comment_id": "kjhc8e6", "comment_author": "UnemployedMatt", "comment_body": "I’ve traveled more than 10 times by breaking up whatever I had into fine powder and buying a bottle of vitamins from the pharmacy and replacing the powder. \n\nDo it all the time.", "comment_date": "2024-01-25 09:26:27 UTC"}
{"comment_id": "kjh7h7f", "comment_author": "Constant-Apricot-715", "comment_body": "I'd put it in Bic pens. Generic white big hollow tube. Fill a couple full so they look the same, carry them in shirt pocket...want them on you not in luggage.", "comment_date": "2024-01-25 08:26:47 UTC"}
{"comment_id": "kjhb818", "comment_author": "JazzlikePractice4470", "comment_body": "You'll be fine", "comment_date": "2024-01-25 09:13:42 UTC"}
{"comment_id": "kjh9yap", "comment_author": "Hanayama99", "comment_body": "Mail it", "comment_date": "2024-01-25 08:57:35 UTC"}
{"comment_id": "kjhd1kn", "comment_author": "izucantc", "comment_body": "The punishment if you are caught is not worth the risk. Don't try it, just buy from someone local when you get to your destination. Don't get out on the no fly list lol", "comment_date": "2024-01-25 09:36:37 UTC"}
{"comment_id": "kjhdabf", "comment_author": "throwitfarawayfromm3", "comment_body": "I'm an idiot whose never done this before. But what about a balloon In your mouth? Then take it out after. The scanners aren't xrays.", "comment_date": "2024-01-25 09:39:39 UTC"}
{"comment_id": "kjhfbmg", "comment_author": "Thrills4Shills", "comment_body": "Just mail it to yourself  , or sell it to someone before the flight and buy more when off the flight , or next day shipping for fast service. ", "comment_date": "2024-01-25 10:05:03 UTC"}
{"comment_id": "kjhfztf", "comment_author": "Pvnels", "comment_body": "Just snort it all, pussy", "comment_date": "2024-01-25 10:13:16 UTC"}
{"comment_id": "kjhg84x", "comment_author": "Kahraabaa", "comment_body": "Just declare it to the tsa and you should be good to go", "comment_date": "2024-01-25 10:16:07 UTC"}
{"comment_id": "kjh8n7s", "comment_author": "Ok-Walrus-5650", "comment_body": "I have not. Good to know", "comment_date": "2024-01-25 08:41:14 UTC"}
{"comment_id": "kjhbos9", "comment_author": "justausernamehereman", "comment_body": "I’m pretty sure you have the legal right to “opt out” of having to use that full body scanner. And then at that point they do an aggressive full body pat down and walk you through a metal detector. The pat down isn’t as aggressive as you’d think though and they’re only allowed to use the backs of their hands.\n\nAt least that’s the case the last several times I’ve flown. I didn’t have anything illegal. I just fucking hate TSA and anything to exercise what little freedom I have is worth it.", "comment_date": "2024-01-25 09:19:39 UTC"}
{"comment_id": "kjhc86s", "comment_author": "Conwsk", "comment_body": "He actually said full proof so he's clearly not an idiot!", "comment_date": "2024-01-25 09:26:23 UTC"}
{"comment_id": "kjh8v12", "comment_author": "Ok-Walrus-5650", "comment_body": "Probably the smart thing to do haha just gotta get myself to do it", "comment_date": "2024-01-25 08:43:55 UTC"}
{"comment_id": "kjh935t", "comment_author": "chuckyb3", "comment_body": "Depends on the airport, I went thru Dallas recently and they had dogs sniffing all the luggage+passengers (might be bomb sniffing dogs not sure)", "comment_date": "2024-01-25 08:46:45 UTC"}
{"comment_id": "kjh9qxl", "comment_author": "iamamoa", "comment_body": "That coke in water tip is truly a useful illegalifepro tip. Probably the most useful one I've read here and I don't even do coke.", "comment_date": "2024-01-25 08:55:00 UTC"}
{"comment_id": "kjhav4c", "comment_author": "bobalover209", "comment_body": "You can't take liquids with you on a plane, and what about sniffer dogs?", "comment_date": "2024-01-25 09:09:11 UTC"}
{"comment_id": "kjhalz0", "comment_author": "DTXbullrealtor_", "comment_body": "Wtffff this is $", "comment_date": "2024-01-25 09:06:00 UTC"}
{"comment_id": "kjhc4xt", "comment_author": "justausernamehereman", "comment_body": "There’s a story of a famous smuggler who did something just like this for their first few runs.\n\nThey’d dissolve the coke into a bottle of water and then they soaked some poncho / sweater that they were wearing in the water, let it evaporate, and then when they got back over, they just got the poncho / sweater wet again, and let it dry out.\n\nHe said this is how he first moved several “matchboxes” worth of it at first before graduating to some more aggressive and creative methods.", "comment_date": "2024-01-25 09:25:15 UTC"}
{"comment_id": "kjhd3n2", "comment_author": "Ok-Walrus-5650", "comment_body": "Exactly the answer I needed😂😂 I’m being fr too lol", "comment_date": "2024-01-25 09:37:20 UTC"}
{"comment_id": "kjhcouu", "comment_author": "Ok-Walrus-5650", "comment_body": "If the capsules get warm in your bag the ❄️ doesn’t clump up? Worried that a x ray would see that it’s not powder. That’s probably dumbass question lol", "comment_date": "2024-01-25 09:32:13 UTC"}
{"comment_id": "kjhaz65", "comment_author": "Ok-Walrus-5650", "comment_body": "There’s no precautions to catch drugs being mailed? I’m genuinely curious because I have no clue. I might do that instead, just mail it out the day of my flight", "comment_date": "2024-01-25 09:10:34 UTC"}
{"comment_id": "kjhd6z0", "comment_author": "Ok-Walrus-5650", "comment_body": "I don’t trust anyone where I’m going to not give me some laced shit. I know everything’s “laced” but laced as in shit that will kill me", "comment_date": "2024-01-25 09:38:30 UTC"}
{"comment_id": "kjh9rox", "comment_author": "cupkake88", "comment_body": "Get a small eye shadow pallet . Pop the white out and clean it from the foil tray . Press the other white stuff in to the tray. Put other make up items with it keep in your hold luggage", "comment_date": "2024-01-25 08:55:16 UTC"}
{"comment_id": "kjheyar", "comment_author": "Webster_882", "comment_body": "Go get some nasal spray(you want one that actually sprays), empty it and pour some saline or similar in it and then mix your blow in. This will work, and it will be easier to use.", "comment_date": "2024-01-25 10:00:25 UTC"}
{"comment_id": "kjhf75c", "comment_author": "Webster_882", "comment_body": "My roommate has this metal card (think CC size) and on it is the bill of rights. The rights that are violated are highlighted in red, so when they search him for it he can show them which of his rights they are violating haha", "comment_date": "2024-01-25 10:03:30 UTC"}
{"comment_id": "kjhcw09", "comment_author": "ertzrentacar", "comment_body": "I agree! I hate airport security, it’s an infringement of my freedom! \n\nI always make sure to waste everybody’s time around me just because I hate airport security so much!!!\n\nGet a grip retard", "comment_date": "2024-01-25 09:34:45 UTC"}
{"comment_id": "kjhcjsw", "comment_author": "Ok-Walrus-5650", "comment_body": "No he’s right I’m a dumbass hence why I’m asking for the best way to get ❄️ on a plane😂", "comment_date": "2024-01-25 09:30:27 UTC"}
{"comment_id": "kjhd8ap", "comment_author": "ImJettski", "comment_body": "Dissolve it into water bro, let the water evaporate and then scrape up your ❄️", "comment_date": "2024-01-25 09:38:58 UTC"}
{"comment_id": "kjhb47l", "comment_author": "las8", "comment_body": "Re read what I said and then you'll know what kind of dogs they were.", "comment_date": "2024-01-25 09:12:20 UTC"}
{"comment_id": "kjhe4x8", "comment_author": "Odd-Way-1168", "comment_body": "Dogs recently have been dynamically trained to smell not only bombs, but drugs and guns as well.", "comment_date": "2024-01-25 09:50:18 UTC"}
{"comment_id": "kjhbati", "comment_author": "JazzlikePractice4470", "comment_body": "Yes you can", "comment_date": "2024-01-25 09:14:41 UTC"}
{"comment_id": "kjhehhb", "comment_author": "InvestmentNo3437", "comment_body": "Me too. I used to walk thru with thousands of oxys and thousands of dollars in my pockets in 09-10. Try that today. You get scanned. And you actually do have the right to refuse a scan. However, they will then place a dog by your groin and asshole. And it will start barking.", "comment_date": "2024-01-25 09:54:37 UTC"}
{"comment_id": "kjhczjn", "comment_author": "UnemployedMatt", "comment_body": "Make it powder. \n\nBreak down the blow. \n\nPut a dollar bill over top of all the small pieces and used a lighter to go back and forth like a rolling pin to turn the blow into a super fine powder. \n\nThey won’t clump up. \n\nAlso, if you think every TSA worker is zooming into the pills of every passenger you’re crazy. lol", "comment_date": "2024-01-25 09:35:56 UTC"}
{"comment_id": "kjhbh33", "comment_author": "Hanayama99", "comment_body": "Ship USPS. They need a warrant to search", "comment_date": "2024-01-25 09:16:55 UTC"}
{"comment_id": "kjhebgp", "comment_author": "Ok_Consideration584", "comment_body": "In Australia we have x-ray machines that process international and interstate mail", "comment_date": "2024-01-25 09:52:33 UTC"}
{"comment_id": "kjhflkd", "comment_author": "Thrills4Shills", "comment_body": "Not laced stuff can kill you too , if you ain't heard", "comment_date": "2024-01-25 10:08:23 UTC"}
{"comment_id": "kjhf310", "comment_author": "Ok-Walrus-5650", "comment_body": "Does it give you that same high and drip?", "comment_date": "2024-01-25 10:02:04 UTC"}
{"comment_id": "kjhe1in", "comment_author": "Ok-Walrus-5650", "comment_body": "You won’t loose any ❄️ in the process? Will it affect how the blow hits after being dissolved and dried up?", "comment_date": "2024-01-25 09:49:08 UTC"}
{"comment_id": "kjhbuak", "comment_author": "bobalover209", "comment_body": "Not an entire water bottle, only a certain number of travel sized containers.", "comment_date": "2024-01-25 09:21:33 UTC"}
{"comment_id": "kjheiem", "comment_author": "Ok-Walrus-5650", "comment_body": "Thanks man. Never brought shit on a plane I keep schetchin myself out 😂", "comment_date": "2024-01-25 09:54:57 UTC"}
{"comment_id": "kjhff3f", "comment_author": "Webster_882", "comment_body": "Yes to both, also I would put the coke in before saline in case you want to dilute it more or not.\nThis is how I exclusively do coke nowadays, it’s more controlled and feels SO good on the nose. You NEVER wake up to clogged sinuses either.\n\nEdit: it also absorbs faster", "comment_date": "2024-01-25 10:06:11 UTC"}
{"comment_id": "kjhej9q", "comment_author": "ImJettski", "comment_body": "If you lose any it would be a negligible amount. The quality should stay the same once you evaporate the water and scrape it back up. You could also just drink the water if you didn’t want to go through the process of evaporating and scraping.", "comment_date": "2024-01-25 09:55:14 UTC"}
{"comment_id": "kjhbz3b", "comment_author": "JazzlikePractice4470", "comment_body": "That's all he would really need. Honestly I'd just put it in my carry on... I've traveled with dope on an airplane around 3-5 times. Last time was back in like 2010 though.", "comment_date": "2024-01-25 09:23:10 UTC"}
{"comment_id": "kjhcjko", "comment_author": "bobalover209", "comment_body": "Again, what about the sniffer dogs? I've never done it nor ever used, just see this as a hole in his plan", "comment_date": "2024-01-25 09:30:22 UTC"}
{"comment_id": "kjhcx9n", "comment_author": "JazzlikePractice4470", "comment_body": "AFAIK the dogs are there for bombs.", "comment_date": "2024-01-25 09:35:10 UTC"}
{"comment_id": "kjhd01h", "comment_author": "bobalover209", "comment_body": "Ah that would make sense", "comment_date": "2024-01-25 09:36:06 UTC"}
{"comment_id": "kjgvaho", "comment_author": "zffch", "comment_body": "Exactly. The law excludes the cost of employer provided insurance for yourself, your spouse, and your children from being treated as income. But it doesn't say anything about domestic partners, so the value of it is considered part of your wages and taxed accordingly. ", "comment_date": "2024-01-25 06:13:24 UTC"}
{"comment_id": "kjgyq58", "comment_author": "FairBarber4", "comment_body": "Thank you", "comment_date": "2024-01-25 06:48:06 UTC"}
{"comment_id": "kjgzagq", "comment_author": "hoyeay", "comment_body": "Just change it to spouse 😂", "comment_date": "2024-01-25 06:53:57 UTC"}
{"comment_id": "kjh4831", "comment_author": "FairBarber4", "comment_body": "😬", "comment_date": "2024-01-25 07:48:30 UTC"}
{"comment_id": "kjguldi", "comment_author": "JustBoatTrash", "comment_body": "https://www.investopedia.com/articles/investing/042315/fundamentals-how-canada-makes-its-money.asp\n\nCanada's economy is highly developed and one of the largest in the world. In 2022, the country's annual gross domestic product (GDP) was $2.14 trillion in current USD, according to the latest available World Bank data. That made Canada the world's ninth-largest economy", "comment_date": "2024-01-25 06:06:36 UTC"}
{"comment_id": "kjgrjfa", "comment_author": "UnnervingS", "comment_body": "Many jobs will only hire citizens or PRs. The advantage is insane.", "comment_date": "2024-01-25 05:38:22 UTC"}
{"comment_id": "kjgqsaz", "comment_author": "OzAnonn", "comment_body": "As long as someone doesn't struggle to communicate, being a native speaker isn't considered much of an advantage. Of course there's some variation across companies. Years ago I worked in a company where virtually every developer was Caucasian. It's hard to imagine this was a coincidence as it's actually hard to find Caucasians to hire if you tried. \n\nThere's an advantage from a visa point of view though. Especially in this market, a lot of companies might prefer citizens and PRs.", "comment_date": "2024-01-25 05:31:48 UTC"}
{"comment_id": "kjh38ld", "comment_author": "ArtilleryProducer31", "comment_body": "Like the other comments, advantage is insane. I am an international student in Australia, with previous work experience. I just got rejected from a part-time software developer role, because of my visa.", "comment_date": "2024-01-25 07:37:15 UTC"}
{"comment_id": "kjhe3tm", "comment_author": "Darlew", "comment_body": "I feel like it mostly depends on the hiring manager/recruiter/interviewer. An international hiring manager will naturally relate more to an international candidate and the inverse is true for natives. As much as people will try to tell you that proficiency and expertise is the most important factor, personality and connection with the interviewer is way up there too.", "comment_date": "2024-01-25 09:49:54 UTC"}
{"comment_id": "kjh8ddn", "comment_author": "hypermeowmeow", "comment_body": "Damn pal, I don't know if you are kidding or not. As an international student here, I must say it's almost like an impossible game. \n\nIf you try going on Prosple AU and filter visa rights, I think the job listings would just halve :(", "comment_date": "2024-01-25 08:37:50 UTC"}
{"comment_id": "kjgw52r", "comment_author": "theleveragedsellout", "comment_body": "Yeah was going to say, there’s basically no pathway for firms to hire international graduates with the exception of a few very limited circumstances.", "comment_date": "2024-01-25 06:21:43 UTC"}
{"comment_id": "kjh657u", "comment_author": "andrew1677", "comment_body": "I got few hundred rejection before landing a retail job.  Not saying a cs job.", "comment_date": "2024-01-25 08:10:44 UTC"}
{"comment_id": "kjgwoa8", "comment_author": "bilby2020", "comment_body": "Not exactly true. There are exemptions like for Indian students.\n\nhttps://www.afr.com/politics/federal/indian-students-given-exemption-to-work-in-australia-20231214-p5erej", "comment_date": "2024-01-25 06:27:04 UTC"}
{"comment_id": "kjgt9zv", "comment_author": "dr-swordfish", "comment_body": "1. tsa screening is the same for domestic and international. \n2. upon returning to the US you'll go through customs screening. \n3. You are giving consent to a pat down if you enter a checkpoint. The pat downs you may receive are not as invasive as many people make it seem. Any sensitive areas are done with the back of the hands (less nerve endings) by same gender only. Usually are targeted to a small portion of the body. And only take a few seconds to complete. \n4. Keep in mind we're not doing it to find drugs, we're doing it so the plane you get on actually makes it to the destination.", "comment_date": "2024-01-25 05:54:06 UTC"}
{"comment_id": "kjgwsx2", "comment_author": "RSTA30", "comment_body": "Crate training is bullshit. It's no better than how scumbags will put a dog on a short chain and leave it alone in their yard, so I am completely on your boyfriends side on that one. \n\nThe dog is acting up because it is starved for attention from being left alone so often. The last thing that will help is isolating it even more by locking it in a box. They are pack animals and don't do well alone. That's the entire reason we were able to domesticate them.\n\n\nFind a trainer who isn't a proponent of abusing animals. And stop pushing for him to abuse his dog just because some idiot told you to. I will bet your fights over this will magically come to an end.", "comment_date": "2024-01-25 06:28:23 UTC"}
{"comment_id": "kjgl0ky", "comment_author": "AutoModerator", "comment_body": "Thank you for sharing your kitty with us! If you haven't already done so, please take a minute to watch the video and explore the links below. If other Redditors identify your cat as a dilute tortie, standard issue cat, calico, tuxedo, or something else, your post may be removed in order to help keep this sub focused on Nebbies. Please note that Nebelungs must be solid gray. (An allowance is made for a small white patch/locket on the chest.)\n\nAnimal Planet: Cats 101 - Nebelung: \n\nhttps://www.youtube.com/watch?v=2aDwFMEJ0W8\n\nInformation from The International Cat Association (TICA), the world's largest genetic registry of pedigreed and domestic cats.\n\n[About the Nebelung Breed](https://www.tica.org/breeds/browse-all-breeds?view=article&id=1663:the-nebelung-breed&catid=48)\n\n[Nebelung Breed Standards](https://www.tica.org/phocadownload/nb.pdf)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nebelung) if you have any questions or concerns.*", "comment_date": "2024-01-25 04:43:52 UTC"}
{"comment_id": "kjgo55w", "comment_author": "Keeyawn", "comment_body": "Oh wow I just read that the first ones' mom was a black domestic!", "comment_date": "2024-01-25 05:09:14 UTC"}
{"comment_id": "kjgmw6o", "comment_author": "Wolfe_Hunter_VII", "comment_body": "Which state?", "comment_date": "2024-01-25 04:58:55 UTC"}
{"comment_id": "kjgngf2", "comment_author": "New-Connection7198", "comment_body": "Got two vials of test e took about 4 days im from the gold coast\n\nand it was the real deal", "comment_date": "2024-01-25 05:03:33 UTC"}
{"comment_id": "kjgov34", "comment_author": "Zerkxerd", "comment_body": "these guys are good I fucking couldn’t find anyone didn’t take to long", "comment_date": "2024-01-25 05:15:19 UTC"}
{"comment_id": "kjgn1ui", "comment_author": "DomesticGearAUS", "comment_body": "Warehouse In Perth, where you from I can estimate shipping.", "comment_date": "2024-01-25 05:00:13 UTC"}
{"comment_id": "kjgqwy4", "comment_author": "Wolfe_Hunter_VII", "comment_body": "Melbourne, but it’s always a risk crossing state lines - had my shit confiscated before", "comment_date": "2024-01-25 05:32:57 UTC"}
{"comment_id": "kjgw3xt", "comment_author": "DomesticGearAUS", "comment_body": "Probably shitty packaging. Just msg me,", "comment_date": "2024-01-25 06:21:24 UTC"}
{"comment_id": "kjgldyw", "comment_author": "jettTopg", "comment_body": "Yeah good supplier took about 6 days didn’t even get express pretty pricey but you get what you pay for tbh", "comment_date": "2024-01-25 04:46:50 UTC"}
{"comment_id": "kjgy0ij", "comment_author": "selectedsteroidvip1", "comment_body": "The raw materials are produced in China, and most of the world's steroids are exported from China.", "comment_date": "2024-01-25 06:40:40 UTC"}
{"comment_id": "kjh7cqa", "comment_author": "DomesticGearAUS", "comment_body": "Yeah your right but all our stock is at our warehouse in Australia.", "comment_date": "2024-01-25 08:25:16 UTC"}
{"comment_id": "kjgliek", "comment_author": "None", "comment_body": "Domestic is listed first as the quoted currency; foreign is listed second as the base.", "comment_date": "2024-01-25 04:47:49 UTC"}
{"comment_id": "kjgr4ch", "comment_author": "Difficult-Chard-7452", "comment_body": "But conventionally wouldn't domestic currency be your base currency? Thats what level 1 materials said anyway. Is it because we are finding real rates?", "comment_date": "2024-01-25 05:34:46 UTC"}
{"comment_id": "kjgog8q", "comment_author": "visitor987", "comment_body": "You just move out of state you mother cannot stop you.\n\nHere are some job ideas the last one sometimes has housing. This pays well the US Post Office is hiring note it sometimes takes feds three months to hire someone. https://about.usps.com/careers/welcome.htm Take the test and apply for jobs anywhere in USA.\r  \n\r  \nAmtrak is hiring https://careers.amtrak.com/  Jobs exist in most states.\r  \n\r  \nUS Forest service is hiring https://www.fs.usda.gov/working-with-us/jobs \r  \n\r  \nThese also pay well you may not qualify for all of them https://www.fool.com/slideshow/not-many-people-want-these-jobs-and-s-why-they-pay-well/\r  \n50 jobs over $50,000 without college https://www.mrmoneymustache.com/2013/07/25/50-jobs-over-50000-without-a-degree-part-1/ \r  \n\r  \nFederal civil service jobs https://www.usajobs.gov/Search?p=1 \r  \n\r  \nLook into Concessioners for the National Park service. The jobs include fields of Lodging; Campgrounds; Food Service Operations; Guide Services and Outfitters. The jobs SOMETIMES include HOUSING in more remote areas like Montana, New Mexico, Wyoming, Grand Canyon, etc. Some jobs are summer or winter only, others are all year long in one location or you may be able transfer between locations to work year-round. Use this link & enter the name of the park you wish to be employed at https://www.nps.gov/subjects/concessions/authorized-concessioners.htm Contact each concessioner directly by Googling the company name to apply. This link will let you look up parks by state https://www.nps.gov/index.htm not every park has a concessioner.", "comment_date": "2024-01-25 05:11:50 UTC"}
{"comment_id": "kjgjeby", "comment_author": "AutoModerator", "comment_body": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "comment_date": "2024-01-25 04:31:22 UTC"}
{"comment_id": "kjgx729", "comment_author": "InternationalClick78", "comment_body": "Probably not. Domestication requires specific traits that not all animals have. Zebras are a great example of this due to their social structures", "comment_date": "2024-01-25 06:32:22 UTC"}
{"comment_id": "kjgi4zu", "comment_author": "lewisiarediviva", "comment_body": "Probably, maybe. If you selectively breed long enough you’ll get differences. Whether they’re adequate to be considered ‘domesticated’ will be up for debate. Depends on the fundamental limits of social behavior for the species.", "comment_date": "2024-01-25 04:21:52 UTC"}
{"comment_id": "kjgkl7w", "comment_author": "hilmiira", "comment_body": "I mean yeah, domestication is just animals adapting to humans and house life.\n\nAll creatures can be domesticated, some better some worse.", "comment_date": "2024-01-25 04:40:33 UTC"}
{"comment_id": "kjgmv2y", "comment_author": "quiveringcoconut", "comment_body": "Another off the wall thought -- would you be able to somehow determine if a wild animal was at some point domesticated and, for whatever reason, went back to being wild? How could we tell", "comment_date": "2024-01-25 04:58:40 UTC"}
{"comment_id": "kjgxos9", "comment_author": "RainCoatDuckling", "comment_body": "While we have more options thanks to current technology than when we first domesticated animals, some animals would be easier to domestic than others. And it still will take lots of time, money, and resources to change animals enough to be considered domesticated.\n\nCpg grey on yt has a good video on it.\n\nhttps://youtu.be/wOmjnioNulo?si=SKRn0KFwmsjElt4i", "comment_date": "2024-01-25 06:37:21 UTC"}
{"comment_id": "kjgirnn", "comment_author": "quiveringcoconut", "comment_body": "Why hasn't anyone tried to fund research like this? It'd give a better understanding as to the origins and tactics used in humanities first endeavors into the realm of wildlife domestication.", "comment_date": "2024-01-25 04:26:34 UTC"}
{"comment_id": "kjh2qbu", "comment_author": "RainCoatDuckling", "comment_body": "So, I'm not sure what your level of knowledge is. Please forgive me if I explain something you already know.\n\nTo answer your question, we can tell if an animal is domesticated, feral, wild, or tamed.\n\nBeing domesticated means that an animal's ancestors have gone through genetic change to become a different animal, thanks to the efforts of humans. This takes literally hundreds of generations.\n\n A wild animal cannot be domesticated. It can be tamed and can trust, or at least not fear humans. Elephants and deer are tamed often. But they have not been genetically altered through breeding to be useful to us.\n\nA domesticated animal can become feral, like wild mustangs or street dogs. They might fear or mistrust humans, but their ancestors were still genetically altered by human controlled breeding.\n\nThink about it this way. If you're a caveman, and your caveman family finds two wolf pups. You keep them because theyre cute and you would naturally give treats and attention to the wolf pup that was friendlier to you. This creates artificial pressure on the wolf pups genes. Wolves that have calmer personalities are more likely to be rewarded by their adopted human family. They get more food, making them healthier, making them more likely to successfully have more wolf pups. With these new wolf pups, the cycle starts again. Maybe one pup is protective of your family. Maybe he fights a bear off or is the best hunter. You'll definitely want to give him lots of treats for being a good boy. So now this wolf, with his calmer and more loyal genes, benefits from being calmer and loyal thanks to human intervention. And the cycle continues until you have friendly and loyal dogs. The dogs are well fed and can eat cooked scraps, which are easier to digest.\n\nSince we're changing the way evolution pressures domesticated animals, they are able to survive without following the 'dress code'. An albino deer is very rare in the wild because its white coat is bad for camouflage. It will also have bad eyesight and probably will not act as wary around predators as other deer, since it can't see them. But we can find lots of albino animals in captivity, even ones that aren't domesticated, but tamed. Because in captivity, predators will not eat it and mother animals will not abandon odd looking offspring. ( They need to save energy to grow offspring that will actually survive). So we are removing the penalties for not following 'the rules' . \n\nThink about how a dog is different from a wolf. They might have floppy ears, long coats, short or tall, squashed face or long snouts. These traits do not help the dog survive in the wild, but since humans control their 'ecosystem' now. They don't have to follow the 'dresscode'. A dashund can have stubby legs that are useless for hunting elk. It doesn't matter. humans will use them to down rabbit dens, guaranteeing the dog a meal. A wolf who can only hunt rabbit will starve if there is a die off of the rabbits population. A mastiff doesn't have to worry about finding enough food for it's huge body when there's a famine. A husky doesn't have to worry about overheating when it's coat is too fluffy. Chihuahuas don't have to worry about getting eaten by a hawk.\n\nSince domesticated animals usually don't follow the 'dresscode', we can tell if an animal is feral/wild/tamed depending on it's looks and behaviors. Even wolf/dog hybrids have signs, and they're very close genetically. You can look at the slope of their foreheads and if they have dewclaws, etc.\n\nHumans using our giant brains are basically able to cheat the system. We can build ropes and fences to control animal movements. We know what the animal eats and what's bad for it, ensuring our animals are healthy and have healthier babies. We live a long time, so we can, over time, choose which animals we like best and select for that trait. The things we don't like, we can cull out. Either through eating or removing it from our selected gene pool.\n\nSorry for ramble. Hope you find this interesting. Try looking up a vid on the russian silver fox breeding experiment. They were trying to select for calmer foxes to see what would happen. They also did the opposite and bred a bunch of mean ones by selecting the jerk foxes lol.", "comment_date": "2024-01-25 07:31:33 UTC"}
{"comment_id": "kjgixmk", "comment_author": "lewisiarediviva", "comment_body": "They have, and are. Quite famous ongoing experiment in Russia that resulted in the ‘domesticated silver fox’.", "comment_date": "2024-01-25 04:27:49 UTC"}
{"comment_id": "kjh303k", "comment_author": "Aside_Electrical", "comment_body": "You may not be legally permitted to use a domestic machine because it may not have the required certifications.", "comment_date": "2024-01-25 07:34:39 UTC"}
{"comment_id": "kjgbomj", "comment_author": "ananthropolothology", "comment_body": "For a while it was really the cheapest domestic, and you could get it in tallboys at the bar. Chicago has Hamm's and Old Style, Seattle has Olympia and Ranier, Baltimore has Natty Boh, etc (though some of those are brewed locally). Every city has their go-to cheap beer, PBR just somehow became the option for here.", "comment_date": "2024-01-25 03:36:22 UTC"}
{"comment_id": "kjg9mls", "comment_author": "AutoModerator", "comment_body": "In an attempt to reduce remind me spam, all top comments that include a remind me will be removed. If you would like to have a remind me, please reply to this comment. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/humansarespaceorcs) if you have any questions or concerns.*", "comment_date": "2024-01-25 03:22:34 UTC"}
{"comment_id": "kjgfeg2", "comment_author": "OSadorn", "comment_body": "\"This is their domestication instinct?\" I asked with an alert tone, pinned down by a being that I thought wouldn't be a household pet or similar.\n\nThe lithe, mouthless enigma of a sapient who watched the situation elaborated again as if I didn't hear.\n\nI then spoke at them with panic! \"If this isn't a 'mating display' then WHAT IS?!\"\n\nThe creature who had effectively dropped its weight at me was now trying to rub themselves onto me like a non-cringe-inducing scent application method.\n\nFor 'urban wildlife' these beings are a near-identical to some of the creative half-monsters we've imagined.\n\nAnd this guy thinks I'd make a good handler?\n\nI feel like the reverse is more likely. I decide to tease the creature's uncannily humane face with a slight kiss.\n\nThat drew them to pulling me up into a hug and leaning back, almost plexing me into an upright posture while I returned the favour.\n\nWe then danced in circles around eachother for a bit, never letting go.\n\nThe mouthless observer of a 'friend' nodded as the dancing slowed to a stop and we butted heads. He told me this - \"You are bonded... It's the first time I've seen her kind do this ritual with a human.\"\n\nHold on. Repeat that again. What?\n\nI think that but it seems I've spilled something. The observer curtly nods and then just leaves me and this... domesticated companion.\n\nIn my room.\n\nBy all that is holy-\n\n...More cuddling. My eyes are lidded, tired. She's ruffling my hair now and is actually whispering legible words, but I am-\n\nI flop onto the bed. She follows.\n\n\\- - - The next few days were a blur, redacted for dignity.\n\nThe 'friend' of mine has returned with a myriad of other beings. Apparently from the local animal shelter.\n\nHe claims my kind are a nebulous legal grey-zone where we cannot be classed as 'companions' or 'pets' because we can space and things but this one...\n\nHer kind have bamboozled the Orion-colonial Protoss. Why haven't they noticed?", "comment_date": "2024-01-25 04:01:58 UTC"}
{"comment_id": "kjgd50g", "comment_author": "A_normal_storyteller", "comment_body": "\"How come?\"\n\nNate looked back, while holding the red shirt in front of the slime-covered tadpole-like creature, while at the same time holding the small insectoid on his other hand, he seemed confused and rightfully so, since the amphibian kept making loud noises, oddly similar to a mix of both, chirping and crying.\n\n\"Yes, that thing is a female amphibiaganax, a young one on top of that, those creatures were the bane of our species long ago, they used to prey on our cattle after all, also, the slime is a Gluesterax, a symbiotic colonial organism, it acts a bit like that one character of retro terran movies\"\n\n\"What?, I may be a human but i'm not a movie nerd like you Lisa, I really don't know what are you talking about\"\n\n\"The thing, that creature from that horror movie Dad used to watch every october\"\n\n\"Lisa... bring me my flamm...\"\n\n\"NO, come on big brother, don't go full murderape on these two, I told you they are being tamed as we speak, didn't I?\"\n\n\"You told me I triggered their domestication instinct, and from what I remember that thing doesn't even exists!\"\n\n\"We are pretty much creating it, specially if you keep waving that blue shirt in front of them!\"\n\n\"Lisa, this shirt is red, also, how come this thing is causing them to... emmm, chirping-crying?, Cryping?, Chirying?\"\n\n\"For the last time brother, you were bitten by a colour scorpion, your eyes are tricking you into believe that some stuff has different colours, that is how the scorpion leads its prey back to its nest!\"\n\n\"Yeah, but I pummeled the motherfucker to the ground with my AK-47, so shut up and give me my flamm...!\"\n\n\"LISTEN UP YOU MURDER APE, THESE THINGS ACT LIKE DOGGOS ONCE THEY ARE DOMESTICATED!\"\n\nIn an split of a second, the small insectoid was sent flying as Nate fell to his knees focusing  on the gigantic tadpole, then, after a few seconds, the creature let out the single most horrible purr one could ever expect...\n\n\"Ohhhh, you are right Lisa, this big baby sounds just like Matilda!, I'm sure they will get along extremely well!\"\n\n\"Puaj, you had to throw me right into the feces?\" The insect flew up from a pile of mud and purple sphere shaped rocks \"And... you are right... the call of that thing really mirrors Matilda's...\"\n\n\"Oh, you are so smooth!, Who's a good girl?, Who's a good girl?\"\n\nNate pulled up the tadpole before sitting on the floor letting the creature rest on his lap, the horrible purring kept going, as if some sort of stray monster had found its way inside a cave, and yet, Nate couldn't be happier hearing it.\n\nThe slime began to coat Nate's arms, as it slowly but surely divided into two halves, one remaining with the tadpole, while the other began to solidify into a crystaline structure, resembling crystal claws, forming a protective coat all over the lenght of his arms.\n\n\"Uh,, neat, you just bonded with the slime, so, big brother, want me to call Matilda to get us to the ship?\"\n\n\"Yeah, I'm sure she will love these two fellas... hey, no biting!\" Nate groaned as he felt the tadpole bite his knee, surprisingly, the creature had three rows of teeth, each one looking more and more like broken glass rather than healthy teeth. \"Alright, Matilda should be here any second bro, also don't forget to take our new pet to the vet\"\n\n\"Thanks sis, What do you think that Mom made for dinner?\"\n\n\"Most likely she just boiled something barely organic, again, as she always do\"\n\nBoth giggled as a giant reptile, with four limbs, a pair of tails and four sets of wings began descending as fast as sound towards them, on its neck an small collar with the name \"Matilda, the big red dragoness\"...\n\n\n\n\n\n\n\n  \n(Disclaimer: written in less than five minutes, and felt way too lazy to edit it properly)", "comment_date": "2024-01-25 03:46:12 UTC"}
{"submission_title": "Can I fly domestically on a pending green card case through marriage?", "comment_id": "kjhfmvg", "comment_author": "AutoModerator", "comment_body": "Hi there! This is an automated message to inform you and/or remind you of several things: \n\n- We have [a wiki](https://www.reddit.com/r/USCIS/wiki/index). It doesn't cover everything but may answer some questions. Pay special attention to the \"[REALLY common questions](https://www.reddit.com/r/USCIS/wiki/index/vfaq)\" at the top of the FAQ section. Please read it, and if it contains the answer to your question, please delete your post. If your post has to do with something covered in the FAQ, we may remove it.\n- If your post is about biometrics, green cards, naturalization or timelines in general, and whether you're asking or sharing, please include your field office/location in your post. If you already did that, great, thank you! If you haven't done that, your post may be removed without notice.\n- This subreddit is not affiliated with USCIS or the US government in any way. Some posters may claim to work for USCIS, which may or may not be true, and we don't try to verify this one way or another. Be wary that it may be a scam if anyone is asking you for personal info, or sending you a direct message, or asking that you send them a direct message.\n- Some people here claim to be lawyers, but they are not YOUR lawyer. No advice found here should be construed as legal advice. Reddit is not a substitute for a real lawyer. If you need help finding legal services, visit [this link](https://www.uscis.gov/avoid-scams/find-legal-services) for more information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/USCIS) if you have any questions or concerns.*", "comment_date": "2024-01-25 10:08:51 UTC"}
{"submission_title": "Is it true that men used to domestically abuse their wives often in the early to mid 19th century?", "comment_id": "kjhg9cu", "comment_author": "pessimisticfan38", "comment_body": "Used to?", "comment_date": "2024-01-25 10:16:31 UTC"}
{"submission_title": "Is it true that men used to domestically abuse their wives often in the early to mid 19th century?", "comment_id": "kjhg3rz", "comment_author": "Felicia_Svilling", "comment_body": "Yes.", "comment_date": "2024-01-25 10:14:38 UTC"}
{"submission_title": "McDonald's has a major impact on the U.S. economy, generating $108b in gross domestic product a year. 1 in 8 Americans have worked at McDonald's at some point in their lives.", "comment_id": "kjhcfng", "comment_author": "AutoModerator", "comment_body": "Welcome to our community [r/paydayloan_online/](https://www.reddit.com/r/paydayloan_online/) and Thank you for your submission!  If you are looking for a payday loan, make sure you read this post [Unlock Your financial Freedom with payday loan](https://www.reddit.com/r/paydayloan_online/comments/19eecly/unlock_your_financial_freedom_with_payday_loans/) right now.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/paydayloan_online) if you have any questions or concerns.*", "comment_date": "2024-01-25 09:29:00 UTC"}
{"submission_title": "China tightens access to offshore investment funds as domestic market flounders - Financial Times", "comment_id": "kjh7y82", "comment_author": "AutoModerator", "comment_body": "Hi all,\n\nA reminder that comments do need to be on-topic and engage with the article past the headline. Please make sure to read the article before commenting.  Very short comments will automatically be removed by automod. Please avoid making comments that do not focus on the economic content or whose primary thesis rests on personal anecdotes. \n\nAs always our comment rules can be found [here](https://reddit.com/r/Economics/comments/fx9crj/rules_roundtable_redux_rule_vi_and_offtopic/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Economics) if you have any questions or concerns.*", "comment_date": "2024-01-25 08:32:41 UTC"}
{"submission_title": "China tightens access to offshore investment funds as domestic market flounders - Financial Times", "comment_id": "kjh8rnu", "comment_author": "AdAlarmed69", "comment_body": "***Full article***\n\nCurbs on funds that allow retail investors to bet on foreign securities come amid sell-off in Chinese equities\n\n&#x200B;\n\nChinese authorities are tightening limits on capital outflows by restricting access to funds that invest in offshore securities as the country battles a brutal market rout.About a third of Chinese funds that invest in foreign securities under a scheme that bypasses strict capital controls have announced in stock exchange notices they have suspended or capped sales to retail investors “to maintain stable operations and protect investors’ interests”.\n\n&#x200B;\n\nThe Beijing-based manager of one fund that focuses on US stocks said they had received informal instructions from the Shanghai Stock Exchange to reduce sales of such products targeting overseas markets after demand went “through the roof”.\n\nChinese authorities have repeatedly tried to halt a protracted sell-off in domestic equities over the past year, but the efforts have failed to improve battered sentiment, prompting many investors to look for higher yields elsewhere.\n\n&#x200B;\n\nThe soaring popularity among retail investors of foreign-targeted funds has raised regulator concerns about capital outflows. The Financial Times reported last August that China’s biggest fund houses were nearing government quota limits on offshore investment.The government’s Qualified Domestic Institutional Investor scheme allows banks, brokerages and asset managers to bypass China’s strict capital controls. Buying into funds offered through the QDII scheme is the only legal way for Chinese retail investors to invest in foreign stocks and bonds.\n\n&#x200B;\n\nAn increase in investor demand has caused some funds to hit their quota, while other funds have received directions from Chinese regulators to slow or in some cases stop sales of the funds.Public filings show 79 Chinese QDII funds have suspended sales to retail investors and 53 have capped them. Together, these account for about 30 per cent of all QDII funds that target non-Hong Kong overseas markets. The funds include some operated by JPMorgan Asset Management and Manulife Investment Management.\n\n&#x200B;\n\nJPMorgan did not respond to a request for comment, while Manulife declined to comment.Separately, multiple Chinese brokerages that sell funds to retail investors through the QDII scheme said on Tuesday in public filings that regulators led by the Shanghai Stock Exchange were cracking down on “abnormal trading” in exchange traded funds that invest in foreign equities.\n\n&#x200B;\n\nThe brokerages said regulators had in particular requested the suspension of transactions involving ETFs that sought to match the performance of the MSCI USA 50, Nasdaq 100 and Japan’s Nikkei 225 indices.\n\n&#x200B;\n\nThe tightly controlled QDII quotas have intensified competition for outbound investments, with such ETFs trading well above their net asset value. Beijing had a total quota of $166bn across 186 institutions for QDII investments as of the end of 2023, up only slightly since 2021.“Rocketing demand on one hand and quota restrictions on the other, the two factors both contributed to the particularly hot situation in QDII funds we are seeing right now,” said Ding Wenjie, global capital investment strategist at China Asset Management.\n\n&#x200B;\n\nDing said the appetite for funds linked to Japan’s Nikkei index had become “irrational” this month, with one trading at up to a 20 per cent premium to its asset value. Funds targeting the US and India were also popular, Ding said.\n\n&#x200B;\n\nThe China Securities Regulatory Commission and Shanghai Stock Exchange did not respond to requests for comment.Since October, market regulators have been providing private instructions — known as “window guidance” — to some investors, preventing them from being net sellers of equities on certain days.China’s benchmark CSI 300 index has fallen nearly 5 per cent since the start of 2024, continuing a rout fuelled by disappointment with government policies and lingering concerns about a slow economic rebound.", "comment_date": "2024-01-25 08:42:45 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjh8ase", "comment_author": "dingo_deano", "comment_body": "It is magic.  But seriously you have more or less answered your own question. ‘Without pulling WHOLE ceiling down’", "comment_date": "2024-01-25 08:36:57 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjh8w6t", "comment_author": "CunningStunt_1", "comment_body": "With difficulty. \n\nFor wiring between joist with no access; I cut a 100mm hole in the ceiling, drill the joist and then patch the hole with the same cut out. \n\nMillion different ways to do it. I'm sure someone here will have a potentially better method.", "comment_date": "2024-01-25 08:44:19 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjha5te", "comment_author": "curious_trashbat", "comment_body": "If there's a lot of joists to span I generally cut a strip of ceiling down running across joists, wide enough to get a drill into to drill joists.", "comment_date": "2024-01-25 09:00:15 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhbg8h", "comment_author": "geekypenguin91", "comment_body": "Fish what you can and then make a series of \"inspection\" holes where you need to go through joists etc which are then easy to patch afterwards.\n\nIf you're lucky you can get away without having to make many more than you're already making for the spotlights.\n\nSods law however and every spotlight will be right on a joist and they will all go the wrong way for fishing, resulting in needing loads of holes.", "comment_date": "2024-01-25 09:16:37 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhdxs6", "comment_author": "soundslikethunder", "comment_body": "I’ve done downlights where there’s been a void above the joists, easy peash, next to no damage to ceiling/making good. I recently did one that SO MUCH TIMBER that there were more cut outs than downlights with tons of making good (keep the cutouts, put a timber baton behind the hole, screw it in and screw the cut out to the timber, filler) \nAs long as you can prepare the customer for worst case, you won’t know til you get stuck in always, and agree on how far into making good you’ll go. \nIf you can’t navigate a joist, cut a hole either side, drill through and thread your cable through. For cut outs I use a hole saw so making good is easier as above. \nGetting all the positions even and where you want them is another adventure. It’s worth spending the time here to make sure you’ll get them all evenly spaced without hitting joists, and get customer to agree the positions before you start cutting if this isn’t the case. Retro fitting downlights is a different game to wiring for new ceilings so they have to have a bit of understanding in this instance but worth it if you can get them all even and looking the bomb", "comment_date": "2024-01-25 09:47:49 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhbqy1", "comment_author": "DepartureWhole4595", "comment_body": "You not scared about potentially hitting pipework that way?", "comment_date": "2024-01-25 09:20:23 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhbvpk", "comment_author": "DepartureWhole4595", "comment_body": "Does the same method work in stud walls?", "comment_date": "2024-01-25 09:22:02 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhe93n", "comment_author": "DepartureWhole4595", "comment_body": "Informative thanks mate", "comment_date": "2024-01-25 09:51:44 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhdf47", "comment_author": "WilsonSpark", "comment_body": "Pipe work is usually cut through the top of the joist, so you’ll miss them", "comment_date": "2024-01-25 09:41:19 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhc9fl", "comment_author": "geekypenguin91", "comment_body": "Pretty much", "comment_date": "2024-01-25 09:26:50 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh6pya", "comment_author": "_LLOSERR", "comment_body": "have you been thru TSA recently? the scanner sees fucking everything. everything. if the risk of years in prison seems worth putting coke in your ass go for it.", "comment_date": "2024-01-25 08:17:37 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh6to2", "comment_author": "Ohigetjokes", "comment_body": "Anyone who says anything is “fool proof” is an idiot.\n\nFull-body X-rays in most US airports are going to put an end to that idea real quick. Doesn’t matter if it’s a domestic flight or not - your odds of being walked through one of those is 50/50.", "comment_date": "2024-01-25 08:18:51 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh8spe", "comment_author": "bobbyvs", "comment_body": "I dunno man... the price of a ball seems like peanuts compared to getting caught smuggling it. Rip a few and toss it.", "comment_date": "2024-01-25 08:43:07 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh7986", "comment_author": "Amylynn860", "comment_body": "I snuck stuff through tsa in a compact makeup case right under the poofy thing to apply the makeup...they never found it.", "comment_date": "2024-01-25 08:24:04 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh6l85", "comment_author": "las8", "comment_body": "Put it in your carry on. Tsa is looking for bombs and guns not personal amount of drugs.", "comment_date": "2024-01-25 08:16:02 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh7zre", "comment_author": "billionaireastronaut", "comment_body": "Has nobody here smuggled drugs before? It's just for personal use simple....Cocaine does not evaporate... Water does... So pour it in a water bottle. Then when you get to wherever just pour the water into a glass and let it evaporate and only the powder cocaine will remain. Tada. And if you're that paranoid you could do it prison house style and put the Coke in water then get a brush and paint the coke water on a piece of paper then when you get to wherever you're going just smoke or eat the paper. Here's a hint for you....The Bible. Nobody's going to question your Bible. They'll be worried about a lawsuit. Or go all out, wear a priest collar and mark the water as holy water, and carry the Bible, then you got all kinds of options.", "comment_date": "2024-01-25 08:33:14 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhc8e6", "comment_author": "UnemployedMatt", "comment_body": "I’ve traveled more than 10 times by breaking up whatever I had into fine powder and buying a bottle of vitamins from the pharmacy and replacing the powder. \n\nDo it all the time.", "comment_date": "2024-01-25 09:26:27 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcgvx", "comment_author": "InvestmentNo3437", "comment_body": "It's gonna be embarrassing for you when they see it in the body scanner then start retrieving drugs from your asshole.", "comment_date": "2024-01-25 09:29:26 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh7h7f", "comment_author": "Constant-Apricot-715", "comment_body": "I'd put it in Bic pens. Generic white big hollow tube. Fill a couple full so they look the same, carry them in shirt pocket...want them on you not in luggage.", "comment_date": "2024-01-25 08:26:47 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhb818", "comment_author": "JazzlikePractice4470", "comment_body": "You'll be fine", "comment_date": "2024-01-25 09:13:42 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh9yap", "comment_author": "Hanayama99", "comment_body": "Mail it", "comment_date": "2024-01-25 08:57:35 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd1kn", "comment_author": "izucantc", "comment_body": "The punishment if you are caught is not worth the risk. Don't try it, just buy from someone local when you get to your destination. Don't get out on the no fly list lol", "comment_date": "2024-01-25 09:36:37 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhdabf", "comment_author": "throwitfarawayfromm3", "comment_body": "I'm an idiot whose never done this before. But what about a balloon In your mouth? Then take it out after. The scanners aren't xrays.", "comment_date": "2024-01-25 09:39:39 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhfbmg", "comment_author": "Thrills4Shills", "comment_body": "Just mail it to yourself  , or sell it to someone before the flight and buy more when off the flight , or next day shipping for fast service. ", "comment_date": "2024-01-25 10:05:03 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhfztf", "comment_author": "Pvnels", "comment_body": "Just snort it all, pussy", "comment_date": "2024-01-25 10:13:16 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhg84x", "comment_author": "Kahraabaa", "comment_body": "Just declare it to the tsa and you should be good to go", "comment_date": "2024-01-25 10:16:07 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh8n7s", "comment_author": "Ok-Walrus-5650", "comment_body": "I have not. Good to know", "comment_date": "2024-01-25 08:41:14 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbos9", "comment_author": "justausernamehereman", "comment_body": "I’m pretty sure you have the legal right to “opt out” of having to use that full body scanner. And then at that point they do an aggressive full body pat down and walk you through a metal detector. The pat down isn’t as aggressive as you’d think though and they’re only allowed to use the backs of their hands.\n\nAt least that’s the case the last several times I’ve flown. I didn’t have anything illegal. I just fucking hate TSA and anything to exercise what little freedom I have is worth it.", "comment_date": "2024-01-25 09:19:39 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhc86s", "comment_author": "Conwsk", "comment_body": "He actually said full proof so he's clearly not an idiot!", "comment_date": "2024-01-25 09:26:23 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh8v12", "comment_author": "Ok-Walrus-5650", "comment_body": "Probably the smart thing to do haha just gotta get myself to do it", "comment_date": "2024-01-25 08:43:55 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh935t", "comment_author": "chuckyb3", "comment_body": "Depends on the airport, I went thru Dallas recently and they had dogs sniffing all the luggage+passengers (might be bomb sniffing dogs not sure)", "comment_date": "2024-01-25 08:46:45 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh9qxl", "comment_author": "iamamoa", "comment_body": "That coke in water tip is truly a useful illegalifepro tip. Probably the most useful one I've read here and I don't even do coke.", "comment_date": "2024-01-25 08:55:00 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhav4c", "comment_author": "bobalover209", "comment_body": "You can't take liquids with you on a plane, and what about sniffer dogs?", "comment_date": "2024-01-25 09:09:11 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhalz0", "comment_author": "DTXbullrealtor_", "comment_body": "Wtffff this is $", "comment_date": "2024-01-25 09:06:00 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhc4xt", "comment_author": "justausernamehereman", "comment_body": "There’s a story of a famous smuggler who did something just like this for their first few runs.\n\nThey’d dissolve the coke into a bottle of water and then they soaked some poncho / sweater that they were wearing in the water, let it evaporate, and then when they got back over, they just got the poncho / sweater wet again, and let it dry out.\n\nHe said this is how he first moved several “matchboxes” worth of it at first before graduating to some more aggressive and creative methods.", "comment_date": "2024-01-25 09:25:15 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcouu", "comment_author": "Ok-Walrus-5650", "comment_body": "If the capsules get warm in your bag the ❄️ doesn’t clump up? Worried that a x ray would see that it’s not powder. That’s probably dumbass question lol", "comment_date": "2024-01-25 09:32:13 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd3n2", "comment_author": "Ok-Walrus-5650", "comment_body": "Exactly the answer I needed😂😂 I’m being fr too lol", "comment_date": "2024-01-25 09:37:20 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhaz65", "comment_author": "Ok-Walrus-5650", "comment_body": "There’s no precautions to catch drugs being mailed? I’m genuinely curious because I have no clue. I might do that instead, just mail it out the day of my flight", "comment_date": "2024-01-25 09:10:34 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd6z0", "comment_author": "Ok-Walrus-5650", "comment_body": "I don’t trust anyone where I’m going to not give me some laced shit. I know everything’s “laced” but laced as in shit that will kill me", "comment_date": "2024-01-25 09:38:30 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh9rox", "comment_author": "cupkake88", "comment_body": "Get a small eye shadow pallet . Pop the white out and clean it from the foil tray . Press the other white stuff in to the tray. Put other make up items with it keep in your hold luggage", "comment_date": "2024-01-25 08:55:16 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjheyar", "comment_author": "Webster_882", "comment_body": "Go get some nasal spray(you want one that actually sprays), empty it and pour some saline or similar in it and then mix your blow in. This will work, and it will be easier to use.", "comment_date": "2024-01-25 10:00:25 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhf75c", "comment_author": "Webster_882", "comment_body": "My roommate has this metal card (think CC size) and on it is the bill of rights. The rights that are violated are highlighted in red, so when they search him for it he can show them which of his rights they are violating haha", "comment_date": "2024-01-25 10:03:30 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcw09", "comment_author": "ertzrentacar", "comment_body": "I agree! I hate airport security, it’s an infringement of my freedom! \n\nI always make sure to waste everybody’s time around me just because I hate airport security so much!!!\n\nGet a grip retard", "comment_date": "2024-01-25 09:34:45 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcjsw", "comment_author": "Ok-Walrus-5650", "comment_body": "No he’s right I’m a dumbass hence why I’m asking for the best way to get ❄️ on a plane😂", "comment_date": "2024-01-25 09:30:27 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd8ap", "comment_author": "ImJettski", "comment_body": "Dissolve it into water bro, let the water evaporate and then scrape up your ❄️", "comment_date": "2024-01-25 09:38:58 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhb47l", "comment_author": "las8", "comment_body": "Re read what I said and then you'll know what kind of dogs they were.", "comment_date": "2024-01-25 09:12:20 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhe4x8", "comment_author": "Odd-Way-1168", "comment_body": "Dogs recently have been dynamically trained to smell not only bombs, but drugs and guns as well.", "comment_date": "2024-01-25 09:50:18 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbati", "comment_author": "JazzlikePractice4470", "comment_body": "Yes you can", "comment_date": "2024-01-25 09:14:41 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhczjn", "comment_author": "UnemployedMatt", "comment_body": "Make it powder. \n\nBreak down the blow. \n\nPut a dollar bill over top of all the small pieces and used a lighter to go back and forth like a rolling pin to turn the blow into a super fine powder. \n\nThey won’t clump up. \n\nAlso, if you think every TSA worker is zooming into the pills of every passenger you’re crazy. lol", "comment_date": "2024-01-25 09:35:56 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhehhb", "comment_author": "InvestmentNo3437", "comment_body": "Me too. I used to walk thru with thousands of oxys and thousands of dollars in my pockets in 09-10. Try that today. You get scanned. And you actually do have the right to refuse a scan. However, they will then place a dog by your groin and asshole. And it will start barking.", "comment_date": "2024-01-25 09:54:37 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbh33", "comment_author": "Hanayama99", "comment_body": "Ship USPS. They need a warrant to search", "comment_date": "2024-01-25 09:16:55 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhebgp", "comment_author": "Ok_Consideration584", "comment_body": "In Australia we have x-ray machines that process international and interstate mail", "comment_date": "2024-01-25 09:52:33 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhflkd", "comment_author": "Thrills4Shills", "comment_body": "Not laced stuff can kill you too , if you ain't heard", "comment_date": "2024-01-25 10:08:23 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhf310", "comment_author": "Ok-Walrus-5650", "comment_body": "Does it give you that same high and drip?", "comment_date": "2024-01-25 10:02:04 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhe1in", "comment_author": "Ok-Walrus-5650", "comment_body": "You won’t loose any ❄️ in the process? Will it affect how the blow hits after being dissolved and dried up?", "comment_date": "2024-01-25 09:49:08 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbuak", "comment_author": "bobalover209", "comment_body": "Not an entire water bottle, only a certain number of travel sized containers.", "comment_date": "2024-01-25 09:21:33 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjheiem", "comment_author": "Ok-Walrus-5650", "comment_body": "Thanks man. Never brought shit on a plane I keep schetchin myself out 😂", "comment_date": "2024-01-25 09:54:57 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhff3f", "comment_author": "Webster_882", "comment_body": "Yes to both, also I would put the coke in before saline in case you want to dilute it more or not.\nThis is how I exclusively do coke nowadays, it’s more controlled and feels SO good on the nose. You NEVER wake up to clogged sinuses either.\n\nEdit: it also absorbs faster", "comment_date": "2024-01-25 10:06:11 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhej9q", "comment_author": "ImJettski", "comment_body": "If you lose any it would be a negligible amount. The quality should stay the same once you evaporate the water and scrape it back up. You could also just drink the water if you didn’t want to go through the process of evaporating and scraping.", "comment_date": "2024-01-25 09:55:14 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbz3b", "comment_author": "JazzlikePractice4470", "comment_body": "That's all he would really need. Honestly I'd just put it in my carry on... I've traveled with dope on an airplane around 3-5 times. Last time was back in like 2010 though.", "comment_date": "2024-01-25 09:23:10 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcjko", "comment_author": "bobalover209", "comment_body": "Again, what about the sniffer dogs? I've never done it nor ever used, just see this as a hole in his plan", "comment_date": "2024-01-25 09:30:22 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcx9n", "comment_author": "JazzlikePractice4470", "comment_body": "AFAIK the dogs are there for bombs.", "comment_date": "2024-01-25 09:35:10 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd01h", "comment_author": "bobalover209", "comment_body": "Ah that would make sense", "comment_date": "2024-01-25 09:36:06 UTC"}
{"submission_title": "Domestic partner tax help?", "comment_id": "kjgvaho", "comment_author": "zffch", "comment_body": "Exactly. The law excludes the cost of employer provided insurance for yourself, your spouse, and your children from being treated as income. But it doesn't say anything about domestic partners, so the value of it is considered part of your wages and taxed accordingly. ", "comment_date": "2024-01-25 06:13:24 UTC"}
{"submission_title": "Domestic partner tax help?", "comment_id": "kjgyq58", "comment_author": "FairBarber4", "comment_body": "Thank you", "comment_date": "2024-01-25 06:48:06 UTC"}
{"submission_title": "Domestic partner tax help?", "comment_id": "kjgzagq", "comment_author": "hoyeay", "comment_body": "Just change it to spouse 😂", "comment_date": "2024-01-25 06:53:57 UTC"}
{"submission_title": "Domestic partner tax help?", "comment_id": "kjh4831", "comment_author": "FairBarber4", "comment_body": "😬", "comment_date": "2024-01-25 07:48:30 UTC"}
{"submission_title": "Canadian Home Price Drop Risks Pushing $34 Billion in Loans Underwater", "comment_id": "kjguldi", "comment_author": "JustBoatTrash", "comment_body": "https://www.investopedia.com/articles/investing/042315/fundamentals-how-canada-makes-its-money.asp\n\nCanada's economy is highly developed and one of the largest in the world. In 2022, the country's annual gross domestic product (GDP) was $2.14 trillion in current USD, according to the latest available World Bank data. That made Canada the world's ninth-largest economy", "comment_date": "2024-01-25 06:06:36 UTC"}
{"submission_title": "Can I fly domestically on a pending green card case through marriage?", "comment_id": "kjhfmvg", "comment_author": "AutoModerator", "comment_body": "Hi there! This is an automated message to inform you and/or remind you of several things: \n\n- We have [a wiki](https://www.reddit.com/r/USCIS/wiki/index). It doesn't cover everything but may answer some questions. Pay special attention to the \"[REALLY common questions](https://www.reddit.com/r/USCIS/wiki/index/vfaq)\" at the top of the FAQ section. Please read it, and if it contains the answer to your question, please delete your post. If your post has to do with something covered in the FAQ, we may remove it.\n- If your post is about biometrics, green cards, naturalization or timelines in general, and whether you're asking or sharing, please include your field office/location in your post. If you already did that, great, thank you! If you haven't done that, your post may be removed without notice.\n- This subreddit is not affiliated with USCIS or the US government in any way. Some posters may claim to work for USCIS, which may or may not be true, and we don't try to verify this one way or another. Be wary that it may be a scam if anyone is asking you for personal info, or sending you a direct message, or asking that you send them a direct message.\n- Some people here claim to be lawyers, but they are not YOUR lawyer. No advice found here should be construed as legal advice. Reddit is not a substitute for a real lawyer. If you need help finding legal services, visit [this link](https://www.uscis.gov/avoid-scams/find-legal-services) for more information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/USCIS) if you have any questions or concerns.*", "comment_date": "2024-01-25 10:08:51 UTC"}
{"submission_title": "McDonald's has a major impact on the U.S. economy, generating $108b in gross domestic product a year. 1 in 8 Americans have worked at McDonald's at some point in their lives.", "comment_id": "kjhcfng", "comment_author": "AutoModerator", "comment_body": "Welcome to our community [r/paydayloan_online/](https://www.reddit.com/r/paydayloan_online/) and Thank you for your submission!  If you are looking for a payday loan, make sure you read this post [Unlock Your financial Freedom with payday loan](https://www.reddit.com/r/paydayloan_online/comments/19eecly/unlock_your_financial_freedom_with_payday_loans/) right now.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/paydayloan_online) if you have any questions or concerns.*", "comment_date": "2024-01-25 09:29:00 UTC"}
{"submission_title": "China tightens access to offshore investment funds as domestic market flounders - Financial Times", "comment_id": "kjh7y82", "comment_author": "AutoModerator", "comment_body": "Hi all,\n\nA reminder that comments do need to be on-topic and engage with the article past the headline. Please make sure to read the article before commenting.  Very short comments will automatically be removed by automod. Please avoid making comments that do not focus on the economic content or whose primary thesis rests on personal anecdotes. \n\nAs always our comment rules can be found [here](https://reddit.com/r/Economics/comments/fx9crj/rules_roundtable_redux_rule_vi_and_offtopic/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Economics) if you have any questions or concerns.*", "comment_date": "2024-01-25 08:32:41 UTC"}
{"submission_title": "China tightens access to offshore investment funds as domestic market flounders - Financial Times", "comment_id": "kjh8rnu", "comment_author": "AdAlarmed69", "comment_body": "***Full article***\n\nCurbs on funds that allow retail investors to bet on foreign securities come amid sell-off in Chinese equities\n\n&#x200B;\n\nChinese authorities are tightening limits on capital outflows by restricting access to funds that invest in offshore securities as the country battles a brutal market rout.About a third of Chinese funds that invest in foreign securities under a scheme that bypasses strict capital controls have announced in stock exchange notices they have suspended or capped sales to retail investors “to maintain stable operations and protect investors’ interests”.\n\n&#x200B;\n\nThe Beijing-based manager of one fund that focuses on US stocks said they had received informal instructions from the Shanghai Stock Exchange to reduce sales of such products targeting overseas markets after demand went “through the roof”.\n\nChinese authorities have repeatedly tried to halt a protracted sell-off in domestic equities over the past year, but the efforts have failed to improve battered sentiment, prompting many investors to look for higher yields elsewhere.\n\n&#x200B;\n\nThe soaring popularity among retail investors of foreign-targeted funds has raised regulator concerns about capital outflows. The Financial Times reported last August that China’s biggest fund houses were nearing government quota limits on offshore investment.The government’s Qualified Domestic Institutional Investor scheme allows banks, brokerages and asset managers to bypass China’s strict capital controls. Buying into funds offered through the QDII scheme is the only legal way for Chinese retail investors to invest in foreign stocks and bonds.\n\n&#x200B;\n\nAn increase in investor demand has caused some funds to hit their quota, while other funds have received directions from Chinese regulators to slow or in some cases stop sales of the funds.Public filings show 79 Chinese QDII funds have suspended sales to retail investors and 53 have capped them. Together, these account for about 30 per cent of all QDII funds that target non-Hong Kong overseas markets. The funds include some operated by JPMorgan Asset Management and Manulife Investment Management.\n\n&#x200B;\n\nJPMorgan did not respond to a request for comment, while Manulife declined to comment.Separately, multiple Chinese brokerages that sell funds to retail investors through the QDII scheme said on Tuesday in public filings that regulators led by the Shanghai Stock Exchange were cracking down on “abnormal trading” in exchange traded funds that invest in foreign equities.\n\n&#x200B;\n\nThe brokerages said regulators had in particular requested the suspension of transactions involving ETFs that sought to match the performance of the MSCI USA 50, Nasdaq 100 and Japan’s Nikkei 225 indices.\n\n&#x200B;\n\nThe tightly controlled QDII quotas have intensified competition for outbound investments, with such ETFs trading well above their net asset value. Beijing had a total quota of $166bn across 186 institutions for QDII investments as of the end of 2023, up only slightly since 2021.“Rocketing demand on one hand and quota restrictions on the other, the two factors both contributed to the particularly hot situation in QDII funds we are seeing right now,” said Ding Wenjie, global capital investment strategist at China Asset Management.\n\n&#x200B;\n\nDing said the appetite for funds linked to Japan’s Nikkei index had become “irrational” this month, with one trading at up to a 20 per cent premium to its asset value. Funds targeting the US and India were also popular, Ding said.\n\n&#x200B;\n\nThe China Securities Regulatory Commission and Shanghai Stock Exchange did not respond to requests for comment.Since October, market regulators have been providing private instructions — known as “window guidance” — to some investors, preventing them from being net sellers of equities on certain days.China’s benchmark CSI 300 index has fallen nearly 5 per cent since the start of 2024, continuing a rout fuelled by disappointment with government policies and lingering concerns about a slow economic rebound.", "comment_date": "2024-01-25 08:42:45 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjh8ase", "comment_author": "dingo_deano", "comment_body": "It is magic.  But seriously you have more or less answered your own question. ‘Without pulling WHOLE ceiling down’", "comment_date": "2024-01-25 08:36:57 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjh8w6t", "comment_author": "CunningStunt_1", "comment_body": "With difficulty. \n\nFor wiring between joist with no access; I cut a 100mm hole in the ceiling, drill the joist and then patch the hole with the same cut out. \n\nMillion different ways to do it. I'm sure someone here will have a potentially better method.", "comment_date": "2024-01-25 08:44:19 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjha5te", "comment_author": "curious_trashbat", "comment_body": "If there's a lot of joists to span I generally cut a strip of ceiling down running across joists, wide enough to get a drill into to drill joists.", "comment_date": "2024-01-25 09:00:15 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhbg8h", "comment_author": "geekypenguin91", "comment_body": "Fish what you can and then make a series of \"inspection\" holes where you need to go through joists etc which are then easy to patch afterwards.\n\nIf you're lucky you can get away without having to make many more than you're already making for the spotlights.\n\nSods law however and every spotlight will be right on a joist and they will all go the wrong way for fishing, resulting in needing loads of holes.", "comment_date": "2024-01-25 09:16:37 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhdxs6", "comment_author": "soundslikethunder", "comment_body": "I’ve done downlights where there’s been a void above the joists, easy peash, next to no damage to ceiling/making good. I recently did one that SO MUCH TIMBER that there were more cut outs than downlights with tons of making good (keep the cutouts, put a timber baton behind the hole, screw it in and screw the cut out to the timber, filler) \nAs long as you can prepare the customer for worst case, you won’t know til you get stuck in always, and agree on how far into making good you’ll go. \nIf you can’t navigate a joist, cut a hole either side, drill through and thread your cable through. For cut outs I use a hole saw so making good is easier as above. \nGetting all the positions even and where you want them is another adventure. It’s worth spending the time here to make sure you’ll get them all evenly spaced without hitting joists, and get customer to agree the positions before you start cutting if this isn’t the case. Retro fitting downlights is a different game to wiring for new ceilings so they have to have a bit of understanding in this instance but worth it if you can get them all even and looking the bomb", "comment_date": "2024-01-25 09:47:49 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhbqy1", "comment_author": "DepartureWhole4595", "comment_body": "You not scared about potentially hitting pipework that way?", "comment_date": "2024-01-25 09:20:23 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhbvpk", "comment_author": "DepartureWhole4595", "comment_body": "Does the same method work in stud walls?", "comment_date": "2024-01-25 09:22:02 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhe93n", "comment_author": "DepartureWhole4595", "comment_body": "Informative thanks mate", "comment_date": "2024-01-25 09:51:44 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhdf47", "comment_author": "WilsonSpark", "comment_body": "Pipe work is usually cut through the top of the joist, so you’ll miss them", "comment_date": "2024-01-25 09:41:19 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhc9fl", "comment_author": "geekypenguin91", "comment_body": "Pretty much", "comment_date": "2024-01-25 09:26:50 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh6pya", "comment_author": "_LLOSERR", "comment_body": "have you been thru TSA recently? the scanner sees fucking everything. everything. if the risk of years in prison seems worth putting coke in your ass go for it.", "comment_date": "2024-01-25 08:17:37 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh6to2", "comment_author": "Ohigetjokes", "comment_body": "Anyone who says anything is “fool proof” is an idiot.\n\nFull-body X-rays in most US airports are going to put an end to that idea real quick. Doesn’t matter if it’s a domestic flight or not - your odds of being walked through one of those is 50/50.", "comment_date": "2024-01-25 08:18:51 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh8spe", "comment_author": "bobbyvs", "comment_body": "I dunno man... the price of a ball seems like peanuts compared to getting caught smuggling it. Rip a few and toss it.", "comment_date": "2024-01-25 08:43:07 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh7986", "comment_author": "Amylynn860", "comment_body": "I snuck stuff through tsa in a compact makeup case right under the poofy thing to apply the makeup...they never found it.", "comment_date": "2024-01-25 08:24:04 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh6l85", "comment_author": "las8", "comment_body": "Put it in your carry on. Tsa is looking for bombs and guns not personal amount of drugs.", "comment_date": "2024-01-25 08:16:02 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh7zre", "comment_author": "billionaireastronaut", "comment_body": "Has nobody here smuggled drugs before? It's just for personal use simple....Cocaine does not evaporate... Water does... So pour it in a water bottle. Then when you get to wherever just pour the water into a glass and let it evaporate and only the powder cocaine will remain. Tada. And if you're that paranoid you could do it prison house style and put the Coke in water then get a brush and paint the coke water on a piece of paper then when you get to wherever you're going just smoke or eat the paper. Here's a hint for you....The Bible. Nobody's going to question your Bible. They'll be worried about a lawsuit. Or go all out, wear a priest collar and mark the water as holy water, and carry the Bible, then you got all kinds of options.", "comment_date": "2024-01-25 08:33:14 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhc8e6", "comment_author": "UnemployedMatt", "comment_body": "I’ve traveled more than 10 times by breaking up whatever I had into fine powder and buying a bottle of vitamins from the pharmacy and replacing the powder. \n\nDo it all the time.", "comment_date": "2024-01-25 09:26:27 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcgvx", "comment_author": "InvestmentNo3437", "comment_body": "It's gonna be embarrassing for you when they see it in the body scanner then start retrieving drugs from your asshole.", "comment_date": "2024-01-25 09:29:26 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh7h7f", "comment_author": "Constant-Apricot-715", "comment_body": "I'd put it in Bic pens. Generic white big hollow tube. Fill a couple full so they look the same, carry them in shirt pocket...want them on you not in luggage.", "comment_date": "2024-01-25 08:26:47 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhb818", "comment_author": "JazzlikePractice4470", "comment_body": "You'll be fine", "comment_date": "2024-01-25 09:13:42 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh9yap", "comment_author": "Hanayama99", "comment_body": "Mail it", "comment_date": "2024-01-25 08:57:35 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd1kn", "comment_author": "izucantc", "comment_body": "The punishment if you are caught is not worth the risk. Don't try it, just buy from someone local when you get to your destination. Don't get out on the no fly list lol", "comment_date": "2024-01-25 09:36:37 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhdabf", "comment_author": "throwitfarawayfromm3", "comment_body": "I'm an idiot whose never done this before. But what about a balloon In your mouth? Then take it out after. The scanners aren't xrays.", "comment_date": "2024-01-25 09:39:39 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhfbmg", "comment_author": "Thrills4Shills", "comment_body": "Just mail it to yourself  , or sell it to someone before the flight and buy more when off the flight , or next day shipping for fast service. ", "comment_date": "2024-01-25 10:05:03 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhfztf", "comment_author": "Pvnels", "comment_body": "Just snort it all, pussy", "comment_date": "2024-01-25 10:13:16 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhg84x", "comment_author": "Kahraabaa", "comment_body": "Just declare it to the tsa and you should be good to go", "comment_date": "2024-01-25 10:16:07 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh8n7s", "comment_author": "Ok-Walrus-5650", "comment_body": "I have not. Good to know", "comment_date": "2024-01-25 08:41:14 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbos9", "comment_author": "justausernamehereman", "comment_body": "I’m pretty sure you have the legal right to “opt out” of having to use that full body scanner. And then at that point they do an aggressive full body pat down and walk you through a metal detector. The pat down isn’t as aggressive as you’d think though and they’re only allowed to use the backs of their hands.\n\nAt least that’s the case the last several times I’ve flown. I didn’t have anything illegal. I just fucking hate TSA and anything to exercise what little freedom I have is worth it.", "comment_date": "2024-01-25 09:19:39 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhc86s", "comment_author": "Conwsk", "comment_body": "He actually said full proof so he's clearly not an idiot!", "comment_date": "2024-01-25 09:26:23 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh8v12", "comment_author": "Ok-Walrus-5650", "comment_body": "Probably the smart thing to do haha just gotta get myself to do it", "comment_date": "2024-01-25 08:43:55 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh935t", "comment_author": "chuckyb3", "comment_body": "Depends on the airport, I went thru Dallas recently and they had dogs sniffing all the luggage+passengers (might be bomb sniffing dogs not sure)", "comment_date": "2024-01-25 08:46:45 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh9qxl", "comment_author": "iamamoa", "comment_body": "That coke in water tip is truly a useful illegalifepro tip. Probably the most useful one I've read here and I don't even do coke.", "comment_date": "2024-01-25 08:55:00 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhav4c", "comment_author": "bobalover209", "comment_body": "You can't take liquids with you on a plane, and what about sniffer dogs?", "comment_date": "2024-01-25 09:09:11 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhalz0", "comment_author": "DTXbullrealtor_", "comment_body": "Wtffff this is $", "comment_date": "2024-01-25 09:06:00 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhc4xt", "comment_author": "justausernamehereman", "comment_body": "There’s a story of a famous smuggler who did something just like this for their first few runs.\n\nThey’d dissolve the coke into a bottle of water and then they soaked some poncho / sweater that they were wearing in the water, let it evaporate, and then when they got back over, they just got the poncho / sweater wet again, and let it dry out.\n\nHe said this is how he first moved several “matchboxes” worth of it at first before graduating to some more aggressive and creative methods.", "comment_date": "2024-01-25 09:25:15 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcouu", "comment_author": "Ok-Walrus-5650", "comment_body": "If the capsules get warm in your bag the ❄️ doesn’t clump up? Worried that a x ray would see that it’s not powder. That’s probably dumbass question lol", "comment_date": "2024-01-25 09:32:13 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd3n2", "comment_author": "Ok-Walrus-5650", "comment_body": "Exactly the answer I needed😂😂 I’m being fr too lol", "comment_date": "2024-01-25 09:37:20 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhaz65", "comment_author": "Ok-Walrus-5650", "comment_body": "There’s no precautions to catch drugs being mailed? I’m genuinely curious because I have no clue. I might do that instead, just mail it out the day of my flight", "comment_date": "2024-01-25 09:10:34 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd6z0", "comment_author": "Ok-Walrus-5650", "comment_body": "I don’t trust anyone where I’m going to not give me some laced shit. I know everything’s “laced” but laced as in shit that will kill me", "comment_date": "2024-01-25 09:38:30 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh9rox", "comment_author": "cupkake88", "comment_body": "Get a small eye shadow pallet . Pop the white out and clean it from the foil tray . Press the other white stuff in to the tray. Put other make up items with it keep in your hold luggage", "comment_date": "2024-01-25 08:55:16 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjheyar", "comment_author": "Webster_882", "comment_body": "Go get some nasal spray(you want one that actually sprays), empty it and pour some saline or similar in it and then mix your blow in. This will work, and it will be easier to use.", "comment_date": "2024-01-25 10:00:25 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhf75c", "comment_author": "Webster_882", "comment_body": "My roommate has this metal card (think CC size) and on it is the bill of rights. The rights that are violated are highlighted in red, so when they search him for it he can show them which of his rights they are violating haha", "comment_date": "2024-01-25 10:03:30 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcw09", "comment_author": "ertzrentacar", "comment_body": "I agree! I hate airport security, it’s an infringement of my freedom! \n\nI always make sure to waste everybody’s time around me just because I hate airport security so much!!!\n\nGet a grip retard", "comment_date": "2024-01-25 09:34:45 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcjsw", "comment_author": "Ok-Walrus-5650", "comment_body": "No he’s right I’m a dumbass hence why I’m asking for the best way to get ❄️ on a plane😂", "comment_date": "2024-01-25 09:30:27 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd8ap", "comment_author": "ImJettski", "comment_body": "Dissolve it into water bro, let the water evaporate and then scrape up your ❄️", "comment_date": "2024-01-25 09:38:58 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhb47l", "comment_author": "las8", "comment_body": "Re read what I said and then you'll know what kind of dogs they were.", "comment_date": "2024-01-25 09:12:20 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhe4x8", "comment_author": "Odd-Way-1168", "comment_body": "Dogs recently have been dynamically trained to smell not only bombs, but drugs and guns as well.", "comment_date": "2024-01-25 09:50:18 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbati", "comment_author": "JazzlikePractice4470", "comment_body": "Yes you can", "comment_date": "2024-01-25 09:14:41 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhczjn", "comment_author": "UnemployedMatt", "comment_body": "Make it powder. \n\nBreak down the blow. \n\nPut a dollar bill over top of all the small pieces and used a lighter to go back and forth like a rolling pin to turn the blow into a super fine powder. \n\nThey won’t clump up. \n\nAlso, if you think every TSA worker is zooming into the pills of every passenger you’re crazy. lol", "comment_date": "2024-01-25 09:35:56 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhehhb", "comment_author": "InvestmentNo3437", "comment_body": "Me too. I used to walk thru with thousands of oxys and thousands of dollars in my pockets in 09-10. Try that today. You get scanned. And you actually do have the right to refuse a scan. However, they will then place a dog by your groin and asshole. And it will start barking.", "comment_date": "2024-01-25 09:54:37 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbh33", "comment_author": "Hanayama99", "comment_body": "Ship USPS. They need a warrant to search", "comment_date": "2024-01-25 09:16:55 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhebgp", "comment_author": "Ok_Consideration584", "comment_body": "In Australia we have x-ray machines that process international and interstate mail", "comment_date": "2024-01-25 09:52:33 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhflkd", "comment_author": "Thrills4Shills", "comment_body": "Not laced stuff can kill you too , if you ain't heard", "comment_date": "2024-01-25 10:08:23 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhf310", "comment_author": "Ok-Walrus-5650", "comment_body": "Does it give you that same high and drip?", "comment_date": "2024-01-25 10:02:04 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhe1in", "comment_author": "Ok-Walrus-5650", "comment_body": "You won’t loose any ❄️ in the process? Will it affect how the blow hits after being dissolved and dried up?", "comment_date": "2024-01-25 09:49:08 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbuak", "comment_author": "bobalover209", "comment_body": "Not an entire water bottle, only a certain number of travel sized containers.", "comment_date": "2024-01-25 09:21:33 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjheiem", "comment_author": "Ok-Walrus-5650", "comment_body": "Thanks man. Never brought shit on a plane I keep schetchin myself out 😂", "comment_date": "2024-01-25 09:54:57 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhff3f", "comment_author": "Webster_882", "comment_body": "Yes to both, also I would put the coke in before saline in case you want to dilute it more or not.\nThis is how I exclusively do coke nowadays, it’s more controlled and feels SO good on the nose. You NEVER wake up to clogged sinuses either.\n\nEdit: it also absorbs faster", "comment_date": "2024-01-25 10:06:11 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhej9q", "comment_author": "ImJettski", "comment_body": "If you lose any it would be a negligible amount. The quality should stay the same once you evaporate the water and scrape it back up. You could also just drink the water if you didn’t want to go through the process of evaporating and scraping.", "comment_date": "2024-01-25 09:55:14 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbz3b", "comment_author": "JazzlikePractice4470", "comment_body": "That's all he would really need. Honestly I'd just put it in my carry on... I've traveled with dope on an airplane around 3-5 times. Last time was back in like 2010 though.", "comment_date": "2024-01-25 09:23:10 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcjko", "comment_author": "bobalover209", "comment_body": "Again, what about the sniffer dogs? I've never done it nor ever used, just see this as a hole in his plan", "comment_date": "2024-01-25 09:30:22 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcx9n", "comment_author": "JazzlikePractice4470", "comment_body": "AFAIK the dogs are there for bombs.", "comment_date": "2024-01-25 09:35:10 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd01h", "comment_author": "bobalover209", "comment_body": "Ah that would make sense", "comment_date": "2024-01-25 09:36:06 UTC"}
{"submission_title": "Domestic partner tax help?", "comment_id": "kjgvaho", "comment_author": "zffch", "comment_body": "Exactly. The law excludes the cost of employer provided insurance for yourself, your spouse, and your children from being treated as income. But it doesn't say anything about domestic partners, so the value of it is considered part of your wages and taxed accordingly. ", "comment_date": "2024-01-25 06:13:24 UTC"}
{"submission_title": "Domestic partner tax help?", "comment_id": "kjgyq58", "comment_author": "FairBarber4", "comment_body": "Thank you", "comment_date": "2024-01-25 06:48:06 UTC"}
{"submission_title": "Domestic partner tax help?", "comment_id": "kjgzagq", "comment_author": "hoyeay", "comment_body": "Just change it to spouse 😂", "comment_date": "2024-01-25 06:53:57 UTC"}
{"submission_title": "Domestic partner tax help?", "comment_id": "kjh4831", "comment_author": "FairBarber4", "comment_body": "😬", "comment_date": "2024-01-25 07:48:30 UTC"}
{"submission_title": "Canadian Home Price Drop Risks Pushing $34 Billion in Loans Underwater", "comment_id": "kjguldi", "comment_author": "JustBoatTrash", "comment_body": "https://www.investopedia.com/articles/investing/042315/fundamentals-how-canada-makes-its-money.asp\n\nCanada's economy is highly developed and one of the largest in the world. In 2022, the country's annual gross domestic product (GDP) was $2.14 trillion in current USD, according to the latest available World Bank data. That made Canada the world's ninth-largest economy", "comment_date": "2024-01-25 06:06:36 UTC"}
{"submission_title": "How much of an advantage (if any) do domestic grads have over internationals?", "comment_id": "kjgrjfa", "comment_author": "UnnervingS", "comment_body": "Many jobs will only hire citizens or PRs. The advantage is insane.", "comment_date": "2024-01-25 05:38:22 UTC"}
{"submission_title": "How much of an advantage (if any) do domestic grads have over internationals?", "comment_id": "kjgqsaz", "comment_author": "OzAnonn", "comment_body": "As long as someone doesn't struggle to communicate, being a native speaker isn't considered much of an advantage. Of course there's some variation across companies. Years ago I worked in a company where virtually every developer was Caucasian. It's hard to imagine this was a coincidence as it's actually hard to find Caucasians to hire if you tried. \n\nThere's an advantage from a visa point of view though. Especially in this market, a lot of companies might prefer citizens and PRs.", "comment_date": "2024-01-25 05:31:48 UTC"}
{"submission_title": "How much of an advantage (if any) do domestic grads have over internationals?", "comment_id": "kjh38ld", "comment_author": "ArtilleryProducer31", "comment_body": "Like the other comments, advantage is insane. I am an international student in Australia, with previous work experience. I just got rejected from a part-time software developer role, because of my visa.", "comment_date": "2024-01-25 07:37:15 UTC"}
{"submission_title": "How much of an advantage (if any) do domestic grads have over internationals?", "comment_id": "kjhe3tm", "comment_author": "Darlew", "comment_body": "I feel like it mostly depends on the hiring manager/recruiter/interviewer. An international hiring manager will naturally relate more to an international candidate and the inverse is true for natives. As much as people will try to tell you that proficiency and expertise is the most important factor, personality and connection with the interviewer is way up there too.", "comment_date": "2024-01-25 09:49:54 UTC"}
{"submission_title": "How much of an advantage (if any) do domestic grads have over internationals?", "comment_id": "kjh8ddn", "comment_author": "hypermeowmeow", "comment_body": "Damn pal, I don't know if you are kidding or not. As an international student here, I must say it's almost like an impossible game. \n\nIf you try going on Prosple AU and filter visa rights, I think the job listings would just halve :(", "comment_date": "2024-01-25 08:37:50 UTC"}
{"submission_title": "How much of an advantage (if any) do domestic grads have over internationals?", "comment_id": "kjgw52r", "comment_author": "theleveragedsellout", "comment_body": "Yeah was going to say, there’s basically no pathway for firms to hire international graduates with the exception of a few very limited circumstances.", "comment_date": "2024-01-25 06:21:43 UTC"}
{"submission_title": "How much of an advantage (if any) do domestic grads have over internationals?", "comment_id": "kjh657u", "comment_author": "andrew1677", "comment_body": "I got few hundred rejection before landing a retail job.  Not saying a cs job.", "comment_date": "2024-01-25 08:10:44 UTC"}
{"submission_title": "How much of an advantage (if any) do domestic grads have over internationals?", "comment_id": "kjgwoa8", "comment_author": "bilby2020", "comment_body": "Not exactly true. There are exemptions like for Indian students.\n\nhttps://www.afr.com/politics/federal/indian-students-given-exemption-to-work-in-australia-20231214-p5erej", "comment_date": "2024-01-25 06:27:04 UTC"}
{"submission_title": "Flying international", "comment_id": "kjgt9zv", "comment_author": "dr-swordfish", "comment_body": "1. tsa screening is the same for domestic and international. \n2. upon returning to the US you'll go through customs screening. \n3. You are giving consent to a pat down if you enter a checkpoint. The pat downs you may receive are not as invasive as many people make it seem. Any sensitive areas are done with the back of the hands (less nerve endings) by same gender only. Usually are targeted to a small portion of the body. And only take a few seconds to complete. \n4. Keep in mind we're not doing it to find drugs, we're doing it so the plane you get on actually makes it to the destination.", "comment_date": "2024-01-25 05:54:06 UTC"}
{"submission_title": "After an argument, my [31f] live-in boyfriend [33m] wants days of space – seeking advice on how to approach this?", "comment_id": "kjgwsx2", "comment_author": "RSTA30", "comment_body": "Crate training is bullshit. It's no better than how scumbags will put a dog on a short chain and leave it alone in their yard, so I am completely on your boyfriends side on that one. \n\nThe dog is acting up because it is starved for attention from being left alone so often. The last thing that will help is isolating it even more by locking it in a box. They are pack animals and don't do well alone. That's the entire reason we were able to domesticate them.\n\n\nFind a trainer who isn't a proponent of abusing animals. And stop pushing for him to abuse his dog just because some idiot told you to. I will bet your fights over this will magically come to an end.", "comment_date": "2024-01-25 06:28:23 UTC"}
{"submission_title": "Just discovered my cat may be a Nebelung?", "comment_id": "kjgl0ky", "comment_author": "AutoModerator", "comment_body": "Thank you for sharing your kitty with us! If you haven't already done so, please take a minute to watch the video and explore the links below. If other Redditors identify your cat as a dilute tortie, standard issue cat, calico, tuxedo, or something else, your post may be removed in order to help keep this sub focused on Nebbies. Please note that Nebelungs must be solid gray. (An allowance is made for a small white patch/locket on the chest.)\n\nAnimal Planet: Cats 101 - Nebelung: \n\nhttps://www.youtube.com/watch?v=2aDwFMEJ0W8\n\nInformation from The International Cat Association (TICA), the world's largest genetic registry of pedigreed and domestic cats.\n\n[About the Nebelung Breed](https://www.tica.org/breeds/browse-all-breeds?view=article&id=1663:the-nebelung-breed&catid=48)\n\n[Nebelung Breed Standards](https://www.tica.org/phocadownload/nb.pdf)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nebelung) if you have any questions or concerns.*", "comment_date": "2024-01-25 04:43:52 UTC"}
{"submission_title": "Just discovered my cat may be a Nebelung?", "comment_id": "kjgo55w", "comment_author": "Keeyawn", "comment_body": "Oh wow I just read that the first ones' mom was a black domestic!", "comment_date": "2024-01-25 05:09:14 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjgmw6o", "comment_author": "Wolfe_Hunter_VII", "comment_body": "Which state?", "comment_date": "2024-01-25 04:58:55 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjgngf2", "comment_author": "New-Connection7198", "comment_body": "Got two vials of test e took about 4 days im from the gold coast\n\nand it was the real deal", "comment_date": "2024-01-25 05:03:33 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjgov34", "comment_author": "Zerkxerd", "comment_body": "these guys are good I fucking couldn’t find anyone didn’t take to long", "comment_date": "2024-01-25 05:15:19 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjgn1ui", "comment_author": "DomesticGearAUS", "comment_body": "Warehouse In Perth, where you from I can estimate shipping.", "comment_date": "2024-01-25 05:00:13 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjgqwy4", "comment_author": "Wolfe_Hunter_VII", "comment_body": "Melbourne, but it’s always a risk crossing state lines - had my shit confiscated before", "comment_date": "2024-01-25 05:32:57 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjgw3xt", "comment_author": "DomesticGearAUS", "comment_body": "Probably shitty packaging. Just msg me,", "comment_date": "2024-01-25 06:21:24 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjgldyw", "comment_author": "jettTopg", "comment_body": "Yeah good supplier took about 6 days didn’t even get express pretty pricey but you get what you pay for tbh", "comment_date": "2024-01-25 04:46:50 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjgy0ij", "comment_author": "selectedsteroidvip1", "comment_body": "The raw materials are produced in China, and most of the world's steroids are exported from China.", "comment_date": "2024-01-25 06:40:40 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjh7cqa", "comment_author": "DomesticGearAUS", "comment_body": "Yeah your right but all our stock is at our warehouse in Australia.", "comment_date": "2024-01-25 08:25:16 UTC"}
{"submission_title": "Economics - Exchange rates doubt", "comment_id": "kjgliek", "comment_author": "None", "comment_body": "Domestic is listed first as the quoted currency; foreign is listed second as the base.", "comment_date": "2024-01-25 04:47:49 UTC"}
{"submission_title": "Economics - Exchange rates doubt", "comment_id": "kjgr4ch", "comment_author": "Difficult-Chard-7452", "comment_body": "But conventionally wouldn't domestic currency be your base currency? Thats what level 1 materials said anyway. Is it because we are finding real rates?", "comment_date": "2024-01-25 05:34:46 UTC"}
{"submission_title": "My mother is stalking me but I still live with her. This is actually domestic abuse under California law.", "comment_id": "kjgog8q", "comment_author": "visitor987", "comment_body": "You just move out of state you mother cannot stop you.\n\nHere are some job ideas the last one sometimes has housing. This pays well the US Post Office is hiring note it sometimes takes feds three months to hire someone. https://about.usps.com/careers/welcome.htm Take the test and apply for jobs anywhere in USA.\r  \n\r  \nAmtrak is hiring https://careers.amtrak.com/  Jobs exist in most states.\r  \n\r  \nUS Forest service is hiring https://www.fs.usda.gov/working-with-us/jobs \r  \n\r  \nThese also pay well you may not qualify for all of them https://www.fool.com/slideshow/not-many-people-want-these-jobs-and-s-why-they-pay-well/\r  \n50 jobs over $50,000 without college https://www.mrmoneymustache.com/2013/07/25/50-jobs-over-50000-without-a-degree-part-1/ \r  \n\r  \nFederal civil service jobs https://www.usajobs.gov/Search?p=1 \r  \n\r  \nLook into Concessioners for the National Park service. The jobs include fields of Lodging; Campgrounds; Food Service Operations; Guide Services and Outfitters. The jobs SOMETIMES include HOUSING in more remote areas like Montana, New Mexico, Wyoming, Grand Canyon, etc. Some jobs are summer or winter only, others are all year long in one location or you may be able transfer between locations to work year-round. Use this link & enter the name of the park you wish to be employed at https://www.nps.gov/subjects/concessions/authorized-concessioners.htm Contact each concessioner directly by Googling the company name to apply. This link will let you look up parks by state https://www.nps.gov/index.htm not every park has a concessioner.", "comment_date": "2024-01-25 05:11:50 UTC"}
{"submission_title": "Mistakenly opened up a \"Domestic Business Corporation\" and need to close it but am lost. I have to file taxes and mark it as my last return but I have no clue how to even start to file taxes for it?", "comment_id": "kjgjeby", "comment_author": "AutoModerator", "comment_body": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "comment_date": "2024-01-25 04:31:22 UTC"}
{"submission_title": "Can any wild mammal be domesticated if done in a controlled environment?", "comment_id": "kjgx729", "comment_author": "InternationalClick78", "comment_body": "Probably not. Domestication requires specific traits that not all animals have. Zebras are a great example of this due to their social structures", "comment_date": "2024-01-25 06:32:22 UTC"}
{"submission_title": "Can any wild mammal be domesticated if done in a controlled environment?", "comment_id": "kjgi4zu", "comment_author": "lewisiarediviva", "comment_body": "Probably, maybe. If you selectively breed long enough you’ll get differences. Whether they’re adequate to be considered ‘domesticated’ will be up for debate. Depends on the fundamental limits of social behavior for the species.", "comment_date": "2024-01-25 04:21:52 UTC"}
{"submission_title": "Can any wild mammal be domesticated if done in a controlled environment?", "comment_id": "kjgkl7w", "comment_author": "hilmiira", "comment_body": "I mean yeah, domestication is just animals adapting to humans and house life.\n\nAll creatures can be domesticated, some better some worse.", "comment_date": "2024-01-25 04:40:33 UTC"}
{"submission_title": "Can any wild mammal be domesticated if done in a controlled environment?", "comment_id": "kjgmv2y", "comment_author": "quiveringcoconut", "comment_body": "Another off the wall thought -- would you be able to somehow determine if a wild animal was at some point domesticated and, for whatever reason, went back to being wild? How could we tell", "comment_date": "2024-01-25 04:58:40 UTC"}
{"submission_title": "Can any wild mammal be domesticated if done in a controlled environment?", "comment_id": "kjgxos9", "comment_author": "RainCoatDuckling", "comment_body": "While we have more options thanks to current technology than when we first domesticated animals, some animals would be easier to domestic than others. And it still will take lots of time, money, and resources to change animals enough to be considered domesticated.\n\nCpg grey on yt has a good video on it.\n\nhttps://youtu.be/wOmjnioNulo?si=SKRn0KFwmsjElt4i", "comment_date": "2024-01-25 06:37:21 UTC"}
{"submission_title": "Can any wild mammal be domesticated if done in a controlled environment?", "comment_id": "kjgirnn", "comment_author": "quiveringcoconut", "comment_body": "Why hasn't anyone tried to fund research like this? It'd give a better understanding as to the origins and tactics used in humanities first endeavors into the realm of wildlife domestication.", "comment_date": "2024-01-25 04:26:34 UTC"}
{"submission_title": "Can any wild mammal be domesticated if done in a controlled environment?", "comment_id": "kjh2qbu", "comment_author": "RainCoatDuckling", "comment_body": "So, I'm not sure what your level of knowledge is. Please forgive me if I explain something you already know.\n\nTo answer your question, we can tell if an animal is domesticated, feral, wild, or tamed.\n\nBeing domesticated means that an animal's ancestors have gone through genetic change to become a different animal, thanks to the efforts of humans. This takes literally hundreds of generations.\n\n A wild animal cannot be domesticated. It can be tamed and can trust, or at least not fear humans. Elephants and deer are tamed often. But they have not been genetically altered through breeding to be useful to us.\n\nA domesticated animal can become feral, like wild mustangs or street dogs. They might fear or mistrust humans, but their ancestors were still genetically altered by human controlled breeding.\n\nThink about it this way. If you're a caveman, and your caveman family finds two wolf pups. You keep them because theyre cute and you would naturally give treats and attention to the wolf pup that was friendlier to you. This creates artificial pressure on the wolf pups genes. Wolves that have calmer personalities are more likely to be rewarded by their adopted human family. They get more food, making them healthier, making them more likely to successfully have more wolf pups. With these new wolf pups, the cycle starts again. Maybe one pup is protective of your family. Maybe he fights a bear off or is the best hunter. You'll definitely want to give him lots of treats for being a good boy. So now this wolf, with his calmer and more loyal genes, benefits from being calmer and loyal thanks to human intervention. And the cycle continues until you have friendly and loyal dogs. The dogs are well fed and can eat cooked scraps, which are easier to digest.\n\nSince we're changing the way evolution pressures domesticated animals, they are able to survive without following the 'dress code'. An albino deer is very rare in the wild because its white coat is bad for camouflage. It will also have bad eyesight and probably will not act as wary around predators as other deer, since it can't see them. But we can find lots of albino animals in captivity, even ones that aren't domesticated, but tamed. Because in captivity, predators will not eat it and mother animals will not abandon odd looking offspring. ( They need to save energy to grow offspring that will actually survive). So we are removing the penalties for not following 'the rules' . \n\nThink about how a dog is different from a wolf. They might have floppy ears, long coats, short or tall, squashed face or long snouts. These traits do not help the dog survive in the wild, but since humans control their 'ecosystem' now. They don't have to follow the 'dresscode'. A dashund can have stubby legs that are useless for hunting elk. It doesn't matter. humans will use them to down rabbit dens, guaranteeing the dog a meal. A wolf who can only hunt rabbit will starve if there is a die off of the rabbits population. A mastiff doesn't have to worry about finding enough food for it's huge body when there's a famine. A husky doesn't have to worry about overheating when it's coat is too fluffy. Chihuahuas don't have to worry about getting eaten by a hawk.\n\nSince domesticated animals usually don't follow the 'dresscode', we can tell if an animal is feral/wild/tamed depending on it's looks and behaviors. Even wolf/dog hybrids have signs, and they're very close genetically. You can look at the slope of their foreheads and if they have dewclaws, etc.\n\nHumans using our giant brains are basically able to cheat the system. We can build ropes and fences to control animal movements. We know what the animal eats and what's bad for it, ensuring our animals are healthy and have healthier babies. We live a long time, so we can, over time, choose which animals we like best and select for that trait. The things we don't like, we can cull out. Either through eating or removing it from our selected gene pool.\n\nSorry for ramble. Hope you find this interesting. Try looking up a vid on the russian silver fox breeding experiment. They were trying to select for calmer foxes to see what would happen. They also did the opposite and bred a bunch of mean ones by selecting the jerk foxes lol.", "comment_date": "2024-01-25 07:31:33 UTC"}
{"submission_title": "Can any wild mammal be domesticated if done in a controlled environment?", "comment_id": "kjgixmk", "comment_author": "lewisiarediviva", "comment_body": "They have, and are. Quite famous ongoing experiment in Russia that resulted in the ‘domesticated silver fox’.", "comment_date": "2024-01-25 04:27:49 UTC"}
{"submission_title": "Suggest me to buy espresso machine.", "comment_id": "kjh303k", "comment_author": "Aside_Electrical", "comment_body": "You may not be legally permitted to use a domestic machine because it may not have the required certifications.", "comment_date": "2024-01-25 07:34:39 UTC"}
{"submission_title": "Why PBR?", "comment_id": "kjgbomj", "comment_author": "ananthropolothology", "comment_body": "For a while it was really the cheapest domestic, and you could get it in tallboys at the bar. Chicago has Hamm's and Old Style, Seattle has Olympia and Ranier, Baltimore has Natty Boh, etc (though some of those are brewed locally). Every city has their go-to cheap beer, PBR just somehow became the option for here.", "comment_date": "2024-01-25 03:36:22 UTC"}
{"submission_title": "A: Oh not, that is not a mating display, you - em it seems that you triggered their domestication instinct.", "comment_id": "kjg9mls", "comment_author": "AutoModerator", "comment_body": "In an attempt to reduce remind me spam, all top comments that include a remind me will be removed. If you would like to have a remind me, please reply to this comment. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/humansarespaceorcs) if you have any questions or concerns.*", "comment_date": "2024-01-25 03:22:34 UTC"}
{"submission_title": "A: Oh not, that is not a mating display, you - em it seems that you triggered their domestication instinct.", "comment_id": "kjgfeg2", "comment_author": "OSadorn", "comment_body": "\"This is their domestication instinct?\" I asked with an alert tone, pinned down by a being that I thought wouldn't be a household pet or similar.\n\nThe lithe, mouthless enigma of a sapient who watched the situation elaborated again as if I didn't hear.\n\nI then spoke at them with panic! \"If this isn't a 'mating display' then WHAT IS?!\"\n\nThe creature who had effectively dropped its weight at me was now trying to rub themselves onto me like a non-cringe-inducing scent application method.\n\nFor 'urban wildlife' these beings are a near-identical to some of the creative half-monsters we've imagined.\n\nAnd this guy thinks I'd make a good handler?\n\nI feel like the reverse is more likely. I decide to tease the creature's uncannily humane face with a slight kiss.\n\nThat drew them to pulling me up into a hug and leaning back, almost plexing me into an upright posture while I returned the favour.\n\nWe then danced in circles around eachother for a bit, never letting go.\n\nThe mouthless observer of a 'friend' nodded as the dancing slowed to a stop and we butted heads. He told me this - \"You are bonded... It's the first time I've seen her kind do this ritual with a human.\"\n\nHold on. Repeat that again. What?\n\nI think that but it seems I've spilled something. The observer curtly nods and then just leaves me and this... domesticated companion.\n\nIn my room.\n\nBy all that is holy-\n\n...More cuddling. My eyes are lidded, tired. She's ruffling my hair now and is actually whispering legible words, but I am-\n\nI flop onto the bed. She follows.\n\n\\- - - The next few days were a blur, redacted for dignity.\n\nThe 'friend' of mine has returned with a myriad of other beings. Apparently from the local animal shelter.\n\nHe claims my kind are a nebulous legal grey-zone where we cannot be classed as 'companions' or 'pets' because we can space and things but this one...\n\nHer kind have bamboozled the Orion-colonial Protoss. Why haven't they noticed?", "comment_date": "2024-01-25 04:01:58 UTC"}
{"submission_title": "A: Oh not, that is not a mating display, you - em it seems that you triggered their domestication instinct.", "comment_id": "kjgd50g", "comment_author": "A_normal_storyteller", "comment_body": "\"How come?\"\n\nNate looked back, while holding the red shirt in front of the slime-covered tadpole-like creature, while at the same time holding the small insectoid on his other hand, he seemed confused and rightfully so, since the amphibian kept making loud noises, oddly similar to a mix of both, chirping and crying.\n\n\"Yes, that thing is a female amphibiaganax, a young one on top of that, those creatures were the bane of our species long ago, they used to prey on our cattle after all, also, the slime is a Gluesterax, a symbiotic colonial organism, it acts a bit like that one character of retro terran movies\"\n\n\"What?, I may be a human but i'm not a movie nerd like you Lisa, I really don't know what are you talking about\"\n\n\"The thing, that creature from that horror movie Dad used to watch every october\"\n\n\"Lisa... bring me my flamm...\"\n\n\"NO, come on big brother, don't go full murderape on these two, I told you they are being tamed as we speak, didn't I?\"\n\n\"You told me I triggered their domestication instinct, and from what I remember that thing doesn't even exists!\"\n\n\"We are pretty much creating it, specially if you keep waving that blue shirt in front of them!\"\n\n\"Lisa, this shirt is red, also, how come this thing is causing them to... emmm, chirping-crying?, Cryping?, Chirying?\"\n\n\"For the last time brother, you were bitten by a colour scorpion, your eyes are tricking you into believe that some stuff has different colours, that is how the scorpion leads its prey back to its nest!\"\n\n\"Yeah, but I pummeled the motherfucker to the ground with my AK-47, so shut up and give me my flamm...!\"\n\n\"LISTEN UP YOU MURDER APE, THESE THINGS ACT LIKE DOGGOS ONCE THEY ARE DOMESTICATED!\"\n\nIn an split of a second, the small insectoid was sent flying as Nate fell to his knees focusing  on the gigantic tadpole, then, after a few seconds, the creature let out the single most horrible purr one could ever expect...\n\n\"Ohhhh, you are right Lisa, this big baby sounds just like Matilda!, I'm sure they will get along extremely well!\"\n\n\"Puaj, you had to throw me right into the feces?\" The insect flew up from a pile of mud and purple sphere shaped rocks \"And... you are right... the call of that thing really mirrors Matilda's...\"\n\n\"Oh, you are so smooth!, Who's a good girl?, Who's a good girl?\"\n\nNate pulled up the tadpole before sitting on the floor letting the creature rest on his lap, the horrible purring kept going, as if some sort of stray monster had found its way inside a cave, and yet, Nate couldn't be happier hearing it.\n\nThe slime began to coat Nate's arms, as it slowly but surely divided into two halves, one remaining with the tadpole, while the other began to solidify into a crystaline structure, resembling crystal claws, forming a protective coat all over the lenght of his arms.\n\n\"Uh,, neat, you just bonded with the slime, so, big brother, want me to call Matilda to get us to the ship?\"\n\n\"Yeah, I'm sure she will love these two fellas... hey, no biting!\" Nate groaned as he felt the tadpole bite his knee, surprisingly, the creature had three rows of teeth, each one looking more and more like broken glass rather than healthy teeth. \"Alright, Matilda should be here any second bro, also don't forget to take our new pet to the vet\"\n\n\"Thanks sis, What do you think that Mom made for dinner?\"\n\n\"Most likely she just boiled something barely organic, again, as she always do\"\n\nBoth giggled as a giant reptile, with four limbs, a pair of tails and four sets of wings began descending as fast as sound towards them, on its neck an small collar with the name \"Matilda, the big red dragoness\"...\n\n\n\n\n\n\n\n  \n(Disclaimer: written in less than five minutes, and felt way too lazy to edit it properly)", "comment_date": "2024-01-25 03:46:12 UTC"}
{"submission_title": "Can I fly domestically on a pending green card case through marriage?", "comment_id": "kjhfmvg", "comment_author": "AutoModerator", "comment_body": "Hi there! This is an automated message to inform you and/or remind you of several things: \n\n- We have [a wiki](https://www.reddit.com/r/USCIS/wiki/index). It doesn't cover everything but may answer some questions. Pay special attention to the \"[REALLY common questions](https://www.reddit.com/r/USCIS/wiki/index/vfaq)\" at the top of the FAQ section. Please read it, and if it contains the answer to your question, please delete your post. If your post has to do with something covered in the FAQ, we may remove it.\n- If your post is about biometrics, green cards, naturalization or timelines in general, and whether you're asking or sharing, please include your field office/location in your post. If you already did that, great, thank you! If you haven't done that, your post may be removed without notice.\n- This subreddit is not affiliated with USCIS or the US government in any way. Some posters may claim to work for USCIS, which may or may not be true, and we don't try to verify this one way or another. Be wary that it may be a scam if anyone is asking you for personal info, or sending you a direct message, or asking that you send them a direct message.\n- Some people here claim to be lawyers, but they are not YOUR lawyer. No advice found here should be construed as legal advice. Reddit is not a substitute for a real lawyer. If you need help finding legal services, visit [this link](https://www.uscis.gov/avoid-scams/find-legal-services) for more information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/USCIS) if you have any questions or concerns.*", "comment_date": "2024-01-25 10:08:51 UTC"}
{"submission_title": "McDonald's has a major impact on the U.S. economy, generating $108b in gross domestic product a year. 1 in 8 Americans have worked at McDonald's at some point in their lives.", "comment_id": "kjhcfng", "comment_author": "AutoModerator", "comment_body": "Welcome to our community [r/paydayloan_online/](https://www.reddit.com/r/paydayloan_online/) and Thank you for your submission!  If you are looking for a payday loan, make sure you read this post [Unlock Your financial Freedom with payday loan](https://www.reddit.com/r/paydayloan_online/comments/19eecly/unlock_your_financial_freedom_with_payday_loans/) right now.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/paydayloan_online) if you have any questions or concerns.*", "comment_date": "2024-01-25 09:29:00 UTC"}
{"submission_title": "China tightens access to offshore investment funds as domestic market flounders - Financial Times", "comment_id": "kjh7y82", "comment_author": "AutoModerator", "comment_body": "Hi all,\n\nA reminder that comments do need to be on-topic and engage with the article past the headline. Please make sure to read the article before commenting.  Very short comments will automatically be removed by automod. Please avoid making comments that do not focus on the economic content or whose primary thesis rests on personal anecdotes. \n\nAs always our comment rules can be found [here](https://reddit.com/r/Economics/comments/fx9crj/rules_roundtable_redux_rule_vi_and_offtopic/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Economics) if you have any questions or concerns.*", "comment_date": "2024-01-25 08:32:41 UTC"}
{"submission_title": "China tightens access to offshore investment funds as domestic market flounders - Financial Times", "comment_id": "kjh8rnu", "comment_author": "AdAlarmed69", "comment_body": "***Full article***\n\nCurbs on funds that allow retail investors to bet on foreign securities come amid sell-off in Chinese equities\n\n&#x200B;\n\nChinese authorities are tightening limits on capital outflows by restricting access to funds that invest in offshore securities as the country battles a brutal market rout.About a third of Chinese funds that invest in foreign securities under a scheme that bypasses strict capital controls have announced in stock exchange notices they have suspended or capped sales to retail investors “to maintain stable operations and protect investors’ interests”.\n\n&#x200B;\n\nThe Beijing-based manager of one fund that focuses on US stocks said they had received informal instructions from the Shanghai Stock Exchange to reduce sales of such products targeting overseas markets after demand went “through the roof”.\n\nChinese authorities have repeatedly tried to halt a protracted sell-off in domestic equities over the past year, but the efforts have failed to improve battered sentiment, prompting many investors to look for higher yields elsewhere.\n\n&#x200B;\n\nThe soaring popularity among retail investors of foreign-targeted funds has raised regulator concerns about capital outflows. The Financial Times reported last August that China’s biggest fund houses were nearing government quota limits on offshore investment.The government’s Qualified Domestic Institutional Investor scheme allows banks, brokerages and asset managers to bypass China’s strict capital controls. Buying into funds offered through the QDII scheme is the only legal way for Chinese retail investors to invest in foreign stocks and bonds.\n\n&#x200B;\n\nAn increase in investor demand has caused some funds to hit their quota, while other funds have received directions from Chinese regulators to slow or in some cases stop sales of the funds.Public filings show 79 Chinese QDII funds have suspended sales to retail investors and 53 have capped them. Together, these account for about 30 per cent of all QDII funds that target non-Hong Kong overseas markets. The funds include some operated by JPMorgan Asset Management and Manulife Investment Management.\n\n&#x200B;\n\nJPMorgan did not respond to a request for comment, while Manulife declined to comment.Separately, multiple Chinese brokerages that sell funds to retail investors through the QDII scheme said on Tuesday in public filings that regulators led by the Shanghai Stock Exchange were cracking down on “abnormal trading” in exchange traded funds that invest in foreign equities.\n\n&#x200B;\n\nThe brokerages said regulators had in particular requested the suspension of transactions involving ETFs that sought to match the performance of the MSCI USA 50, Nasdaq 100 and Japan’s Nikkei 225 indices.\n\n&#x200B;\n\nThe tightly controlled QDII quotas have intensified competition for outbound investments, with such ETFs trading well above their net asset value. Beijing had a total quota of $166bn across 186 institutions for QDII investments as of the end of 2023, up only slightly since 2021.“Rocketing demand on one hand and quota restrictions on the other, the two factors both contributed to the particularly hot situation in QDII funds we are seeing right now,” said Ding Wenjie, global capital investment strategist at China Asset Management.\n\n&#x200B;\n\nDing said the appetite for funds linked to Japan’s Nikkei index had become “irrational” this month, with one trading at up to a 20 per cent premium to its asset value. Funds targeting the US and India were also popular, Ding said.\n\n&#x200B;\n\nThe China Securities Regulatory Commission and Shanghai Stock Exchange did not respond to requests for comment.Since October, market regulators have been providing private instructions — known as “window guidance” — to some investors, preventing them from being net sellers of equities on certain days.China’s benchmark CSI 300 index has fallen nearly 5 per cent since the start of 2024, continuing a rout fuelled by disappointment with government policies and lingering concerns about a slow economic rebound.", "comment_date": "2024-01-25 08:42:45 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjh8ase", "comment_author": "dingo_deano", "comment_body": "It is magic.  But seriously you have more or less answered your own question. ‘Without pulling WHOLE ceiling down’", "comment_date": "2024-01-25 08:36:57 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjh8w6t", "comment_author": "CunningStunt_1", "comment_body": "With difficulty. \n\nFor wiring between joist with no access; I cut a 100mm hole in the ceiling, drill the joist and then patch the hole with the same cut out. \n\nMillion different ways to do it. I'm sure someone here will have a potentially better method.", "comment_date": "2024-01-25 08:44:19 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjha5te", "comment_author": "curious_trashbat", "comment_body": "If there's a lot of joists to span I generally cut a strip of ceiling down running across joists, wide enough to get a drill into to drill joists.", "comment_date": "2024-01-25 09:00:15 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhbg8h", "comment_author": "geekypenguin91", "comment_body": "Fish what you can and then make a series of \"inspection\" holes where you need to go through joists etc which are then easy to patch afterwards.\n\nIf you're lucky you can get away without having to make many more than you're already making for the spotlights.\n\nSods law however and every spotlight will be right on a joist and they will all go the wrong way for fishing, resulting in needing loads of holes.", "comment_date": "2024-01-25 09:16:37 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhdxs6", "comment_author": "soundslikethunder", "comment_body": "I’ve done downlights where there’s been a void above the joists, easy peash, next to no damage to ceiling/making good. I recently did one that SO MUCH TIMBER that there were more cut outs than downlights with tons of making good (keep the cutouts, put a timber baton behind the hole, screw it in and screw the cut out to the timber, filler) \nAs long as you can prepare the customer for worst case, you won’t know til you get stuck in always, and agree on how far into making good you’ll go. \nIf you can’t navigate a joist, cut a hole either side, drill through and thread your cable through. For cut outs I use a hole saw so making good is easier as above. \nGetting all the positions even and where you want them is another adventure. It’s worth spending the time here to make sure you’ll get them all evenly spaced without hitting joists, and get customer to agree the positions before you start cutting if this isn’t the case. Retro fitting downlights is a different game to wiring for new ceilings so they have to have a bit of understanding in this instance but worth it if you can get them all even and looking the bomb", "comment_date": "2024-01-25 09:47:49 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhbqy1", "comment_author": "DepartureWhole4595", "comment_body": "You not scared about potentially hitting pipework that way?", "comment_date": "2024-01-25 09:20:23 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhbvpk", "comment_author": "DepartureWhole4595", "comment_body": "Does the same method work in stud walls?", "comment_date": "2024-01-25 09:22:02 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhe93n", "comment_author": "DepartureWhole4595", "comment_body": "Informative thanks mate", "comment_date": "2024-01-25 09:51:44 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhdf47", "comment_author": "WilsonSpark", "comment_body": "Pipe work is usually cut through the top of the joist, so you’ll miss them", "comment_date": "2024-01-25 09:41:19 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhc9fl", "comment_author": "geekypenguin91", "comment_body": "Pretty much", "comment_date": "2024-01-25 09:26:50 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh6pya", "comment_author": "_LLOSERR", "comment_body": "have you been thru TSA recently? the scanner sees fucking everything. everything. if the risk of years in prison seems worth putting coke in your ass go for it.", "comment_date": "2024-01-25 08:17:37 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh6to2", "comment_author": "Ohigetjokes", "comment_body": "Anyone who says anything is “fool proof” is an idiot.\n\nFull-body X-rays in most US airports are going to put an end to that idea real quick. Doesn’t matter if it’s a domestic flight or not - your odds of being walked through one of those is 50/50.", "comment_date": "2024-01-25 08:18:51 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh8spe", "comment_author": "bobbyvs", "comment_body": "I dunno man... the price of a ball seems like peanuts compared to getting caught smuggling it. Rip a few and toss it.", "comment_date": "2024-01-25 08:43:07 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh7986", "comment_author": "Amylynn860", "comment_body": "I snuck stuff through tsa in a compact makeup case right under the poofy thing to apply the makeup...they never found it.", "comment_date": "2024-01-25 08:24:04 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh6l85", "comment_author": "las8", "comment_body": "Put it in your carry on. Tsa is looking for bombs and guns not personal amount of drugs.", "comment_date": "2024-01-25 08:16:02 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh7zre", "comment_author": "billionaireastronaut", "comment_body": "Has nobody here smuggled drugs before? It's just for personal use simple....Cocaine does not evaporate... Water does... So pour it in a water bottle. Then when you get to wherever just pour the water into a glass and let it evaporate and only the powder cocaine will remain. Tada. And if you're that paranoid you could do it prison house style and put the Coke in water then get a brush and paint the coke water on a piece of paper then when you get to wherever you're going just smoke or eat the paper. Here's a hint for you....The Bible. Nobody's going to question your Bible. They'll be worried about a lawsuit. Or go all out, wear a priest collar and mark the water as holy water, and carry the Bible, then you got all kinds of options.", "comment_date": "2024-01-25 08:33:14 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhc8e6", "comment_author": "UnemployedMatt", "comment_body": "I’ve traveled more than 10 times by breaking up whatever I had into fine powder and buying a bottle of vitamins from the pharmacy and replacing the powder. \n\nDo it all the time.", "comment_date": "2024-01-25 09:26:27 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcgvx", "comment_author": "InvestmentNo3437", "comment_body": "It's gonna be embarrassing for you when they see it in the body scanner then start retrieving drugs from your asshole.", "comment_date": "2024-01-25 09:29:26 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh7h7f", "comment_author": "Constant-Apricot-715", "comment_body": "I'd put it in Bic pens. Generic white big hollow tube. Fill a couple full so they look the same, carry them in shirt pocket...want them on you not in luggage.", "comment_date": "2024-01-25 08:26:47 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhb818", "comment_author": "JazzlikePractice4470", "comment_body": "You'll be fine", "comment_date": "2024-01-25 09:13:42 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh9yap", "comment_author": "Hanayama99", "comment_body": "Mail it", "comment_date": "2024-01-25 08:57:35 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd1kn", "comment_author": "izucantc", "comment_body": "The punishment if you are caught is not worth the risk. Don't try it, just buy from someone local when you get to your destination. Don't get out on the no fly list lol", "comment_date": "2024-01-25 09:36:37 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhdabf", "comment_author": "throwitfarawayfromm3", "comment_body": "I'm an idiot whose never done this before. But what about a balloon In your mouth? Then take it out after. The scanners aren't xrays.", "comment_date": "2024-01-25 09:39:39 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhfbmg", "comment_author": "Thrills4Shills", "comment_body": "Just mail it to yourself  , or sell it to someone before the flight and buy more when off the flight , or next day shipping for fast service. ", "comment_date": "2024-01-25 10:05:03 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhfztf", "comment_author": "Pvnels", "comment_body": "Just snort it all, pussy", "comment_date": "2024-01-25 10:13:16 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhg84x", "comment_author": "Kahraabaa", "comment_body": "Just declare it to the tsa and you should be good to go", "comment_date": "2024-01-25 10:16:07 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh8n7s", "comment_author": "Ok-Walrus-5650", "comment_body": "I have not. Good to know", "comment_date": "2024-01-25 08:41:14 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbos9", "comment_author": "justausernamehereman", "comment_body": "I’m pretty sure you have the legal right to “opt out” of having to use that full body scanner. And then at that point they do an aggressive full body pat down and walk you through a metal detector. The pat down isn’t as aggressive as you’d think though and they’re only allowed to use the backs of their hands.\n\nAt least that’s the case the last several times I’ve flown. I didn’t have anything illegal. I just fucking hate TSA and anything to exercise what little freedom I have is worth it.", "comment_date": "2024-01-25 09:19:39 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhc86s", "comment_author": "Conwsk", "comment_body": "He actually said full proof so he's clearly not an idiot!", "comment_date": "2024-01-25 09:26:23 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh8v12", "comment_author": "Ok-Walrus-5650", "comment_body": "Probably the smart thing to do haha just gotta get myself to do it", "comment_date": "2024-01-25 08:43:55 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh935t", "comment_author": "chuckyb3", "comment_body": "Depends on the airport, I went thru Dallas recently and they had dogs sniffing all the luggage+passengers (might be bomb sniffing dogs not sure)", "comment_date": "2024-01-25 08:46:45 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh9qxl", "comment_author": "iamamoa", "comment_body": "That coke in water tip is truly a useful illegalifepro tip. Probably the most useful one I've read here and I don't even do coke.", "comment_date": "2024-01-25 08:55:00 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhav4c", "comment_author": "bobalover209", "comment_body": "You can't take liquids with you on a plane, and what about sniffer dogs?", "comment_date": "2024-01-25 09:09:11 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhalz0", "comment_author": "DTXbullrealtor_", "comment_body": "Wtffff this is $", "comment_date": "2024-01-25 09:06:00 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhc4xt", "comment_author": "justausernamehereman", "comment_body": "There’s a story of a famous smuggler who did something just like this for their first few runs.\n\nThey’d dissolve the coke into a bottle of water and then they soaked some poncho / sweater that they were wearing in the water, let it evaporate, and then when they got back over, they just got the poncho / sweater wet again, and let it dry out.\n\nHe said this is how he first moved several “matchboxes” worth of it at first before graduating to some more aggressive and creative methods.", "comment_date": "2024-01-25 09:25:15 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcouu", "comment_author": "Ok-Walrus-5650", "comment_body": "If the capsules get warm in your bag the ❄️ doesn’t clump up? Worried that a x ray would see that it’s not powder. That’s probably dumbass question lol", "comment_date": "2024-01-25 09:32:13 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd3n2", "comment_author": "Ok-Walrus-5650", "comment_body": "Exactly the answer I needed😂😂 I’m being fr too lol", "comment_date": "2024-01-25 09:37:20 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhaz65", "comment_author": "Ok-Walrus-5650", "comment_body": "There’s no precautions to catch drugs being mailed? I’m genuinely curious because I have no clue. I might do that instead, just mail it out the day of my flight", "comment_date": "2024-01-25 09:10:34 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd6z0", "comment_author": "Ok-Walrus-5650", "comment_body": "I don’t trust anyone where I’m going to not give me some laced shit. I know everything’s “laced” but laced as in shit that will kill me", "comment_date": "2024-01-25 09:38:30 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh9rox", "comment_author": "cupkake88", "comment_body": "Get a small eye shadow pallet . Pop the white out and clean it from the foil tray . Press the other white stuff in to the tray. Put other make up items with it keep in your hold luggage", "comment_date": "2024-01-25 08:55:16 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjheyar", "comment_author": "Webster_882", "comment_body": "Go get some nasal spray(you want one that actually sprays), empty it and pour some saline or similar in it and then mix your blow in. This will work, and it will be easier to use.", "comment_date": "2024-01-25 10:00:25 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhf75c", "comment_author": "Webster_882", "comment_body": "My roommate has this metal card (think CC size) and on it is the bill of rights. The rights that are violated are highlighted in red, so when they search him for it he can show them which of his rights they are violating haha", "comment_date": "2024-01-25 10:03:30 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcw09", "comment_author": "ertzrentacar", "comment_body": "I agree! I hate airport security, it’s an infringement of my freedom! \n\nI always make sure to waste everybody’s time around me just because I hate airport security so much!!!\n\nGet a grip retard", "comment_date": "2024-01-25 09:34:45 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcjsw", "comment_author": "Ok-Walrus-5650", "comment_body": "No he’s right I’m a dumbass hence why I’m asking for the best way to get ❄️ on a plane😂", "comment_date": "2024-01-25 09:30:27 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd8ap", "comment_author": "ImJettski", "comment_body": "Dissolve it into water bro, let the water evaporate and then scrape up your ❄️", "comment_date": "2024-01-25 09:38:58 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhb47l", "comment_author": "las8", "comment_body": "Re read what I said and then you'll know what kind of dogs they were.", "comment_date": "2024-01-25 09:12:20 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhe4x8", "comment_author": "Odd-Way-1168", "comment_body": "Dogs recently have been dynamically trained to smell not only bombs, but drugs and guns as well.", "comment_date": "2024-01-25 09:50:18 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbati", "comment_author": "JazzlikePractice4470", "comment_body": "Yes you can", "comment_date": "2024-01-25 09:14:41 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhgj9s", "comment_author": "billionaireastronaut", "comment_body": "You can pack them in your checked luggage. Sniffer dogs can't smell through water, and if you're worried about the outside of the bottle, just use Clorox clean up on it after you fill it on the outside, self-seal the bottles like they're brand new from the manufacturer, nobody is going to Open self-sealed bottles they only care about what you are carrying not what you are checking as far as liquid goes. And like I said this is for personal use if it's for personal use and you got an eight ball that'll dissolve in one bottle of water no problem and it's not noticeable, then you also pack another 10 water bottles in there and put it amongst those 10 and mark the one that's your special one. Zero people will get caught doing that this isn't for shipping kilos and whatnot this is for shipping personal use drugs. Or you could do the easier answer and just mail it to yourself I mean that's the easiest answer just FedEx it to yourself wherever you're going.", "comment_date": "2024-01-25 10:19:49 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhczjn", "comment_author": "UnemployedMatt", "comment_body": "Make it powder. \n\nBreak down the blow. \n\nPut a dollar bill over top of all the small pieces and used a lighter to go back and forth like a rolling pin to turn the blow into a super fine powder. \n\nThey won’t clump up. \n\nAlso, if you think every TSA worker is zooming into the pills of every passenger you’re crazy. lol", "comment_date": "2024-01-25 09:35:56 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhehhb", "comment_author": "InvestmentNo3437", "comment_body": "Me too. I used to walk thru with thousands of oxys and thousands of dollars in my pockets in 09-10. Try that today. You get scanned. And you actually do have the right to refuse a scan. However, they will then place a dog by your groin and asshole. And it will start barking.", "comment_date": "2024-01-25 09:54:37 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbh33", "comment_author": "Hanayama99", "comment_body": "Ship USPS. They need a warrant to search", "comment_date": "2024-01-25 09:16:55 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhebgp", "comment_author": "Ok_Consideration584", "comment_body": "In Australia we have x-ray machines that process international and interstate mail", "comment_date": "2024-01-25 09:52:33 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhflkd", "comment_author": "Thrills4Shills", "comment_body": "Not laced stuff can kill you too , if you ain't heard", "comment_date": "2024-01-25 10:08:23 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhf310", "comment_author": "Ok-Walrus-5650", "comment_body": "Does it give you that same high and drip?", "comment_date": "2024-01-25 10:02:04 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhe1in", "comment_author": "Ok-Walrus-5650", "comment_body": "You won’t loose any ❄️ in the process? Will it affect how the blow hits after being dissolved and dried up?", "comment_date": "2024-01-25 09:49:08 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbuak", "comment_author": "bobalover209", "comment_body": "Not an entire water bottle, only a certain number of travel sized containers.", "comment_date": "2024-01-25 09:21:33 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjheiem", "comment_author": "Ok-Walrus-5650", "comment_body": "Thanks man. Never brought shit on a plane I keep schetchin myself out 😂", "comment_date": "2024-01-25 09:54:57 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhff3f", "comment_author": "Webster_882", "comment_body": "Yes to both, also I would put the coke in before saline in case you want to dilute it more or not.\nThis is how I exclusively do coke nowadays, it’s more controlled and feels SO good on the nose. You NEVER wake up to clogged sinuses either.\n\nEdit: it also absorbs faster", "comment_date": "2024-01-25 10:06:11 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhej9q", "comment_author": "ImJettski", "comment_body": "If you lose any it would be a negligible amount. The quality should stay the same once you evaporate the water and scrape it back up. You could also just drink the water if you didn’t want to go through the process of evaporating and scraping.", "comment_date": "2024-01-25 09:55:14 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbz3b", "comment_author": "JazzlikePractice4470", "comment_body": "That's all he would really need. Honestly I'd just put it in my carry on... I've traveled with dope on an airplane around 3-5 times. Last time was back in like 2010 though.", "comment_date": "2024-01-25 09:23:10 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcjko", "comment_author": "bobalover209", "comment_body": "Again, what about the sniffer dogs? I've never done it nor ever used, just see this as a hole in his plan", "comment_date": "2024-01-25 09:30:22 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcx9n", "comment_author": "JazzlikePractice4470", "comment_body": "AFAIK the dogs are there for bombs.", "comment_date": "2024-01-25 09:35:10 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd01h", "comment_author": "bobalover209", "comment_body": "Ah that would make sense", "comment_date": "2024-01-25 09:36:06 UTC"}
{"submission_title": "Domestic partner tax help?", "comment_id": "kjgvaho", "comment_author": "zffch", "comment_body": "Exactly. The law excludes the cost of employer provided insurance for yourself, your spouse, and your children from being treated as income. But it doesn't say anything about domestic partners, so the value of it is considered part of your wages and taxed accordingly. ", "comment_date": "2024-01-25 06:13:24 UTC"}
{"submission_title": "Domestic partner tax help?", "comment_id": "kjgyq58", "comment_author": "FairBarber4", "comment_body": "Thank you", "comment_date": "2024-01-25 06:48:06 UTC"}
{"submission_title": "Domestic partner tax help?", "comment_id": "kjgzagq", "comment_author": "hoyeay", "comment_body": "Just change it to spouse 😂", "comment_date": "2024-01-25 06:53:57 UTC"}
{"submission_title": "Domestic partner tax help?", "comment_id": "kjh4831", "comment_author": "FairBarber4", "comment_body": "😬", "comment_date": "2024-01-25 07:48:30 UTC"}
{"submission_title": "Canadian Home Price Drop Risks Pushing $34 Billion in Loans Underwater", "comment_id": "kjguldi", "comment_author": "JustBoatTrash", "comment_body": "https://www.investopedia.com/articles/investing/042315/fundamentals-how-canada-makes-its-money.asp\n\nCanada's economy is highly developed and one of the largest in the world. In 2022, the country's annual gross domestic product (GDP) was $2.14 trillion in current USD, according to the latest available World Bank data. That made Canada the world's ninth-largest economy", "comment_date": "2024-01-25 06:06:36 UTC"}
{"submission_title": "Can I fly domestically on a pending green card case through marriage?", "comment_id": "kjhfmvg", "comment_author": "AutoModerator", "comment_body": "Hi there! This is an automated message to inform you and/or remind you of several things: \n\n- We have [a wiki](https://www.reddit.com/r/USCIS/wiki/index). It doesn't cover everything but may answer some questions. Pay special attention to the \"[REALLY common questions](https://www.reddit.com/r/USCIS/wiki/index/vfaq)\" at the top of the FAQ section. Please read it, and if it contains the answer to your question, please delete your post. If your post has to do with something covered in the FAQ, we may remove it.\n- If your post is about biometrics, green cards, naturalization or timelines in general, and whether you're asking or sharing, please include your field office/location in your post. If you already did that, great, thank you! If you haven't done that, your post may be removed without notice.\n- This subreddit is not affiliated with USCIS or the US government in any way. Some posters may claim to work for USCIS, which may or may not be true, and we don't try to verify this one way or another. Be wary that it may be a scam if anyone is asking you for personal info, or sending you a direct message, or asking that you send them a direct message.\n- Some people here claim to be lawyers, but they are not YOUR lawyer. No advice found here should be construed as legal advice. Reddit is not a substitute for a real lawyer. If you need help finding legal services, visit [this link](https://www.uscis.gov/avoid-scams/find-legal-services) for more information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/USCIS) if you have any questions or concerns.*", "comment_date": "2024-01-25 10:08:51 UTC"}
{"submission_title": "Can I fly domestically on a pending green card case through marriage?", "comment_id": "kjhglji", "comment_author": "toksunni", "comment_body": "Domestic flights are fine AFAIK. Just in case, take your receipt notice 797 and/or EAD/AP if you have received", "comment_date": "2024-01-25 10:20:32 UTC"}
{"submission_title": "McDonald's has a major impact on the U.S. economy, generating $108b in gross domestic product a year. 1 in 8 Americans have worked at McDonald's at some point in their lives.", "comment_id": "kjhcfng", "comment_author": "AutoModerator", "comment_body": "Welcome to our community [r/paydayloan_online/](https://www.reddit.com/r/paydayloan_online/) and Thank you for your submission!  If you are looking for a payday loan, make sure you read this post [Unlock Your financial Freedom with payday loan](https://www.reddit.com/r/paydayloan_online/comments/19eecly/unlock_your_financial_freedom_with_payday_loans/) right now.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/paydayloan_online) if you have any questions or concerns.*", "comment_date": "2024-01-25 09:29:00 UTC"}
{"submission_title": "China tightens access to offshore investment funds as domestic market flounders - Financial Times", "comment_id": "kjh7y82", "comment_author": "AutoModerator", "comment_body": "Hi all,\n\nA reminder that comments do need to be on-topic and engage with the article past the headline. Please make sure to read the article before commenting.  Very short comments will automatically be removed by automod. Please avoid making comments that do not focus on the economic content or whose primary thesis rests on personal anecdotes. \n\nAs always our comment rules can be found [here](https://reddit.com/r/Economics/comments/fx9crj/rules_roundtable_redux_rule_vi_and_offtopic/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Economics) if you have any questions or concerns.*", "comment_date": "2024-01-25 08:32:41 UTC"}
{"submission_title": "China tightens access to offshore investment funds as domestic market flounders - Financial Times", "comment_id": "kjh8rnu", "comment_author": "AdAlarmed69", "comment_body": "***Full article***\n\nCurbs on funds that allow retail investors to bet on foreign securities come amid sell-off in Chinese equities\n\n&#x200B;\n\nChinese authorities are tightening limits on capital outflows by restricting access to funds that invest in offshore securities as the country battles a brutal market rout.About a third of Chinese funds that invest in foreign securities under a scheme that bypasses strict capital controls have announced in stock exchange notices they have suspended or capped sales to retail investors “to maintain stable operations and protect investors’ interests”.\n\n&#x200B;\n\nThe Beijing-based manager of one fund that focuses on US stocks said they had received informal instructions from the Shanghai Stock Exchange to reduce sales of such products targeting overseas markets after demand went “through the roof”.\n\nChinese authorities have repeatedly tried to halt a protracted sell-off in domestic equities over the past year, but the efforts have failed to improve battered sentiment, prompting many investors to look for higher yields elsewhere.\n\n&#x200B;\n\nThe soaring popularity among retail investors of foreign-targeted funds has raised regulator concerns about capital outflows. The Financial Times reported last August that China’s biggest fund houses were nearing government quota limits on offshore investment.The government’s Qualified Domestic Institutional Investor scheme allows banks, brokerages and asset managers to bypass China’s strict capital controls. Buying into funds offered through the QDII scheme is the only legal way for Chinese retail investors to invest in foreign stocks and bonds.\n\n&#x200B;\n\nAn increase in investor demand has caused some funds to hit their quota, while other funds have received directions from Chinese regulators to slow or in some cases stop sales of the funds.Public filings show 79 Chinese QDII funds have suspended sales to retail investors and 53 have capped them. Together, these account for about 30 per cent of all QDII funds that target non-Hong Kong overseas markets. The funds include some operated by JPMorgan Asset Management and Manulife Investment Management.\n\n&#x200B;\n\nJPMorgan did not respond to a request for comment, while Manulife declined to comment.Separately, multiple Chinese brokerages that sell funds to retail investors through the QDII scheme said on Tuesday in public filings that regulators led by the Shanghai Stock Exchange were cracking down on “abnormal trading” in exchange traded funds that invest in foreign equities.\n\n&#x200B;\n\nThe brokerages said regulators had in particular requested the suspension of transactions involving ETFs that sought to match the performance of the MSCI USA 50, Nasdaq 100 and Japan’s Nikkei 225 indices.\n\n&#x200B;\n\nThe tightly controlled QDII quotas have intensified competition for outbound investments, with such ETFs trading well above their net asset value. Beijing had a total quota of $166bn across 186 institutions for QDII investments as of the end of 2023, up only slightly since 2021.“Rocketing demand on one hand and quota restrictions on the other, the two factors both contributed to the particularly hot situation in QDII funds we are seeing right now,” said Ding Wenjie, global capital investment strategist at China Asset Management.\n\n&#x200B;\n\nDing said the appetite for funds linked to Japan’s Nikkei index had become “irrational” this month, with one trading at up to a 20 per cent premium to its asset value. Funds targeting the US and India were also popular, Ding said.\n\n&#x200B;\n\nThe China Securities Regulatory Commission and Shanghai Stock Exchange did not respond to requests for comment.Since October, market regulators have been providing private instructions — known as “window guidance” — to some investors, preventing them from being net sellers of equities on certain days.China’s benchmark CSI 300 index has fallen nearly 5 per cent since the start of 2024, continuing a rout fuelled by disappointment with government policies and lingering concerns about a slow economic rebound.", "comment_date": "2024-01-25 08:42:45 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjh8ase", "comment_author": "dingo_deano", "comment_body": "It is magic.  But seriously you have more or less answered your own question. ‘Without pulling WHOLE ceiling down’", "comment_date": "2024-01-25 08:36:57 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjh8w6t", "comment_author": "CunningStunt_1", "comment_body": "With difficulty. \n\nFor wiring between joist with no access; I cut a 100mm hole in the ceiling, drill the joist and then patch the hole with the same cut out. \n\nMillion different ways to do it. I'm sure someone here will have a potentially better method.", "comment_date": "2024-01-25 08:44:19 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjha5te", "comment_author": "curious_trashbat", "comment_body": "If there's a lot of joists to span I generally cut a strip of ceiling down running across joists, wide enough to get a drill into to drill joists.", "comment_date": "2024-01-25 09:00:15 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhbg8h", "comment_author": "geekypenguin91", "comment_body": "Fish what you can and then make a series of \"inspection\" holes where you need to go through joists etc which are then easy to patch afterwards.\n\nIf you're lucky you can get away without having to make many more than you're already making for the spotlights.\n\nSods law however and every spotlight will be right on a joist and they will all go the wrong way for fishing, resulting in needing loads of holes.", "comment_date": "2024-01-25 09:16:37 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhdxs6", "comment_author": "soundslikethunder", "comment_body": "I’ve done downlights where there’s been a void above the joists, easy peash, next to no damage to ceiling/making good. I recently did one that SO MUCH TIMBER that there were more cut outs than downlights with tons of making good (keep the cutouts, put a timber baton behind the hole, screw it in and screw the cut out to the timber, filler) \nAs long as you can prepare the customer for worst case, you won’t know til you get stuck in always, and agree on how far into making good you’ll go. \nIf you can’t navigate a joist, cut a hole either side, drill through and thread your cable through. For cut outs I use a hole saw so making good is easier as above. \nGetting all the positions even and where you want them is another adventure. It’s worth spending the time here to make sure you’ll get them all evenly spaced without hitting joists, and get customer to agree the positions before you start cutting if this isn’t the case. Retro fitting downlights is a different game to wiring for new ceilings so they have to have a bit of understanding in this instance but worth it if you can get them all even and looking the bomb", "comment_date": "2024-01-25 09:47:49 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhgp6j", "comment_author": "Rev_Biscuit", "comment_body": "Ask the plasterer and customer if they'd prefer one long strip or a load of holes and let them fight it out between themselves.", "comment_date": "2024-01-25 10:21:45 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhbqy1", "comment_author": "DepartureWhole4595", "comment_body": "You not scared about potentially hitting pipework that way?", "comment_date": "2024-01-25 09:20:23 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhbvpk", "comment_author": "DepartureWhole4595", "comment_body": "Does the same method work in stud walls?", "comment_date": "2024-01-25 09:22:02 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhe93n", "comment_author": "DepartureWhole4595", "comment_body": "Informative thanks mate", "comment_date": "2024-01-25 09:51:44 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhdf47", "comment_author": "WilsonSpark", "comment_body": "Pipe work is usually cut through the top of the joist, so you’ll miss them", "comment_date": "2024-01-25 09:41:19 UTC"}
{"submission_title": "How do you add accessories into domestic properties with finished stud walls without wrecking it all?", "comment_id": "kjhc9fl", "comment_author": "geekypenguin91", "comment_body": "Pretty much", "comment_date": "2024-01-25 09:26:50 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh6pya", "comment_author": "_LLOSERR", "comment_body": "have you been thru TSA recently? the scanner sees fucking everything. everything. if the risk of years in prison seems worth putting coke in your ass go for it.", "comment_date": "2024-01-25 08:17:37 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh6to2", "comment_author": "Ohigetjokes", "comment_body": "Anyone who says anything is “fool proof” is an idiot.\n\nFull-body X-rays in most US airports are going to put an end to that idea real quick. Doesn’t matter if it’s a domestic flight or not - your odds of being walked through one of those is 50/50.", "comment_date": "2024-01-25 08:18:51 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh8spe", "comment_author": "bobbyvs", "comment_body": "I dunno man... the price of a ball seems like peanuts compared to getting caught smuggling it. Rip a few and toss it.", "comment_date": "2024-01-25 08:43:07 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh7986", "comment_author": "Amylynn860", "comment_body": "I snuck stuff through tsa in a compact makeup case right under the poofy thing to apply the makeup...they never found it.", "comment_date": "2024-01-25 08:24:04 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh6l85", "comment_author": "las8", "comment_body": "Put it in your carry on. Tsa is looking for bombs and guns not personal amount of drugs.", "comment_date": "2024-01-25 08:16:02 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh7zre", "comment_author": "billionaireastronaut", "comment_body": "Has nobody here smuggled drugs before? It's just for personal use simple....Cocaine does not evaporate... Water does... So pour it in a water bottle. Then when you get to wherever just pour the water into a glass and let it evaporate and only the powder cocaine will remain. Tada. And if you're that paranoid you could do it prison house style and put the Coke in water then get a brush and paint the coke water on a piece of paper then when you get to wherever you're going just smoke or eat the paper. Here's a hint for you....The Bible. Nobody's going to question your Bible. They'll be worried about a lawsuit. Or go all out, wear a priest collar and mark the water as holy water, and carry the Bible, then you got all kinds of options.", "comment_date": "2024-01-25 08:33:14 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhc8e6", "comment_author": "UnemployedMatt", "comment_body": "I’ve traveled more than 10 times by breaking up whatever I had into fine powder and buying a bottle of vitamins from the pharmacy and replacing the powder. \n\nDo it all the time.", "comment_date": "2024-01-25 09:26:27 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcgvx", "comment_author": "InvestmentNo3437", "comment_body": "It's gonna be embarrassing for you when they see it in the body scanner then start retrieving drugs from your asshole.", "comment_date": "2024-01-25 09:29:26 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh7h7f", "comment_author": "Constant-Apricot-715", "comment_body": "I'd put it in Bic pens. Generic white big hollow tube. Fill a couple full so they look the same, carry them in shirt pocket...want them on you not in luggage.", "comment_date": "2024-01-25 08:26:47 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhb818", "comment_author": "JazzlikePractice4470", "comment_body": "You'll be fine", "comment_date": "2024-01-25 09:13:42 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh9yap", "comment_author": "Hanayama99", "comment_body": "Mail it", "comment_date": "2024-01-25 08:57:35 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd1kn", "comment_author": "izucantc", "comment_body": "The punishment if you are caught is not worth the risk. Don't try it, just buy from someone local when you get to your destination. Don't get out on the no fly list lol", "comment_date": "2024-01-25 09:36:37 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhdabf", "comment_author": "throwitfarawayfromm3", "comment_body": "I'm an idiot whose never done this before. But what about a balloon In your mouth? Then take it out after. The scanners aren't xrays.", "comment_date": "2024-01-25 09:39:39 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhfbmg", "comment_author": "Thrills4Shills", "comment_body": "Just mail it to yourself  , or sell it to someone before the flight and buy more when off the flight , or next day shipping for fast service. ", "comment_date": "2024-01-25 10:05:03 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhfztf", "comment_author": "Pvnels", "comment_body": "Just snort it all, pussy", "comment_date": "2024-01-25 10:13:16 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhg84x", "comment_author": "Kahraabaa", "comment_body": "Just declare it to the tsa and you should be good to go", "comment_date": "2024-01-25 10:16:07 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh8n7s", "comment_author": "Ok-Walrus-5650", "comment_body": "I have not. Good to know", "comment_date": "2024-01-25 08:41:14 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbos9", "comment_author": "justausernamehereman", "comment_body": "I’m pretty sure you have the legal right to “opt out” of having to use that full body scanner. And then at that point they do an aggressive full body pat down and walk you through a metal detector. The pat down isn’t as aggressive as you’d think though and they’re only allowed to use the backs of their hands.\n\nAt least that’s the case the last several times I’ve flown. I didn’t have anything illegal. I just fucking hate TSA and anything to exercise what little freedom I have is worth it.", "comment_date": "2024-01-25 09:19:39 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhc86s", "comment_author": "Conwsk", "comment_body": "He actually said full proof so he's clearly not an idiot!", "comment_date": "2024-01-25 09:26:23 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh8v12", "comment_author": "Ok-Walrus-5650", "comment_body": "Probably the smart thing to do haha just gotta get myself to do it", "comment_date": "2024-01-25 08:43:55 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh935t", "comment_author": "chuckyb3", "comment_body": "Depends on the airport, I went thru Dallas recently and they had dogs sniffing all the luggage+passengers (might be bomb sniffing dogs not sure)", "comment_date": "2024-01-25 08:46:45 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh9qxl", "comment_author": "iamamoa", "comment_body": "That coke in water tip is truly a useful illegalifepro tip. Probably the most useful one I've read here and I don't even do coke.", "comment_date": "2024-01-25 08:55:00 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhav4c", "comment_author": "bobalover209", "comment_body": "You can't take liquids with you on a plane, and what about sniffer dogs?", "comment_date": "2024-01-25 09:09:11 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhalz0", "comment_author": "DTXbullrealtor_", "comment_body": "Wtffff this is $", "comment_date": "2024-01-25 09:06:00 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhc4xt", "comment_author": "justausernamehereman", "comment_body": "There’s a story of a famous smuggler who did something just like this for their first few runs.\n\nThey’d dissolve the coke into a bottle of water and then they soaked some poncho / sweater that they were wearing in the water, let it evaporate, and then when they got back over, they just got the poncho / sweater wet again, and let it dry out.\n\nHe said this is how he first moved several “matchboxes” worth of it at first before graduating to some more aggressive and creative methods.", "comment_date": "2024-01-25 09:25:15 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcouu", "comment_author": "Ok-Walrus-5650", "comment_body": "If the capsules get warm in your bag the ❄️ doesn’t clump up? Worried that a x ray would see that it’s not powder. That’s probably dumbass question lol", "comment_date": "2024-01-25 09:32:13 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd3n2", "comment_author": "Ok-Walrus-5650", "comment_body": "Exactly the answer I needed😂😂 I’m being fr too lol", "comment_date": "2024-01-25 09:37:20 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhaz65", "comment_author": "Ok-Walrus-5650", "comment_body": "There’s no precautions to catch drugs being mailed? I’m genuinely curious because I have no clue. I might do that instead, just mail it out the day of my flight", "comment_date": "2024-01-25 09:10:34 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd6z0", "comment_author": "Ok-Walrus-5650", "comment_body": "I don’t trust anyone where I’m going to not give me some laced shit. I know everything’s “laced” but laced as in shit that will kill me", "comment_date": "2024-01-25 09:38:30 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjh9rox", "comment_author": "cupkake88", "comment_body": "Get a small eye shadow pallet . Pop the white out and clean it from the foil tray . Press the other white stuff in to the tray. Put other make up items with it keep in your hold luggage", "comment_date": "2024-01-25 08:55:16 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjheyar", "comment_author": "Webster_882", "comment_body": "Go get some nasal spray(you want one that actually sprays), empty it and pour some saline or similar in it and then mix your blow in. This will work, and it will be easier to use.", "comment_date": "2024-01-25 10:00:25 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhf75c", "comment_author": "Webster_882", "comment_body": "My roommate has this metal card (think CC size) and on it is the bill of rights. The rights that are violated are highlighted in red, so when they search him for it he can show them which of his rights they are violating haha", "comment_date": "2024-01-25 10:03:30 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcw09", "comment_author": "ertzrentacar", "comment_body": "I agree! I hate airport security, it’s an infringement of my freedom! \n\nI always make sure to waste everybody’s time around me just because I hate airport security so much!!!\n\nGet a grip retard", "comment_date": "2024-01-25 09:34:45 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcjsw", "comment_author": "Ok-Walrus-5650", "comment_body": "No he’s right I’m a dumbass hence why I’m asking for the best way to get ❄️ on a plane😂", "comment_date": "2024-01-25 09:30:27 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd8ap", "comment_author": "ImJettski", "comment_body": "Dissolve it into water bro, let the water evaporate and then scrape up your ❄️", "comment_date": "2024-01-25 09:38:58 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhb47l", "comment_author": "las8", "comment_body": "Re read what I said and then you'll know what kind of dogs they were.", "comment_date": "2024-01-25 09:12:20 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhe4x8", "comment_author": "Odd-Way-1168", "comment_body": "Dogs recently have been dynamically trained to smell not only bombs, but drugs and guns as well.", "comment_date": "2024-01-25 09:50:18 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbati", "comment_author": "JazzlikePractice4470", "comment_body": "Yes you can", "comment_date": "2024-01-25 09:14:41 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhgj9s", "comment_author": "billionaireastronaut", "comment_body": "You can pack them in your checked luggage. Sniffer dogs can't smell through water, and if you're worried about the outside of the bottle, just use Clorox clean up on it after you fill it on the outside, self-seal the bottles like they're brand new from the manufacturer, nobody is going to Open self-sealed bottles they only care about what you are carrying not what you are checking as far as liquid goes. And like I said this is for personal use if it's for personal use and you got an eight ball that'll dissolve in one bottle of water no problem and it's not noticeable, then you also pack another 10 water bottles in there and put it amongst those 10 and mark the one that's your special one. Zero people will get caught doing that this isn't for shipping kilos and whatnot this is for shipping personal use drugs. Or you could do the easier answer and just mail it to yourself I mean that's the easiest answer just FedEx it to yourself wherever you're going.", "comment_date": "2024-01-25 10:19:49 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhczjn", "comment_author": "UnemployedMatt", "comment_body": "Make it powder. \n\nBreak down the blow. \n\nPut a dollar bill over top of all the small pieces and used a lighter to go back and forth like a rolling pin to turn the blow into a super fine powder. \n\nThey won’t clump up. \n\nAlso, if you think every TSA worker is zooming into the pills of every passenger you’re crazy. lol", "comment_date": "2024-01-25 09:35:56 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhehhb", "comment_author": "InvestmentNo3437", "comment_body": "Me too. I used to walk thru with thousands of oxys and thousands of dollars in my pockets in 09-10. Try that today. You get scanned. And you actually do have the right to refuse a scan. However, they will then place a dog by your groin and asshole. And it will start barking.", "comment_date": "2024-01-25 09:54:37 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbh33", "comment_author": "Hanayama99", "comment_body": "Ship USPS. They need a warrant to search", "comment_date": "2024-01-25 09:16:55 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhebgp", "comment_author": "Ok_Consideration584", "comment_body": "In Australia we have x-ray machines that process international and interstate mail", "comment_date": "2024-01-25 09:52:33 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhflkd", "comment_author": "Thrills4Shills", "comment_body": "Not laced stuff can kill you too , if you ain't heard", "comment_date": "2024-01-25 10:08:23 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhf310", "comment_author": "Ok-Walrus-5650", "comment_body": "Does it give you that same high and drip?", "comment_date": "2024-01-25 10:02:04 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhe1in", "comment_author": "Ok-Walrus-5650", "comment_body": "You won’t loose any ❄️ in the process? Will it affect how the blow hits after being dissolved and dried up?", "comment_date": "2024-01-25 09:49:08 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbuak", "comment_author": "bobalover209", "comment_body": "Not an entire water bottle, only a certain number of travel sized containers.", "comment_date": "2024-01-25 09:21:33 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjheiem", "comment_author": "Ok-Walrus-5650", "comment_body": "Thanks man. Never brought shit on a plane I keep schetchin myself out 😂", "comment_date": "2024-01-25 09:54:57 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhff3f", "comment_author": "Webster_882", "comment_body": "Yes to both, also I would put the coke in before saline in case you want to dilute it more or not.\nThis is how I exclusively do coke nowadays, it’s more controlled and feels SO good on the nose. You NEVER wake up to clogged sinuses either.\n\nEdit: it also absorbs faster", "comment_date": "2024-01-25 10:06:11 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhej9q", "comment_author": "ImJettski", "comment_body": "If you lose any it would be a negligible amount. The quality should stay the same once you evaporate the water and scrape it back up. You could also just drink the water if you didn’t want to go through the process of evaporating and scraping.", "comment_date": "2024-01-25 09:55:14 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhbz3b", "comment_author": "JazzlikePractice4470", "comment_body": "That's all he would really need. Honestly I'd just put it in my carry on... I've traveled with dope on an airplane around 3-5 times. Last time was back in like 2010 though.", "comment_date": "2024-01-25 09:23:10 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcjko", "comment_author": "bobalover209", "comment_body": "Again, what about the sniffer dogs? I've never done it nor ever used, just see this as a hole in his plan", "comment_date": "2024-01-25 09:30:22 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhcx9n", "comment_author": "JazzlikePractice4470", "comment_body": "AFAIK the dogs are there for bombs.", "comment_date": "2024-01-25 09:35:10 UTC"}
{"submission_title": "Bringing an 🎱 on a domestic flight?", "comment_id": "kjhd01h", "comment_author": "bobalover209", "comment_body": "Ah that would make sense", "comment_date": "2024-01-25 09:36:06 UTC"}
{"submission_title": "Domestic partner tax help?", "comment_id": "kjgvaho", "comment_author": "zffch", "comment_body": "Exactly. The law excludes the cost of employer provided insurance for yourself, your spouse, and your children from being treated as income. But it doesn't say anything about domestic partners, so the value of it is considered part of your wages and taxed accordingly. ", "comment_date": "2024-01-25 06:13:24 UTC"}
{"submission_title": "Domestic partner tax help?", "comment_id": "kjgyq58", "comment_author": "FairBarber4", "comment_body": "Thank you", "comment_date": "2024-01-25 06:48:06 UTC"}
{"submission_title": "Domestic partner tax help?", "comment_id": "kjgzagq", "comment_author": "hoyeay", "comment_body": "Just change it to spouse 😂", "comment_date": "2024-01-25 06:53:57 UTC"}
{"submission_title": "Domestic partner tax help?", "comment_id": "kjh4831", "comment_author": "FairBarber4", "comment_body": "😬", "comment_date": "2024-01-25 07:48:30 UTC"}
{"submission_title": "Canadian Home Price Drop Risks Pushing $34 Billion in Loans Underwater", "comment_id": "kjguldi", "comment_author": "JustBoatTrash", "comment_body": "https://www.investopedia.com/articles/investing/042315/fundamentals-how-canada-makes-its-money.asp\n\nCanada's economy is highly developed and one of the largest in the world. In 2022, the country's annual gross domestic product (GDP) was $2.14 trillion in current USD, according to the latest available World Bank data. That made Canada the world's ninth-largest economy", "comment_date": "2024-01-25 06:06:36 UTC"}
{"submission_title": "How much of an advantage (if any) do domestic grads have over internationals?", "comment_id": "kjgrjfa", "comment_author": "UnnervingS", "comment_body": "Many jobs will only hire citizens or PRs. The advantage is insane.", "comment_date": "2024-01-25 05:38:22 UTC"}
{"submission_title": "How much of an advantage (if any) do domestic grads have over internationals?", "comment_id": "kjgqsaz", "comment_author": "OzAnonn", "comment_body": "As long as someone doesn't struggle to communicate, being a native speaker isn't considered much of an advantage. Of course there's some variation across companies. Years ago I worked in a company where virtually every developer was Caucasian. It's hard to imagine this was a coincidence as it's actually hard to find Caucasians to hire if you tried. \n\nThere's an advantage from a visa point of view though. Especially in this market, a lot of companies might prefer citizens and PRs.", "comment_date": "2024-01-25 05:31:48 UTC"}
{"submission_title": "How much of an advantage (if any) do domestic grads have over internationals?", "comment_id": "kjh38ld", "comment_author": "ArtilleryProducer31", "comment_body": "Like the other comments, advantage is insane. I am an international student in Australia, with previous work experience. I just got rejected from a part-time software developer role, because of my visa.", "comment_date": "2024-01-25 07:37:15 UTC"}
{"submission_title": "How much of an advantage (if any) do domestic grads have over internationals?", "comment_id": "kjhe3tm", "comment_author": "Darlew", "comment_body": "I feel like it mostly depends on the hiring manager/recruiter/interviewer. An international hiring manager will naturally relate more to an international candidate and the inverse is true for natives. As much as people will try to tell you that proficiency and expertise is the most important factor, personality and connection with the interviewer is way up there too.", "comment_date": "2024-01-25 09:49:54 UTC"}
{"submission_title": "How much of an advantage (if any) do domestic grads have over internationals?", "comment_id": "kjh8ddn", "comment_author": "hypermeowmeow", "comment_body": "Damn pal, I don't know if you are kidding or not. As an international student here, I must say it's almost like an impossible game. \n\nIf you try going on Prosple AU and filter visa rights, I think the job listings would just halve :(", "comment_date": "2024-01-25 08:37:50 UTC"}
{"submission_title": "How much of an advantage (if any) do domestic grads have over internationals?", "comment_id": "kjgw52r", "comment_author": "theleveragedsellout", "comment_body": "Yeah was going to say, there’s basically no pathway for firms to hire international graduates with the exception of a few very limited circumstances.", "comment_date": "2024-01-25 06:21:43 UTC"}
{"submission_title": "How much of an advantage (if any) do domestic grads have over internationals?", "comment_id": "kjh657u", "comment_author": "andrew1677", "comment_body": "I got few hundred rejection before landing a retail job.  Not saying a cs job.", "comment_date": "2024-01-25 08:10:44 UTC"}
{"submission_title": "How much of an advantage (if any) do domestic grads have over internationals?", "comment_id": "kjgwoa8", "comment_author": "bilby2020", "comment_body": "Not exactly true. There are exemptions like for Indian students.\n\nhttps://www.afr.com/politics/federal/indian-students-given-exemption-to-work-in-australia-20231214-p5erej", "comment_date": "2024-01-25 06:27:04 UTC"}
{"submission_title": "Flying international", "comment_id": "kjgt9zv", "comment_author": "dr-swordfish", "comment_body": "1. tsa screening is the same for domestic and international. \n2. upon returning to the US you'll go through customs screening. \n3. You are giving consent to a pat down if you enter a checkpoint. The pat downs you may receive are not as invasive as many people make it seem. Any sensitive areas are done with the back of the hands (less nerve endings) by same gender only. Usually are targeted to a small portion of the body. And only take a few seconds to complete. \n4. Keep in mind we're not doing it to find drugs, we're doing it so the plane you get on actually makes it to the destination.", "comment_date": "2024-01-25 05:54:06 UTC"}
{"submission_title": "After an argument, my [31f] live-in boyfriend [33m] wants days of space – seeking advice on how to approach this?", "comment_id": "kjgwsx2", "comment_author": "RSTA30", "comment_body": "Crate training is bullshit. It's no better than how scumbags will put a dog on a short chain and leave it alone in their yard, so I am completely on your boyfriends side on that one. \n\nThe dog is acting up because it is starved for attention from being left alone so often. The last thing that will help is isolating it even more by locking it in a box. They are pack animals and don't do well alone. That's the entire reason we were able to domesticate them.\n\n\nFind a trainer who isn't a proponent of abusing animals. And stop pushing for him to abuse his dog just because some idiot told you to. I will bet your fights over this will magically come to an end.", "comment_date": "2024-01-25 06:28:23 UTC"}
{"submission_title": "Just discovered my cat may be a Nebelung?", "comment_id": "kjgl0ky", "comment_author": "AutoModerator", "comment_body": "Thank you for sharing your kitty with us! If you haven't already done so, please take a minute to watch the video and explore the links below. If other Redditors identify your cat as a dilute tortie, standard issue cat, calico, tuxedo, or something else, your post may be removed in order to help keep this sub focused on Nebbies. Please note that Nebelungs must be solid gray. (An allowance is made for a small white patch/locket on the chest.)\n\nAnimal Planet: Cats 101 - Nebelung: \n\nhttps://www.youtube.com/watch?v=2aDwFMEJ0W8\n\nInformation from The International Cat Association (TICA), the world's largest genetic registry of pedigreed and domestic cats.\n\n[About the Nebelung Breed](https://www.tica.org/breeds/browse-all-breeds?view=article&id=1663:the-nebelung-breed&catid=48)\n\n[Nebelung Breed Standards](https://www.tica.org/phocadownload/nb.pdf)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nebelung) if you have any questions or concerns.*", "comment_date": "2024-01-25 04:43:52 UTC"}
{"submission_title": "Just discovered my cat may be a Nebelung?", "comment_id": "kjgo55w", "comment_author": "Keeyawn", "comment_body": "Oh wow I just read that the first ones' mom was a black domestic!", "comment_date": "2024-01-25 05:09:14 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjgmw6o", "comment_author": "Wolfe_Hunter_VII", "comment_body": "Which state?", "comment_date": "2024-01-25 04:58:55 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjgngf2", "comment_author": "New-Connection7198", "comment_body": "Got two vials of test e took about 4 days im from the gold coast\n\nand it was the real deal", "comment_date": "2024-01-25 05:03:33 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjgov34", "comment_author": "Zerkxerd", "comment_body": "these guys are good I fucking couldn’t find anyone didn’t take to long", "comment_date": "2024-01-25 05:15:19 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjgn1ui", "comment_author": "DomesticGearAUS", "comment_body": "Warehouse In Perth, where you from I can estimate shipping.", "comment_date": "2024-01-25 05:00:13 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjgqwy4", "comment_author": "Wolfe_Hunter_VII", "comment_body": "Melbourne, but it’s always a risk crossing state lines - had my shit confiscated before", "comment_date": "2024-01-25 05:32:57 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjgw3xt", "comment_author": "DomesticGearAUS", "comment_body": "Probably shitty packaging. Just msg me,", "comment_date": "2024-01-25 06:21:24 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjgldyw", "comment_author": "jettTopg", "comment_body": "Yeah good supplier took about 6 days didn’t even get express pretty pricey but you get what you pay for tbh", "comment_date": "2024-01-25 04:46:50 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjgy0ij", "comment_author": "selectedsteroidvip1", "comment_body": "The raw materials are produced in China, and most of the world's steroids are exported from China.", "comment_date": "2024-01-25 06:40:40 UTC"}
{"submission_title": "Buy Gear Domestic (Australian Only)", "comment_id": "kjh7cqa", "comment_author": "DomesticGearAUS", "comment_body": "Yeah your right but all our stock is at our warehouse in Australia.", "comment_date": "2024-01-25 08:25:16 UTC"}
{"submission_title": "Economics - Exchange rates doubt", "comment_id": "kjgliek", "comment_author": "None", "comment_body": "Domestic is listed first as the quoted currency; foreign is listed second as the base.", "comment_date": "2024-01-25 04:47:49 UTC"}
{"submission_title": "Economics - Exchange rates doubt", "comment_id": "kjgr4ch", "comment_author": "Difficult-Chard-7452", "comment_body": "But conventionally wouldn't domestic currency be your base currency? Thats what level 1 materials said anyway. Is it because we are finding real rates?", "comment_date": "2024-01-25 05:34:46 UTC"}
{"submission_title": "My mother is stalking me but I still live with her. This is actually domestic abuse under California law.", "comment_id": "kjgog8q", "comment_author": "visitor987", "comment_body": "You just move out of state you mother cannot stop you.\n\nHere are some job ideas the last one sometimes has housing. This pays well the US Post Office is hiring note it sometimes takes feds three months to hire someone. https://about.usps.com/careers/welcome.htm Take the test and apply for jobs anywhere in USA.\r  \n\r  \nAmtrak is hiring https://careers.amtrak.com/  Jobs exist in most states.\r  \n\r  \nUS Forest service is hiring https://www.fs.usda.gov/working-with-us/jobs \r  \n\r  \nThese also pay well you may not qualify for all of them https://www.fool.com/slideshow/not-many-people-want-these-jobs-and-s-why-they-pay-well/\r  \n50 jobs over $50,000 without college https://www.mrmoneymustache.com/2013/07/25/50-jobs-over-50000-without-a-degree-part-1/ \r  \n\r  \nFederal civil service jobs https://www.usajobs.gov/Search?p=1 \r  \n\r  \nLook into Concessioners for the National Park service. The jobs include fields of Lodging; Campgrounds; Food Service Operations; Guide Services and Outfitters. The jobs SOMETIMES include HOUSING in more remote areas like Montana, New Mexico, Wyoming, Grand Canyon, etc. Some jobs are summer or winter only, others are all year long in one location or you may be able transfer between locations to work year-round. Use this link & enter the name of the park you wish to be employed at https://www.nps.gov/subjects/concessions/authorized-concessioners.htm Contact each concessioner directly by Googling the company name to apply. This link will let you look up parks by state https://www.nps.gov/index.htm not every park has a concessioner.", "comment_date": "2024-01-25 05:11:50 UTC"}
{"submission_title": "Mistakenly opened up a \"Domestic Business Corporation\" and need to close it but am lost. I have to file taxes and mark it as my last return but I have no clue how to even start to file taxes for it?", "comment_id": "kjgjeby", "comment_author": "AutoModerator", "comment_body": "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*", "comment_date": "2024-01-25 04:31:22 UTC"}
{"submission_title": "Can any wild mammal be domesticated if done in a controlled environment?", "comment_id": "kjgx729", "comment_author": "InternationalClick78", "comment_body": "Probably not. Domestication requires specific traits that not all animals have. Zebras are a great example of this due to their social structures", "comment_date": "2024-01-25 06:32:22 UTC"}
{"submission_title": "Can any wild mammal be domesticated if done in a controlled environment?", "comment_id": "kjgi4zu", "comment_author": "lewisiarediviva", "comment_body": "Probably, maybe. If you selectively breed long enough you’ll get differences. Whether they’re adequate to be considered ‘domesticated’ will be up for debate. Depends on the fundamental limits of social behavior for the species.", "comment_date": "2024-01-25 04:21:52 UTC"}
{"submission_title": "Can any wild mammal be domesticated if done in a controlled environment?", "comment_id": "kjgkl7w", "comment_author": "hilmiira", "comment_body": "I mean yeah, domestication is just animals adapting to humans and house life.\n\nAll creatures can be domesticated, some better some worse.", "comment_date": "2024-01-25 04:40:33 UTC"}
{"submission_title": "Can any wild mammal be domesticated if done in a controlled environment?", "comment_id": "kjgmv2y", "comment_author": "quiveringcoconut", "comment_body": "Another off the wall thought -- would you be able to somehow determine if a wild animal was at some point domesticated and, for whatever reason, went back to being wild? How could we tell", "comment_date": "2024-01-25 04:58:40 UTC"}
{"submission_title": "Can any wild mammal be domesticated if done in a controlled environment?", "comment_id": "kjgxos9", "comment_author": "RainCoatDuckling", "comment_body": "While we have more options thanks to current technology than when we first domesticated animals, some animals would be easier to domestic than others. And it still will take lots of time, money, and resources to change animals enough to be considered domesticated.\n\nCpg grey on yt has a good video on it.\n\nhttps://youtu.be/wOmjnioNulo?si=SKRn0KFwmsjElt4i", "comment_date": "2024-01-25 06:37:21 UTC"}
{"submission_title": "Can any wild mammal be domesticated if done in a controlled environment?", "comment_id": "kjgirnn", "comment_author": "quiveringcoconut", "comment_body": "Why hasn't anyone tried to fund research like this? It'd give a better understanding as to the origins and tactics used in humanities first endeavors into the realm of wildlife domestication.", "comment_date": "2024-01-25 04:26:34 UTC"}
{"submission_title": "Can any wild mammal be domesticated if done in a controlled environment?", "comment_id": "kjh2qbu", "comment_author": "RainCoatDuckling", "comment_body": "So, I'm not sure what your level of knowledge is. Please forgive me if I explain something you already know.\n\nTo answer your question, we can tell if an animal is domesticated, feral, wild, or tamed.\n\nBeing domesticated means that an animal's ancestors have gone through genetic change to become a different animal, thanks to the efforts of humans. This takes literally hundreds of generations.\n\n A wild animal cannot be domesticated. It can be tamed and can trust, or at least not fear humans. Elephants and deer are tamed often. But they have not been genetically altered through breeding to be useful to us.\n\nA domesticated animal can become feral, like wild mustangs or street dogs. They might fear or mistrust humans, but their ancestors were still genetically altered by human controlled breeding.\n\nThink about it this way. If you're a caveman, and your caveman family finds two wolf pups. You keep them because theyre cute and you would naturally give treats and attention to the wolf pup that was friendlier to you. This creates artificial pressure on the wolf pups genes. Wolves that have calmer personalities are more likely to be rewarded by their adopted human family. They get more food, making them healthier, making them more likely to successfully have more wolf pups. With these new wolf pups, the cycle starts again. Maybe one pup is protective of your family. Maybe he fights a bear off or is the best hunter. You'll definitely want to give him lots of treats for being a good boy. So now this wolf, with his calmer and more loyal genes, benefits from being calmer and loyal thanks to human intervention. And the cycle continues until you have friendly and loyal dogs. The dogs are well fed and can eat cooked scraps, which are easier to digest.\n\nSince we're changing the way evolution pressures domesticated animals, they are able to survive without following the 'dress code'. An albino deer is very rare in the wild because its white coat is bad for camouflage. It will also have bad eyesight and probably will not act as wary around predators as other deer, since it can't see them. But we can find lots of albino animals in captivity, even ones that aren't domesticated, but tamed. Because in captivity, predators will not eat it and mother animals will not abandon odd looking offspring. ( They need to save energy to grow offspring that will actually survive). So we are removing the penalties for not following 'the rules' . \n\nThink about how a dog is different from a wolf. They might have floppy ears, long coats, short or tall, squashed face or long snouts. These traits do not help the dog survive in the wild, but since humans control their 'ecosystem' now. They don't have to follow the 'dresscode'. A dashund can have stubby legs that are useless for hunting elk. It doesn't matter. humans will use them to down rabbit dens, guaranteeing the dog a meal. A wolf who can only hunt rabbit will starve if there is a die off of the rabbits population. A mastiff doesn't have to worry about finding enough food for it's huge body when there's a famine. A husky doesn't have to worry about overheating when it's coat is too fluffy. Chihuahuas don't have to worry about getting eaten by a hawk.\n\nSince domesticated animals usually don't follow the 'dresscode', we can tell if an animal is feral/wild/tamed depending on it's looks and behaviors. Even wolf/dog hybrids have signs, and they're very close genetically. You can look at the slope of their foreheads and if they have dewclaws, etc.\n\nHumans using our giant brains are basically able to cheat the system. We can build ropes and fences to control animal movements. We know what the animal eats and what's bad for it, ensuring our animals are healthy and have healthier babies. We live a long time, so we can, over time, choose which animals we like best and select for that trait. The things we don't like, we can cull out. Either through eating or removing it from our selected gene pool.\n\nSorry for ramble. Hope you find this interesting. Try looking up a vid on the russian silver fox breeding experiment. They were trying to select for calmer foxes to see what would happen. They also did the opposite and bred a bunch of mean ones by selecting the jerk foxes lol.", "comment_date": "2024-01-25 07:31:33 UTC"}
{"submission_title": "Can any wild mammal be domesticated if done in a controlled environment?", "comment_id": "kjgixmk", "comment_author": "lewisiarediviva", "comment_body": "They have, and are. Quite famous ongoing experiment in Russia that resulted in the ‘domesticated silver fox’.", "comment_date": "2024-01-25 04:27:49 UTC"}
{"submission_title": "Suggest me to buy espresso machine.", "comment_id": "kjh303k", "comment_author": "Aside_Electrical", "comment_body": "You may not be legally permitted to use a domestic machine because it may not have the required certifications.", "comment_date": "2024-01-25 07:34:39 UTC"}
{"submission_title": "Why PBR?", "comment_id": "kjgbomj", "comment_author": "ananthropolothology", "comment_body": "For a while it was really the cheapest domestic, and you could get it in tallboys at the bar. Chicago has Hamm's and Old Style, Seattle has Olympia and Ranier, Baltimore has Natty Boh, etc (though some of those are brewed locally). Every city has their go-to cheap beer, PBR just somehow became the option for here.", "comment_date": "2024-01-25 03:36:22 UTC"}
{"submission_title": "A: Oh not, that is not a mating display, you - em it seems that you triggered their domestication instinct.", "comment_id": "kjg9mls", "comment_author": "AutoModerator", "comment_body": "In an attempt to reduce remind me spam, all top comments that include a remind me will be removed. If you would like to have a remind me, please reply to this comment. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/humansarespaceorcs) if you have any questions or concerns.*", "comment_date": "2024-01-25 03:22:34 UTC"}
{"submission_title": "A: Oh not, that is not a mating display, you - em it seems that you triggered their domestication instinct.", "comment_id": "kjgfeg2", "comment_author": "OSadorn", "comment_body": "\"This is their domestication instinct?\" I asked with an alert tone, pinned down by a being that I thought wouldn't be a household pet or similar.\n\nThe lithe, mouthless enigma of a sapient who watched the situation elaborated again as if I didn't hear.\n\nI then spoke at them with panic! \"If this isn't a 'mating display' then WHAT IS?!\"\n\nThe creature who had effectively dropped its weight at me was now trying to rub themselves onto me like a non-cringe-inducing scent application method.\n\nFor 'urban wildlife' these beings are a near-identical to some of the creative half-monsters we've imagined.\n\nAnd this guy thinks I'd make a good handler?\n\nI feel like the reverse is more likely. I decide to tease the creature's uncannily humane face with a slight kiss.\n\nThat drew them to pulling me up into a hug and leaning back, almost plexing me into an upright posture while I returned the favour.\n\nWe then danced in circles around eachother for a bit, never letting go.\n\nThe mouthless observer of a 'friend' nodded as the dancing slowed to a stop and we butted heads. He told me this - \"You are bonded... It's the first time I've seen her kind do this ritual with a human.\"\n\nHold on. Repeat that again. What?\n\nI think that but it seems I've spilled something. The observer curtly nods and then just leaves me and this... domesticated companion.\n\nIn my room.\n\nBy all that is holy-\n\n...More cuddling. My eyes are lidded, tired. She's ruffling my hair now and is actually whispering legible words, but I am-\n\nI flop onto the bed. She follows.\n\n\\- - - The next few days were a blur, redacted for dignity.\n\nThe 'friend' of mine has returned with a myriad of other beings. Apparently from the local animal shelter.\n\nHe claims my kind are a nebulous legal grey-zone where we cannot be classed as 'companions' or 'pets' because we can space and things but this one...\n\nHer kind have bamboozled the Orion-colonial Protoss. Why haven't they noticed?", "comment_date": "2024-01-25 04:01:58 UTC"}
{"submission_title": "A: Oh not, that is not a mating display, you - em it seems that you triggered their domestication instinct.", "comment_id": "kjgd50g", "comment_author": "A_normal_storyteller", "comment_body": "\"How come?\"\n\nNate looked back, while holding the red shirt in front of the slime-covered tadpole-like creature, while at the same time holding the small insectoid on his other hand, he seemed confused and rightfully so, since the amphibian kept making loud noises, oddly similar to a mix of both, chirping and crying.\n\n\"Yes, that thing is a female amphibiaganax, a young one on top of that, those creatures were the bane of our species long ago, they used to prey on our cattle after all, also, the slime is a Gluesterax, a symbiotic colonial organism, it acts a bit like that one character of retro terran movies\"\n\n\"What?, I may be a human but i'm not a movie nerd like you Lisa, I really don't know what are you talking about\"\n\n\"The thing, that creature from that horror movie Dad used to watch every october\"\n\n\"Lisa... bring me my flamm...\"\n\n\"NO, come on big brother, don't go full murderape on these two, I told you they are being tamed as we speak, didn't I?\"\n\n\"You told me I triggered their domestication instinct, and from what I remember that thing doesn't even exists!\"\n\n\"We are pretty much creating it, specially if you keep waving that blue shirt in front of them!\"\n\n\"Lisa, this shirt is red, also, how come this thing is causing them to... emmm, chirping-crying?, Cryping?, Chirying?\"\n\n\"For the last time brother, you were bitten by a colour scorpion, your eyes are tricking you into believe that some stuff has different colours, that is how the scorpion leads its prey back to its nest!\"\n\n\"Yeah, but I pummeled the motherfucker to the ground with my AK-47, so shut up and give me my flamm...!\"\n\n\"LISTEN UP YOU MURDER APE, THESE THINGS ACT LIKE DOGGOS ONCE THEY ARE DOMESTICATED!\"\n\nIn an split of a second, the small insectoid was sent flying as Nate fell to his knees focusing  on the gigantic tadpole, then, after a few seconds, the creature let out the single most horrible purr one could ever expect...\n\n\"Ohhhh, you are right Lisa, this big baby sounds just like Matilda!, I'm sure they will get along extremely well!\"\n\n\"Puaj, you had to throw me right into the feces?\" The insect flew up from a pile of mud and purple sphere shaped rocks \"And... you are right... the call of that thing really mirrors Matilda's...\"\n\n\"Oh, you are so smooth!, Who's a good girl?, Who's a good girl?\"\n\nNate pulled up the tadpole before sitting on the floor letting the creature rest on his lap, the horrible purring kept going, as if some sort of stray monster had found its way inside a cave, and yet, Nate couldn't be happier hearing it.\n\nThe slime began to coat Nate's arms, as it slowly but surely divided into two halves, one remaining with the tadpole, while the other began to solidify into a crystaline structure, resembling crystal claws, forming a protective coat all over the lenght of his arms.\n\n\"Uh,, neat, you just bonded with the slime, so, big brother, want me to call Matilda to get us to the ship?\"\n\n\"Yeah, I'm sure she will love these two fellas... hey, no biting!\" Nate groaned as he felt the tadpole bite his knee, surprisingly, the creature had three rows of teeth, each one looking more and more like broken glass rather than healthy teeth. \"Alright, Matilda should be here any second bro, also don't forget to take our new pet to the vet\"\n\n\"Thanks sis, What do you think that Mom made for dinner?\"\n\n\"Most likely she just boiled something barely organic, again, as she always do\"\n\nBoth giggled as a giant reptile, with four limbs, a pair of tails and four sets of wings began descending as fast as sound towards them, on its neck an small collar with the name \"Matilda, the big red dragoness\"...\n\n\n\n\n\n\n\n  \n(Disclaimer: written in less than five minutes, and felt way too lazy to edit it properly)", "comment_date": "2024-01-25 03:46:12 UTC"}
